&НаКлиенте
Перем ЕстьТочкиДоставкиСторонние;

&НаКлиенте
Перем ЕстьТочкиДоставкиСвои;

&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

// СЛУЖЕБНЫЕ {

&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули();
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер",        Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", Объект.ПараметрыКлиентСерверМетрика);
	
	ТолькоПросмотрСообщения = (Параметры.ТолькоПросмотр = Истина);

	Если ЗначениеЗаполнено(Сообщение) Тогда
		
		ТипСообщения 	= Сообщение.ТипСообщения;
		Направление 	= Сообщение.Направление;
		
	Иначе 
		
		ТипСообщения = "INVRPT";
		Параметры.Свойство("Направление", Направление);
						
		Сообщение = МодульОбъекта().ПолучитьСтруктуруСообщения(ТипСообщения, Направление);
		
	КонецЕсли;

	НастройкаФормы = МодульОбъекта().ПолучитьНастройкиФормыНезависимогоСообщения(ТипСообщения, Параметры.Направление);
	ВыполнитьНастройкиФормы(); 
	
	Если Параметры.Свойство("СообщениеСсылка") И ЗначениеЗаполнено(Параметры.СообщениеСсылка) Тогда
		
		СообщениеСсылка = Параметры.СообщениеСсылка;
		Сообщение = МодульОбъекта().ПрочитатьСообщение(СообщениеСсылка,, ТипСообщения, Параметры.Направление);
		
		СообщениеОбъект = МодульОбъекта().ПолучитьОбъектСообщения(СообщениеСсылка);
		ТекстОшибки = СообщениеОбъект.ОписаниеОшибки;
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
			
			Элементы.ГруппаОписаниеОшибки.Видимость = Истина;
			Элементы.ОписаниеОшибки.Заголовок = ТекстОшибки;
			
		КонецЕсли;

		ЗаполнитьПоляНаФорме();
		
	КонецЕсли;
	
	МодульОбъекта().ПриОткрытииФормыСообщения(Сообщение,ЭтаФорма);
	
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	УстановитьЗаголовокФормы_КонтурEDI();
	
 КонецПроцедуры
 
 &НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТолькоПросмотрСообщения = Ложь Тогда
		
		ОбновитьЕстьТочкиДоставкиИДоступностьКнопокПодбор();
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();
	
	Если ТолькоПросмотрСообщения = Ложь Тогда 
		
		ОбновитьЗначенияПолей();
		ОбновитьДоступностьЭлементов();
		
	КонецЕсли;
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "ФормаСообщенияINVRPTУправляемая");

КонецПроцедуры 

&НаСервере
Процедура УничтожитьТаблицыЗначенийПроизвольныхРеквизитов() Экспорт 
	
	Для Каждого ЭлементСтруктуры Из НастройкаФормы Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
			НастройкаФормы[ЭлементСтруктуры.Ключ] = Неопределено;	
		КонецЕсли;
	КонецЦикла;

	Для Каждого ЭлементСтруктуры Из Сообщение Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Или ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ДеревоЗначений") Тогда
			Сообщение[ЭлементСтруктуры.Ключ] = Неопределено;	
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище() Экспорт
	
	СтруктураВременногоХранилища = Новый Структура;
	
	СтруктураНастройкаФормы = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из НастройкаФормы Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
			СтруктураНастройкаФормы.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);	
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураНастройкаФормы.Количество() > 0 Тогда 
		СтруктураВременногоХранилища.Вставить("НастройкаФормы", СтруктураНастройкаФормы);	
	КонецЕсли;
	
	СтруктураСообщение = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из Сообщение Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Или ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ДеревоЗначений") Тогда
			СтруктураСообщение.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);	
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураСообщение.Количество() > 0 Тогда 
		СтруктураВременногоХранилища.Вставить("Сообщение", СтруктураСообщение);
	КонецЕсли;

	Если СтруктураВременногоХранилища.Количество() > 0 Тогда 
		АдресВХПроизвольныеРеквизиты = ПоместитьВоВременноеХранилище(СтруктураВременногоХранилища, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНастройкиФормы()

	ЗаполнитьСпискиВыбораПолей();
	ЗаполнитьСпискиВыбораКолонок();
	УстановитьТипыПолей1С();
	МодульОбъекта().УстановитьФорматЭлементаФормы_КонтурEDI(Элементы.ТоварыКоэффициентEDIВ1С);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораПолей()
	
	СпискиВыбораПолей = НастройкаФормы.СпискиВыбораПолей;
	
	Для каждого ТекСписок Из СпискиВыбораПолей Цикл
	    ЗаполнитьСписокВыбораЭлемента(ТекСписок.Ключ, ТекСписок.Значение);
	КонецЦикла;
	
КонецПроцедуры

 &НаСервере
Процедура ЗаполнитьСпискиВыбораКолонок()
	
	СпискиВыбораКолонок = НастройкаФормы.СпискиВыбораКолонок;
	
	Для каждого ТекСписок Из СпискиВыбораКолонок Цикл
		
	    ЗаполнитьСписокВыбораЭлемента("Товары" + ТекСписок.Ключ, ТекСписок.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораЭлемента(ИмяЭлемента, Знач Список)
	
	Элемент = Элементы[ИмяЭлемента];
	
	Элемент.СписокВыбора.Очистить();
	
	Для каждого Эл Из Список Цикл
		
		Элемент.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
		
	КонецЦикла;
	
	Количество = Элемент.СписокВыбора.Количество();
	
	ВложенныйРеквизит = Найти(Элемент.ПутьКДанным, ".") <> 0;
	
	Если Количество = 1 И НЕ ВложенныйРеквизит Тогда
		
		ЭтаФорма[Элемент.ПутьКДанным] = Элемент.СписокВыбора.Получить(0).Значение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляНаФорме()
	
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " № " + Сообщение.ДокументEDI.Номер + " от " + Формат(Сообщение.ДокументEDI.Дата, "ДЛФ=Д");
	
	ДокументДата  = Сообщение.ДокументEDI.Дата;
	ДокументНомер = Сообщение.ДокументEDI.Номер;
	
	Сообщение.Свойство("Партнер", Партнер);
	
	МыПоставщик = МодульОбъекта().ОпределитьКемМыЯвляемся(Сообщение) = "Поставщик"; 
	МыТорговаяСеть = НЕ МыПоставщик;
	
	Если МыПоставщик Тогда
		
		Контрагент = Сообщение.Покупатель1С;
		Организация = Сообщение.Продавец1С;
		
	Иначе 
		
		Контрганет = Сообщение.Продавец1С;
		Организация = Сообщение.Покупатель1С;
		
	КонецЕсли;
	
	Сообщение.Свойство("ДатаИнвентаризации", ДатаИнвентаризации);
	
	ПериодОтчета = Новый СтандартныйПериод;
	ПериодОтчета.ДатаНачала = Сообщение.ДатаНачалаПериодаОтчета;
	ПериодОтчета.ДатаОкончания = Сообщение.ДатаОкончанияПериодаОтчета; 
	
	Сообщение.Свойство("ТочкаДоставки1С", ТочкаДоставки);
	Сообщение.Свойство("Продавец1С",  Продавец);
	Сообщение.Свойство("Валюта1С", Валюта);
	Сообщение.Свойство("ТипЦен", ТипЦен);
	
	Для Каждого Строка Из Сообщение.Товары Цикл  
		
		ПересчитатьСтрокуТоваровСервер(Строка, , "В1С");
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		
		ПересчитатьСтрокуТоваровСервер(НоваяСтрока, , "ВEDI");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыПолей1С()
	
	ТипТипыЦен 					  = МодульОбъекта().ПолучитьТипЗначенияОбъекта("ТипыЦен");
	ТипВалюта 					  = МодульОбъекта().ПолучитьТипЗначенияОбъекта("Валюта");
	ТипНоменклатуры 		      = МодульОбъекта().ПолучитьТипЗначенияОбъекта("Номенклатура");
	ТипЕдиницыИзмерения     	  = МодульОбъекта().ПолучитьТипЗначенияОбъекта("ЕдиницаИзмерения");
	ТипХарактеристикаНоменклатуры = МодульОбъекта().ПолучитьТипЗначенияОбъекта("ХарактеристикаНоменклатуры");
	//ТипСкладОстатков 			  = МодульОбъекта().ПолучитьТипЗначенияОбъекта("ТочкаДоставкиСвоя");
	
	Если ЗначениеЗаполнено(ТипТипыЦен) Тогда
		
		Элементы.ТипЦен.ОграничениеТипа = Новый ОписаниеТипов(ТипТипыЦен);
		ТипЦен = МодульОбъекта().ПолучитьПустуюСсылкуОбъекта("ТипыЦен");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипВалюта) Тогда
		
		Элементы.Валюта.ОграничениеТипа = Новый ОписаниеТипов(ТипВалюта);
		Валюта = МодульОбъекта().ПолучитьПустуюСсылкуОбъекта("Валюта");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипНоменклатуры) Тогда
		
		Элементы.ТоварыНоменклатура.ОграничениеТипа = Новый ОписаниеТипов(ТипНоменклатуры);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипЕдиницыИзмерения) Тогда
		
		Элементы.ТоварыЕдиницаИзмерения.ОграничениеТипа = Новый ОписаниеТипов(ТипЕдиницыИзмерения);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипХарактеристикаНоменклатуры) Тогда
		
		Элементы.ТоварыХарактеристикаНоменклатуры.ОграничениеТипа = Новый ОписаниеТипов(ТипХарактеристикаНоменклатуры);
		ЕстьХарактеристикаНоменклатуры = Истина;
		
	Иначе 
		
		ЕстьХарактеристикаНоменклатуры = Ложь;
		Элементы.ТоварыХарактеристикаНоменклатуры.Видимость = Ложь;
	
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(ТипСкладОстатков) Тогда 
	//	
	//	Элементы.СкладОстатков.ОграничениеТипа = Новый ОписаниеТипов(ТипСкладОстатков);
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы_КонтурEDI()
	
	ПредставлениеТипаСообщения = НастройкаФормы.Заголовок;
	ПредставлениеДатыСообщения = МодульОбъекта().ПолучитьПредставлениеДатыСообщения(Сообщение);
	
	ЭтаФорма.Заголовок = ПредставлениеТипаСообщения + " (" + ТипСообщения + ") " + ПредставлениеДатыСообщения;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	Элементы.ДокументНомер.ТолькоПросмотр 		   = ТолькоПросмотрСообщения;
	Элементы.ДокументДата.ТолькоПросмотр 		   = ТолькоПросмотрСообщения;
	Элементы.Партнер.ТолькоПросмотр 			   = ТолькоПросмотрСообщения;
	Элементы.Организация.ТолькоПросмотр 		   = ТолькоПросмотрСообщения;
	Элементы.Контрагент.ТолькоПросмотр			   = ТолькоПросмотрСообщения;
	Элементы.Продавец.ТолькоПросмотр 			   = ТолькоПросмотрСообщения;
	Элементы.ТочкаДоставки.ТолькоПросмотр 		   = ТолькоПросмотрСообщения;
	Элементы.НесколькоТочекДоставки.ТолькоПросмотр = ТолькоПросмотрСообщения;
	Элементы.СкладОстатков.ТолькоПросмотр 	       = ТолькоПросмотрСообщения;
	Элементы.ПериодОтчета.ТолькоПросмотр 		   = ТолькоПросмотрСообщения;
	Элементы.ДатаИнвентаризации.ТолькоПросмотр     = ТолькоПросмотрСообщения;
	
	Элементы.ПодменюДобавить.Видимость 					   = НЕ ТолькоПросмотрСообщения;
	Элементы.ТоварыЗаполнитьТовары.Видимость 			   = НЕ ТолькоПросмотрСообщения;
	Элементы.ФормаОсновныеДействияФормыОтправить.Видимость = НЕ ТолькоПросмотрСообщения;
	Элементы.ГруппаСтраницаТочкиДоставкиСклады.Видимость   = НЕ ТолькоПросмотрСообщения;
	
	Элементы.СкладОстатков.Видимость 		= НЕ ТолькоПросмотрСообщения;
	Элементы.НадписьСкладОстатков.Видимость = НЕ ТолькоПросмотрСообщения;
	Элементы.НесколькоТочекДоставки.Видимость = НЕ ТолькоПросмотрСообщения;
	Элементы.ЗагрушкаОтступ.Видимость = НЕ ТолькоПросмотрСообщения;
	Элементы.ТоварыОчиститьТабличнуюЧасть.Видимость = НЕ ТолькоПросмотрСообщения;
	
	
	
	Элементы.Товары.ТолькоПросмотр = ТолькоПросмотрСообщения;
	Элементы.СоответствиеТочкаДоставкиСкладыОстатков.ТолькоПросмотр = ТолькоПросмотрСообщения;
	
	Если ТолькоПросмотрСообщения = Ложь Тогда 
		
		ВидимостьЭлементовПриРазделенииПоСкладам(Ложь);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьЭлементов()
	
	Если НЕ ТолькоПросмотрСообщения Тогда 
		
		ПартнерЗаполнен 	 = ЗначениеЗаполнено(Партнер);
		КонтрагентЗаполнен 	 = ЗначениеЗаполнено(Контрагент);
		ОрганизацияЗаполнена = ЗначениеЗаполнено(Организация);
		ПродавецЗаполнен 	 = ЗначениеЗаполнено(Продавец);
		ТочкаДоставкиЗаполнена = ЗначениеЗаполнено(ТочкаДоставки);
		
		Элементы.Контрагент.Доступность 			= ПартнерЗаполнен;
		Элементы.Продавец.Доступность 				= ПартнерЗаполнен И ОрганизацияЗаполнена И КонтрагентЗаполнен;
		Элементы.ТочкаДоставки.Доступность 			= ПартнерЗаполнен И ОрганизацияЗаполнена И КонтрагентЗаполнен И ПродавецЗаполнен И НЕ НесколькоТочекДоставки;
		Элементы.СкладОстатков.Доступность 			= ПартнерЗаполнен И ОрганизацияЗаполнена И КонтрагентЗаполнен И ПродавецЗаполнен И ТочкаДоставкиЗаполнена И НЕ НесколькоТочекДоставки;
		Элементы.НесколькоТочекДоставки.Доступность = ПартнерЗаполнен И ОрганизацияЗаполнена И КонтрагентЗаполнен И ПродавецЗаполнен;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПолеТочкаДоставки()
	
	ТочкаДоставки = Неопределено;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПолеСкладОстатков()
	
	МассивСкладовОстатков = ПолучитьСкладыОстатковТочкиДоставкиСервер(ТочкаДоставки);
	
	Если МассивСкладовОстатков.Количество() = 1 Тогда 
		
		СкладОстатков = МассивСкладовОстатков[0];
		
	ИначеЕсли МассивСкладовОстатков.Количество() > 1 Тогда
		
		МассивТочекДоставок = Новый Массив; 
		МассивТочекДоставок.Добавить(ТочкаДоставки);
		
		ЗаполнитьДеревоСоответствий(МассивТочекДоставок);
		
		НесколькоТочекДоставки = Истина;
		ВидимостьЭлементовПриРазделенииПоСкладам(Истина);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЕстьТочкиДоставкиИДоступностьКнопокПодбор()
	
	ЕстьТочкиДоставкиСвои = ЕстьЭлементыВСправочнике_НаСервере("ТочкиДоставкиСвои");
	
	Если ЗначениеЗаполнено(Партнер) Тогда 
		
		ЕстьТочкиДоставкиСторонние = ЕстьЭлементыВСправочнике_НаСервере("ТочкиДоставкиСторонние", Партнер);
		
		НастройкиПартнера = ПолучитьСписокСвойствEDI_НаСервере("ПартнерКакТорговаяСеть,ПартнерКакПоставщик", Партнер);
		
		ПартнерСеть 		= НастройкиПартнера.ПартнерКакТорговаяСеть = Истина;
		ПартнерПоставщик 	= НастройкиПартнера.ПартнерКакПоставщик = Истина;
		ПартнерДистрибьютор = ПартнерСеть И ПартнерПоставщик;
		
	Иначе 
		
		ЕстьТочкиДоставкиСторонние = Ложь; 
		ПартнерСеть 			   = Ложь;
		ПартнерПоставщик 		   = Ложь;
		ПартнерДистрибьютор		   = Ложь;
		
	КонецЕсли;
	
	Элементы.СоответствиеТочкаДоставкиСкладыОстатковПодборСвоиТочкиДоставки.Доступность = (ПартнерДистрибьютор ИЛИ ПартнерПоставщик) И ЕстьТочкиДоставкиСвои;
	Элементы.СоответствиеТочкаДоставкиСкладыОстатковПодборСторонниеТочкиДоставки.Доступность = (ПартнерДистрибьютор ИЛИ ПартнерСеть) И ЕстьТочкиДоставкиСторонние;
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбновитьЗначенияПолей()
	
	ОбновитьПолеКонтрагент();
	ОбновитьПолеПродавец();
	ОбновитьПолеТочкаДоставки();
	ОбновитьПолеСкладОстатков();	                             	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПолеПродавец()
	
	Продавец = ПолучитьПродавцаПоКонтрагентуИОрганизации_НаСервере(Контрагент, Организация);
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбновитьПолеКонтрагент()
	
	Контрагент = Неопределено;
	
	СписокВыбораКонтрагентов = Новый СписокЗначений;
	СписокВыбораКонтрагентов.ЗагрузитьЗначения(ПолучитьМассивКонтрагентовПартнера_Сервер(Партнер));
	
	ЗаполнитьСписокВыбораЭлемента("Контрагент", СписокВыбораКонтрагентов);
	
КонецПроцедуры

&НаКлиенте
Процедура Вопрос_КакиеТочкиДоставкиНеобходимоПодобрать()
	
	ИмяОбработчика 		 = "ПослеВыбораТипаПодбораТочкиДоставки"; 
	КонтекстОбработчика  = ЭтаФорма;
	ПараметрыОбработчика = Неопределено;
	ТекстВопроса 		 = "Какие точки доставки необходимо подобрать?"; 
	Таймаут	 			 = 0;
	КнопкаПоУмолчанию 	 = Неопределено;
	ЗаголовокФормы 			 = "Контур.EDI Выбор типа точек доставки";
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Свои точки доставки");
	Кнопки.Добавить("Сторонние точки доставки");
	
	МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика,
												   КонтекстОбработчика,
												   ПараметрыОбработчика,
												   ТекстВопроса,
												   Кнопки,
												   Таймаут,
												   КнопкаПоУмолчанию,
												   ЗаголовокФормы);

КонецПроцедуры
											   
&НаКлиенте
Процедура Вопрос_ОчисткаТоваров(Обработчик)
	
	ИмяОбработчика 		 = Обработчик; 
	КонтекстОбработчика  = ЭтаФорма;
	ПараметрыОбработчика = Неопределено;
	ТекстВопроса 		 = "Данные таблицы товаров будут очищены. Продолжить?"; 
	Таймаут	 			 = 0;
	КнопкаПоУмолчанию 	 = КодВозвратаДиалога.Отмена;
	ЗаголовокФормы 			 = "";
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, 		"Да");
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, 	"Отмена");
	
	МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика,
												   КонтекстОбработчика,
												   ПараметрыОбработчика,
												   ТекстВопроса,
												   Кнопки,
												   Таймаут,
												   КнопкаПоУмолчанию,
												   ЗаголовокФормы);
КонецПроцедуры
											   
&НаКлиенте
Процедура Вопрос_ЕстьВозможныеСообщенияСПустымиТоварами(СтруктураПараметры, ОписаниеОшибки)
	
	ИмяОбработчика 		 = "ПослеПредупрежденияОПустыхТоварах"; 
	КонтекстОбработчика  = ЭтаФорма;
	ПараметрыОбработчика = СтруктураПараметры;
	ТекстВопроса 		 = ОписаниеОшибки; 
	Таймаут	 			 = 0;
	КнопкаПоУмолчанию 	 = КодВозвратаДиалога.Отмена;
	ЗаголовокФормы 			 = "Контур.EDI.";
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, 		"ОК");
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, 	"Отмена");
	
	МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика,
												   КонтекстОбработчика,
												   ПараметрыОбработчика,
												   ТекстВопроса,
												   Кнопки,
												   Таймаут,
												   КнопкаПоУмолчанию,
												   ЗаголовокФормы);

КонецПроцедуры
											   
&НаКлиенте
Процедура Вопрос_ОтправлятьСообщениеЕслиНеУказаныТочкиДоставки()
	
	ИмяОбработчика 		 = "ПослеПодтвержденияОтправки"; 
	КонтекстОбработчика  = ЭтаФорма;
	ПараметрыОбработчика = Неопределено;
	ТекстВопроса 		 = "В сообщении не указаны точки доставки на вкладке ""Точки доставки / Склады"".
							|Отправить сообщение без указания точек доставки?"; 
	Таймаут	 			 = 0;
	КнопкаПоУмолчанию 	 = КодВозвратаДиалога.Отмена;
	ЗаголовокФормы 			 = "Контур.EDI.";
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, 		"Да");
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, 	"Отмена");
	
	МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика,
												   КонтекстОбработчика,
												   ПараметрыОбработчика,
												   ТекстВопроса,
												   Кнопки,
												   Таймаут,
												   КнопкаПоУмолчанию,
												   ЗаголовокФормы);

КонецПроцедуры
											   
&НаКлиенте
Процедура Вопрос_БудетОтправленоНесколькоСообщеений(СтруктураПараметры)

	ИмяОбработчика 		 = "ПослеПодтвержденияОтправкиНесколькихСообщений"; 
	КонтекстОбработчика  = ЭтаФорма;
	ПараметрыОбработчика = СтруктураПараметры;
	ТекстВопроса 		 = "Будут отправлены несколько сообщений INVRPT (" + СтруктураПараметры.СоответствиеТочкаДоставкиСкладыОстатков.Количество() + " шт.)"; 
	Таймаут	 			 = 0;
	КнопкаПоУмолчанию 	 = КодВозвратаДиалога.Отмена;
	ЗаголовокФормы 		 = "Контур.EDI. Отправка сообщений INVRPT";
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, 		"ОК");
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, 	"Отмена");
	
	МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика,
												   КонтекстОбработчика,
												   ПараметрыОбработчика,
												   ТекстВопроса,
												   Кнопки,
												   Таймаут,
												   КнопкаПоУмолчанию,
												   ЗаголовокФормы);

КонецПроцедуры
											   
&НаКлиенте
Процедура Вопрос_КтоЯвляетсяПродавцом()
	
	ИмяОбработчика 		 = "ПослеВыбораТипаПродавца"; 
	КонтекстОбработчика  = ЭтаФорма;
	ПараметрыОбработчика = Неопределено;
	ТекстВопроса 		 = "Выберите, кто является продавцом"; 
	Таймаут	 			 = 0;
	КнопкаПоУмолчанию 	 = Неопределено;
	ЗаголовокФормы 			 = "Контур.EDI";
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Наша организация");
	Кнопки.Добавить("Контрагент");
	
	МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика,
												   КонтекстОбработчика,
												   ПараметрыОбработчика,
												   ТекстВопроса,
												   Кнопки,
												   Таймаут,
												   КнопкаПоУмолчанию,
												   ЗаголовокФормы);

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивКонтрагентовПартнера_Сервер(_Партнер)
	
	Возврат МодульОбъекта().ПолучитьМассивКонтрагентовПартнера(_Партнер);
	
КонецФункции 

&НаСервере
Функция ПолучитьТипЗначенияОбъекта_НаСервере(ИмяОбъекта, ДляЗапроса = Ложь, ВернутьИмяВМетаданных = Ложь)
	
	Возврат МодульОбъекта().ПолучитьТипЗначенияОбъекта(ИмяОбъекта,ДляЗапроса,ВернутьИмяВМетаданных);
	
КонецФункции

&НаСервере
Функция ПолучитьПродавцаПоКонтрагентуИОрганизации_НаСервере(_Контрагент, _Организация, Текстом = Ложь)
	
	Возврат МодульОбъекта().ПолучитьПродавцаПоКонтрагентуИОрганизации(_Контрагент, _Организация, Текстом);
	
КонецФункции

&НаСервере
Функция ПолучитьРезультатВыбораИзУниверсальнойФормы_НаСервере(АдресВХ, Имя = "", Единственный = Истина)
	
	ПолученноеЗначение = МодульОбъекта().ПолучитьРезультатВыбораИзУниверсальнойФормы(АдресВХ);
	
	Если ЗначениеЗаполнено(ПолученноеЗначение)
		И ПолученноеЗначение.Количество() > 0 Тогда
		
		Если Единственный = Истина Тогда
			
			Возврат ПолученноеЗначение[0][Имя];
			
		Иначе 
			
			Возврат ПолученноеЗначение;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокСвойствEDI_НаСервере(СписокСвойств, Владелец = Неопределено)
	
	Возврат МодульОбъекта().ПолучитьСписокСвойствEDI(СписокСвойств, Владелец);
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыДляПодготовкиСообщения(ДополнительныеПараметры = Неопределено)
	
	СтруктураПараметры = Новый Структура;
	
	СтруктураПараметры.Вставить("Сообщение",	                Сообщение);
	СтруктураПараметры.Вставить("Организация",                  Организация);
	СтруктураПараметры.Вставить("Партнер",                   	Партнер);
	СтруктураПараметры.Вставить("Контрагент",                   Контрагент); 
	СтруктураПараметры.Вставить("ТочкаДоставки",                ТочкаДоставки);
	СтруктураПараметры.Вставить("ДатаНачалаПериода",            ПериодОтчета.ДатаНачала);
	СтруктураПараметры.Вставить("ДатаОкончанияПериода",         ПериодОтчета.ДатаОкончания);
	СтруктураПараметры.Вставить("ДатаИнвентаризации",         	ДатаИнвентаризации);
	СтруктураПараметры.Вставить("ВыгружатьЦены",         		ВыгружатьЦены);
	СтруктураПараметры.Вставить("Валюта",         				Валюта);
	СтруктураПараметры.Вставить("ТипЦен",         				ТипЦен);
	СтруктураПараметры.Вставить("Продавец",         			Продавец);
	СтруктураПараметры.Вставить("ДокументНомер",         		ДокументНомер);
	СтруктураПараметры.Вставить("ДокументДата",         		ДокументДата);
	
	Если ТипЗнч(Сообщение) = Тип("Структура")
		И Сообщение.Свойство("ID") 
		И ЗначениеЗаполнено(Сообщение.ID) Тогда 
		
	СтруктураПараметры.Вставить("ID", Сообщение.ID);
	
	КонецЕсли;
	
	МыПоставщик = МыПоставщик();
	МыТорговаяСеть = НЕ МыПоставщик;
	
	СтруктураПараметры.Вставить("МыПоставщик",         			МыПоставщик);
	СтруктураПараметры.Вставить("МыТорговаяСеть",         		МыТорговаяСеть);
	
	СтруктураПараметры.Вставить("СоответствиеТочкаДоставкиСкладыОстатков", ПолучитьСоответствиеТочкаДоставкиСкладыОстатков());
	
	Если ДополнительныеПараметры <> Неопределено 
		И ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		
		Для каждого Элемент Из ДополнительныеПараметры Цикл
			
			СтруктураПараметры.Вставить(Элемент.Ключ, Элемент.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
 
	Возврат СтруктураПараметры;
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеТочкаДоставкиСкладыОстатков() 
	
	Результат = Новый Массив;
	
	тДерево = РеквизитФормыВЗначение("СоответствиеТочкаДоставкиСкладыОстатков");
	
	Для Каждого СтрокаДерева1Уровень ИЗ тДерево.Строки Цикл
		
		Если ЗначениеЗаполнено(СтрокаДерева1Уровень.Значение) Тогда
			
			МассивСкладовОстатков = Новый Массив;
			
			Для Каждого СтрокаДерева2Уровень ИЗ СтрокаДерева1Уровень.Строки Цикл
				
				Если ЗначениеЗаполнено(СтрокаДерева2Уровень.Значение) Тогда
					
					МассивСкладовОстатков.Добавить(СтрокаДерева2Уровень.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Соответствие = Новый Структура("ТочкаДоставки, СкладыОстатков", СтрокаДерева1Уровень.Значение, МассивСкладовОстатков);
			Результат.Добавить(Соответствие);		 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда 
		
		Если ЗначениеЗаполнено(ТочкаДоставки) Тогда
			
			МассивСкладовОстатков = Новый Массив;

			Если ЗначениеЗаполнено(СкладОстатков) Тогда
				
				МассивСкладовОстатков.Добавить(СкладОстатков);
				
			КонецЕсли;
			
			Соответствие = Новый Структура("ТочкаДоставки, СкладыОстатков", ТочкаДоставки, МассивСкладовОстатков);
			Результат.Добавить(Соответствие);		 
			
		КонецЕсли;
		
	КонецЕсли;
			
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСкладыОстатковТочкиДоставкиСервер(_ТочкаДоставки)
	
	Возврат МодульОбъекта().ПолучитьСкладыОстатковТочкиДоставки(ТочкаДоставки);
	
КонецФункции

&НаСервере 
Функция ПолучитьАдресВнешнегоХранилищаДляТаблицыВыбора(Знач СписокВыбора, НазваниеКолонкиБезПробелов = "Значение") 
	
	ТаблицаВыбора = Новый ТаблицаЗначений;
	МодульОбъекта().ДобавитьКолонкиВТаблицуЗначений(ТаблицаВыбора, НазваниеКолонкиБезПробелов);
	
	Для Каждого ЭлементВыбора Из СписокВыбора Цикл 
		
		НоваяСтрока = ТаблицаВыбора.Добавить();
		НоваяСтрока[НазваниеКолонкиБезПробелов] = ЭлементВыбора.Значение;
		
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаВыбора);
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьДеревоСоответствий(МассивТочекДоставок)
	
	_СоответствиеТочкаДоставкиСкладыОстатков = РеквизитФормыВЗначение("СоответствиеТочкаДоставкиСкладыОстатков");
	
	Для каждого Значение ИЗ МассивТочекДоставок Цикл
		
		ПараметрыОтбора = Новый Структура("Значение", Значение);
		
		НайденныеСтроки = _СоответствиеТочкаДоставкиСкладыОстатков.Строки.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Сообщить("Точка доставки - """ + Значение + """ уже добавлена!");			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрокаТочкиДоставки = _СоответствиеТочкаДоставкиСкладыОстатков.Строки.Добавить();
		НоваяСтрокаТочкиДоставки.Значение = Значение;
		
		МассивСкладовОстатков = МодульОбъекта().ПолучитьСкладыОстатковТочкиДоставки(Значение);
		
		Для Каждого СкладОстатковТочкиДоставки ИЗ МассивСкладовОстатков Цикл 
			
			НоваяСтрокаСкладыОстатков = НоваяСтрокаТочкиДоставки.Строки.Добавить();
			НоваяСтрокаСкладыОстатков.Значение = СкладОстатковТочкиДоставки;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(_СоответствиеТочкаДоставкиСкладыОстатков, "СоответствиеТочкаДоставкиСкладыОстатков");

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТовары(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если НЕ ЗначениеЗаполнено(Партнер) Тогда 
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Не заполнено поле ""Партнер""");
		
		Возврат;
		
	КонецЕсли;
	
	Если Товары.Количество() <> 0 Тогда
		
		Вопрос_ОчисткаТоваров("ПослеВопросаОбОчисткеТоваров_ЗаполнитьТовары");
		
	Иначе 
		
		Результат = ЗаполнитьТоварыСервер();
		
		Если НЕ Результат.Успешно Тогда
			
			МодульОбъектаКлиент().Предупреждение_КонтурEDI(Результат.ОписаниеОшибки);			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТоварыСервер(ДополнительныеПараметры = Неопределено)
	
	Если ДополнительныеПараметры = Неопределено
		ИЛИ ДополнительныеПараметры.Свойство("Номенклатура") = Ложь Тогда

		Товары.Очистить();
		
	КонецЕсли;
	
	СтруктураПараметры = ПолучитьПараметрыДляПодготовкиСообщения(ДополнительныеПараметры);
	РезультатПолучения = МодульОбъекта().ПолучитьТоварыДляНезависимогоСообщения("INVRPT", СтруктураПараметры);
	
	Если РезультатПолучения.Успешно Тогда
		
		Для каждого Стр Из РезультатПолучения.Товары Цикл
			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);

			ПересчитатьСтрокуТоваровСервер(НоваяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ВозвращаемаяСтруктура = Новый Структура;
	ВозвращаемаяСтруктура.Вставить("Успешно", РезультатПолучения.Успешно);
	ВозвращаемаяСтруктура.Вставить("ОписаниеОшибки", РезультатПолучения.ОписаниеОшибки);
	
	Возврат ВозвращаемаяСтруктура;
	
КонецФункции

&НаКлиенте
Процедура ПодборСвоиТочкиДоставки(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ИмяОткрываемойФормы = "Справочник." + ПолучитьТипЗначенияОбъекта_НаСервере("ТочкаДоставкиСвоя", , Истина) + ".ФормаВыбора";
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ВладелецФормы_ = Элементы.СоответствиеТочкаДоставкиСкладыОстатков;
	Уникальность = ЭтаФорма;
		
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, ВладелецФормы_, Уникальность);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСторонниеТочкиДоставки(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если НЕ ЗначениеЗаполнено(Партнер) Тогда 
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Не заполнен ""Партнер""!");
		Возврат;
		
	КонецЕсли;
	
	ИмяОткрываемойФормы = "Справочник.КонтурEDI_ТочкиДоставки.ФормаВыбора";
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Партнер", Партнер));
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ВладелецФормы_ = Элементы.СоответствиеТочкаДоставкиСкладыОстатков;
	Уникальность = ЭтаФорма;
		
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, ВладелецФормы_, Уникальность);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеТоваров_ЗаполнитьТовары(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = КодВозвратаДиалога.Да Тогда
		
		Результат = ЗаполнитьТоварыСервер();
		
		Если НЕ Результат.Успешно Тогда
			
			МодульОбъектаКлиент().Предупреждение_КонтурEDI(Результат.ОписаниеОшибки);			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеТоваров_ОчиститьТовары(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = КодВозвратаДиалога.Да Тогда
		
		Товары.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияОтправки(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если ВыбранноеЗначение = КодВозвратаДиалога.Да Тогда 
		
		НачалоОтправкиСообщения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗначения(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
		
		ЗначениеВыбора = ПолучитьРезультатВыбораИзУниверсальнойФормы_НаСервере(ВыбранноеЗначение, ДополнительныеПараметры.Элемент.Имя);
		ЭтаФорма[ДополнительныеПараметры.Элемент.Имя] = ЗначениеВыбора;
		УниверсальныйПриИзменении(ДополнительныеПараметры.Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеПредупрежденияОПустыхТоварах(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Да Тогда 
		
		Возврат; 
		
	КонецЕсли;
	
	МассивТочекДоставокСПустымиТоварами = ДополнительныеПараметры.МассивТочекДоставокСПустымиТоварами;
	
	НаборСоответствие = Новый Массив;
	
	Для Каждого Соответствие Из ДополнительныеПараметры.СоответствиеТочкаДоставкиСкладыОстатков Цикл 
		
		_ТочкаДоставки = Соответствие.ТочкаДоставки;
		
		Если МассивТочекДоставокСПустымиТоварами.Найти(_ТочкаДоставки) = Неопределено Тогда 
			
			НаборСоответствие.Добавить(Соответствие);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнительныеПараметры.Вставить("СоответствиеТочкаДоставкиСкладыОстатков", НаборСоответствие); 
	КоличествоПолученныхСоответствий = НаборСоответствие.Количество();
	
	Если КоличествоПолученныхСоответствий > 1 Тогда 
		
		Вопрос_БудетОтправленоНесколькоСообщеений(ДополнительныеПараметры);		
	
	ИначеЕсли КоличествоПолученныхСоответствий = 0 Тогда
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Нет товаров для отправки");		
		
	Иначе 
		
		ОтправитьСообщение(ДополнительныеПараметры);
		Закрыть();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияОтправкиНесколькихСообщений(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Да Тогда 
		
		Возврат; 
		
	КонецЕсли;
	
	ОтправитьСообщение(ДополнительныеПараметры);
	Закрыть();
	
	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеВыбораТипаПродавца(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = "Наша организация" Тогда 

		ЗаполнитьСписокВыбораЭлемента("Продавец", Элементы.Организация.СписокВыбора); 
		
	ИначеЕсли ВыбранноеЗначение = "Контрагент" Тогда 
		
		ЗаполнитьСписокВыбораЭлемента("Продавец", Элементы.Контрагент.СписокВыбора); 
		
	Иначе 
		
		Возврат;
		
	КонецЕсли;
	
	ПоказатьВыборИзУниверсальнойФормы(Элементы.Продавец);
	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеВыбораТипаПодбораТочкиДоставки(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если ВыбранноеЗначение = "Свои точки доставки" Тогда
		
		НазваниеСправочника = "ТочкиДоставкиСвои";
		
	ИначеЕсли ВыбранноеЗначение = "Сторонние точки доставки" Тогда 
		
		НазваниеСправочника = "ТочкиДоставкиСторонние";
		
	Иначе 
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьСписокЗначенийТочкаДоставки_НаСервере(НазваниеСправочника, Партнер);
	ПоказатьВыборИзУниверсальнойФормы(Элементы.ТочкаДоставки);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораСоответствияИзМеню(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		
		ТекСтрока = Элементы.Товары.ТекущиеДанные;
		
		Если МыПоставщик() Тогда 
			
			КодТовараПартнера = ТекСтрока.КодТовараПокупателя;
			
		Иначе
			
			КодТовараПартнера = ТекСтрока.КодТовараПоставщика;
			
		КонецЕсли;

		
		Если ВыбранноеЗначение.Значение = "Настроить соответствие товаров" Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Партнер",		Партнер);
			ПараметрыФормы.Вставить("GTIN",			ТекСтрока.GTIN);
			ПараметрыФормы.Вставить("Наименование", ТекСтрока.Наименование);
			ПараметрыФормы.Вставить("КодТовараПартнера", КодТовараПартнера);
			ПараметрыФормы.Вставить("КодЕдиницыИзмеренияEDI", ТекСтрока.КодЕдиницыИзмеренияEDI);
			
			МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Номенклатура_ЭлементУправляемая", , ПараметрыФормы, ЭтаФорма, "ПослеИнтерактивнойНастройкиСоответствий", ЭтаФорма);
			
		Иначе
			ПересчитатьСтрокуТоваровКлиент(ТекСтрока, "В1С");
			
			СтруктураТовара = ВыбранноеЗначение.Значение;
			ЗаполнитьЗначенияСвойств(ТекСтрока, СтруктураТовара, "Номенклатура,ЕдиницаИзмерения,КодЕдиницыИзмеренияEDI,КоэффициентEDIВ1С");

			ПересчитатьСтрокуТоваровКлиент(ТекСтрока, "ВEDI");	
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИнтерактивнойНастройкиСоответствий(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ИдентификаторТекСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПослеИнтерактивнойНастройкиСоответствий_Сервер(ИдентификаторТекСтроки);//передать идентификатор строки
		
КонецПроцедуры

&НаСервере
Процедура ПослеИнтерактивнойНастройкиСоответствий_Сервер(ИдентификаторТекСтроки)     //найти строку по идентификатору
	
	ВыбраннаяСтрока = Товары.НайтиПоИдентификатору(ИдентификаторТекСтроки);
	
	Если МыПоставщик() Тогда 
		
		КодТовараПартнера = ВыбраннаяСтрока.КодТовараПокупателя;
		
	Иначе
		
		КодТовараПартнера = ВыбраннаяСтрока.КодТовараПоставщика;
		
	КонецЕсли;

	
	СоответствиеТоваров = МодульОбъекта().СоответствиеТоваров_НайтиНоменклатуру(ВыбраннаяСтрока.GTIN, КодТовараПартнера, Партнер);
	
	Для каждого Стр Из СоответствиеТоваров Цикл
		Если Стр.Номенклатура = ВыбраннаяСтрока.Номенклатура Тогда
			ПересчитатьСтрокуТоваровСервер(ВыбраннаяСтрока,, "В1С");	
			
			ВыбраннаяСтрока.Номенклатура 			= Стр.Номенклатура;
			ВыбраннаяСтрока.ЕдиницаИзмерения 		= Стр.ЕдиницаИзмерения;
			ВыбраннаяСтрока.КодЕдиницыИзмеренияEDI 	= Стр.ЕдиницаEDI;
			ВыбраннаяСтрока.КоэффициентEDIВ1С 		= Стр.КоэффициентEDIВ1С;
			
			ПересчитатьСтрокуТоваровСервер(ВыбраннаяСтрока,, "ВEDI");	
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодбораНоменклатуры(ВыбранаяНоменклатура, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранаяНоменклатура <> Неопределено Тогда
		
		СтруктураДопПараметры = Новый Структура("Номенклатура", ВыбранаяНоменклатура);
		Результат = ЗаполнитьТоварыСервер(СтруктураДопПараметры);
		
		Если НЕ Результат.Успешно Тогда
			
			МодульОбъектаКлиент().Предупреждение_КонтурEDI(Результат.ОписаниеОшибки);			
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеТоваровПоВыбраннымСкладам(ПроверяемоеСоответствие)
	
	Результат = Новый Структура("Успешно,ОписаниеОшибки,МассивТочекДоставокСПустымиТоварами", Истина, "");
	
	_Товары = РеквизитФормыВЗначение("Товары");
	
	МассивТочекДоставокСПустымиТоварами = Новый Массив;
	
	Для Каждого Соответствие Из ПроверяемоеСоответствие Цикл
		
		_ТочкаДоставки = Соответствие.ТочкаДоставки;
		_СкладыОстатков = Соответствие.СкладыОстатков;
		
		ПолученныеТовары = МодульОбъекта().ОтфильтроватьТаблицуТоваровПоСкладам(_Товары, _СкладыОстатков); 
		
		Если ПолученныеТовары.Количество() = 0
			И МассивТочекДоставокСПустымиТоварами.Найти(_ТочкаДоставки) = Неопределено Тогда
			
			МассивТочекДоставокСПустымиТоварами.Добавить(_ТочкаДоставки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивТочекДоставокСПустымиТоварами.Количество() <> 0 Тогда 
		
		Результат.Успешно = Ложь;
		
		ТекстОшибки = "Для указанных точек доставки, не найдены товары, которые соответствуют выбранным складам остатков:
					  |
					  |";
		
		Для Каждого ТочкаДоставкиСПустымиТоварами Из МассивТочекДоставокСПустымиТоварами Цикл
			
			ТекстОшибки = ТекстОшибки + " - " + ТочкаДоставкиСПустымиТоварами + Символы.ПС; 
			
		КонецЦикла;
		
		ТекстОшибки = ТекстОшибки + "
									 |по данным точкам доставки сообщение отправлено не будет.";
		
		Результат.ОписаниеОшибки = ТекстОшибки;
		
	КонецЕсли;
	
	Результат.МассивТочекДоставокСПустымиТоварами = МассивТочекДоставокСПустымиТоварами;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеТабличнойЧасти_КонтурEDI()
	
	Если Товары.Количество() = 0 Тогда 
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Заполните табличную часть ""Товары""");	
		Возврат Ложь;
		
	КонецЕсли;
	
	Успешно = Истина;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовары.GTIN)
			И НЕ ЗначениеЗаполнено(СтрокаТовары.КодТовараПокупателя)
			И НЕ ЗначениеЗаполнено(СтрокаТовары.КодТовараПоставщика) Тогда 
			
			Индекс = Товары.Индекс(СтрокаТовары);
			Сообщить = Новый СообщениеПользователю;
			Сообщить.Текст = "Заполните хотя бы один идентификатор товара 
							 | - GTIN 
							 | - Код товара покупателя
							 | - Код товара поставщика";
			
			Сообщить.Поле = "Товары["+Индекс+"].GTIN";
			Сообщить.Сообщить();
			
			Успешно = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Успешно;
	
КонецФункции 

// Универсальный Акцептор Нажатия Доавбленной Кнопки
&НаКлиенте
Процедура АкцепторДобавленнойКнопки(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	// Действия, которые нужно выполнить на клиенте, например что-то спросить
	КлиентскийКодОбработчика = ПолучитьКлиентскийКодОбработчикаНажатияКнопки(Команда.Имя);
	
	Если КлиентскийКодОбработчика <> Неопределено Тогда 
		// в этот момент мы знаем Команда.Имя и можем выполнить нужный код внутри КлиентскийКодОбработчика смотри описание функции ПолучитьКлиентскийКодОбработчикаНажатияКнопки
		// для дальнейшей передачи на сервер для обработки Использовать  ОбработчикИнтерактивногоДействияДобавленнойкнопки(РезультатДействия,ИмяКоманды)
		Выполнить(КлиентскийКодОбработчика); 	
	КонецЕсли;
	
	// Вне зависимости от наличия клиентского обработчика выполняем серверную процедуру	
	АкцепторДобавленнойКнопкиСервер(Команда.Имя);
	
КонецПроцедуры

//////Пример кода события "ПолучениеКодаКлиентскогоОбработчика"
//Если Команда.Имя = "ПроверитьАдекватность" Тогда
//	
//	ТекстВопроса ="Сколько будет 3 + 1000000 ?";
//	КнопкиВопроса=новый СписокЗначений;
//	КнопкиВопроса.Добавить("не знаю");
//	КнопкиВопроса.Добавить("1000003");
//	ДопПараметрДляПередачиВОбработчик=Команда.Имя;
//	РезультатВопроса = Неопределено;
//	Если Параметры.МодальностьЗапрещена Тогда                     
//		Выполнить("ПоказатьВопрос(Новый ОписаниеОповещения(""ОбработчикИнтерактивногоДействияДобавленнойкнопки"", ЭтаФорма, ДопПараметрДляПередачиВОбработчик), ТекстВопроса, КнопкиВопроса,,,""Контур.EDI"")");
//	Иначе
//		РезультатВопроса = Вопрос(ТекстВопроса, КнопкиВопроса,,,"Контур.EDI");
//		ОбработчикИнтерактивногоДействияДобавленнойкнопки(РезультатВопроса,ДопПараметрДляПередачиВОбработчик); 
//	КонецЕсли;
//КонецЕсли;
&НаСервере
Функция ПолучитьКлиентскийКодОбработчикаНажатияКнопки(ИмяКоманды)
	
	СтандартнаяОбработкаEDI = Истина;	
	КлиентскийКодОбработчика = МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ПолучениеКодаКлиентскогоОбработчика", СтандартнаяОбработкаEDI, Новый Структура("ИмяКоманды,Сообщение,Параметры,Форма", ИмяКоманды, Сообщение, Параметры, ЭтаФорма));
	
	Если ЗначениеЗаполнено(СокрЛП(КлиентскийКодОбработчика)) Тогда 
		Возврат КлиентскийКодОбработчика;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ПолучитьКлиентскийКодОбработчикаНажатияКнопки()

//если мы хотим в режиме запрета модальности спросить что-то у пользователя, то его ответ требуется положить в обработчик
&НаКлиенте
Процедура ОбработчикИнтерактивногоДействияДобавленнойкнопки(РезультатКлиента, ИмяКоманды) Экспорт
	
	АкцепторДобавленнойКнопкиСервер(ИмяКоманды,РезультатКлиента);	
	
КонецПроцедуры // ОбработчикИнтерактивногоДействияДобавленнойкнопки()

&НаСервере
Процедура АкцепторДобавленнойКнопкиСервер(ИмяКоманды, РезультатКлиента = Неопределено)
	
	СтандартнаяОбработкаEDI=истина;

	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("КнопкаФормыСообщенияНажатие", СтандартнаяОбработкаEDI,Новый Структура("ИмяКоманды,Сообщение,Параметры,Форма,РезультатКлиента", ИмяКоманды, Сообщение, Параметры, ЭтаФорма, РезультатКлиента));
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры

&НаКлиенте                                
Процедура ОбработкаОповещения(ИмяСобытияОповещения, Параметр, Источник)
	                                      //ждем  Параметр.ИмяКоманды, Параметр.Результат
	Если ИмяСобытияОповещения = "ОповещениеИзПодключаемогоМодуля" Тогда 
		АкцепторДобавленнойКнопкиСервер(Параметр.ИмяКоманды,Параметр.Результат)
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура УниверсальныйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.СписокВыбора.Количество() = 0 Тогда
		
		Если Элемент.Имя = "Партнер" Тогда 
			
			ТекстОшибки = "Не найдены партнеры, работающие с INVRPT. 
			|Проверьте настройки партнеров.";
			
		ИначеЕсли Элемент.Имя = "Организация" Тогда
			
			ТекстОшибки = "Не найдены наши организации. 
			|Проверьте ""Структура компании"" в общий настройках.";
			
		ИначеЕсли Элемент.Имя = "Контрагент" Тогда 
			
			ТекстОшибки = "Не найдены контрагенты партнера. 
			|Проверьте настройки партнера.";
			
		Иначе 
			
			ТекстОшибки = "Не найдены значения выбора."
			
		КонецЕсли;
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстОшибки);
		
		Возврат;
		
	КонецЕсли;
	
	ПоказатьВыборИзУниверсальнойФормы(Элемент);	
	
КонецПроцедуры

&НаКлиенте
Процедура УниверсальныйПриИзменении(Элемент)
	
	Если Элемент.Имя = "Партнер" Тогда
		
		ОбновитьПолеКонтрагент();
		ОбновитьПолеПродавец();
		ОбновитьПолеТочкаДоставки();
		ОбновитьПолеСкладОстатков();
		ОчиститьДеревоСоответствиеТочкаДоставкиСкладыОстатков();
		Товары.Очистить();
		
		ОбновитьЕстьТочкиДоставкиИДоступностьКнопокПодбор();
		
		
	ИначеЕсли Элемент.Имя = "Организация" Тогда 
		
		ОбновитьПолеПродавец();
		
	ИначеЕсли Элемент.Имя = "Контрагент" Тогда 
		
		ОбновитьПолеПродавец();
		
	ИначеЕсли Элемент.Имя = "ТочкаДоставки" Тогда 
		
		ОбновитьПолеСкладОстатков();
		
	КонецЕсли;
	
	ОчиститьЗначенияЭлементов();
	ОбновитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВыборИзУниверсальнойФормы(Элемент)
	
	АдресВнешнегоХранилища = ПолучитьАдресВнешнегоХранилищаДляТаблицыВыбора(Элемент.СписокВыбора, Элемент.Имя);
	
	ИмяОткрываемойФормы  = "УниверсальнаяФормаВыбораУправляемая"; 
	ПолныйПутьКФорме 	 = Неопределено;
	ПараметрыФормы 		 = Новый Структура("АдресТаблицыВХранилище", АдресВнешнегоХранилища);
	ВладелецФормы_ 		 = ЭтаФорма; 
	ИмяОбработчика 		 = "ПослеВыбораЗначения"; 
	КонтекстОбработчика  = ЭтаФорма; 
	ПараметрыОбработчика = Новый Структура("Элемент", Элемент);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI(ИмяОткрываемойФормы,
												 ПолныйПутьКФорме,
												 ПараметрыФормы,
												 ВладелецФормы_,
												 ИмяОбработчика,
												 КонтекстОбработчика,
												 ПараметрыОбработчика);
	
КонецПроцедуры

&НаСервере
Функция ЕстьЭлементыВСправочнике_НаСервере(НазваниеСправочника, Владелец = Неопределено) 
	
	Возврат МодульОбъекта().ЕстьЭлементыВСправочнике_КонтурEDI(НазваниеСправочника, Владелец);
	
КонецФункции

&НаСервере
Функция ПреобразоватьЮрФизЛицо_1С_в_EDI_НаСервере(Объект,ТипАдреса,ТолькоGLN = Ложь)
	
	Возврат МодульОбъекта().ПреобразоватьЮрФизЛицо_1С_в_EDI(Объект,ТипАдреса,ТолькоGLN);
	
КонецФункции

&НаКлиенте
Процедура НесколькоТочекДоставкиПриИзменении(Элемент)
	
	ВидимостьЭлементовПриРазделенииПоСкладам(НесколькоТочекДоставки);
	
	Если НесколькоТочекДоставки = Ложь Тогда 
		
		Элементы.СкладОстатков.Доступность = Ложь;	
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовПриРазделенииПоСкладам(Видимость = Истина) 
	
	Элементы.ГруппаСтраницаТочкиДоставкиСклады.Видимость = Видимость;
	
	ТочкаДоставки = Неопределено;
	СкладОстатков = Неопределено;
	
	Элементы.ТочкаДоставки.Доступность = НЕ Видимость;
	Элементы.СкладОстатков.Доступность = НЕ Видимость;	
	
	ОбновитьЕстьТочкиДоставкиИДоступностьКнопокПодбор();
	
	Если Видимость = Истина Тогда 
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаТочкиДоставкиСклады;
		
	Иначе 
		
		ОчиститьДеревоСоответствиеТочкаДоставкиСкладыОстатков();
		
	КонецЕсли;		

КонецПроцедуры

&НаСервере
Процедура ОчиститьДеревоСоответствиеТочкаДоставкиСкладыОстатков()
	
   тДерево = РеквизитФормыВЗначение("СоответствиеТочкаДоставкиСкладыОстатков");
 
   тДерево.Строки.Очистить();
 
   ЗначениеВРеквизитФормы(тДерево, "СоответствиеТочкаДоставкиСкладыОстатков");
   
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеТочкаДоставкиСкладыОстатковОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МассивВыбранныхЗначений = ВыбранноеЗначение;
	
	Если НЕ ЗначениеЗаполнено(МассивВыбранныхЗначений) Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьДеревоСоответствий(МассивВыбранныхЗначений);
	
КонецПроцедуры

&НаКлиенте
Процедура Подробно(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Видимость = НЕ (Элементы.ТоварыПодробно.Пометка = Истина);
	
	Подробно_ВидимостьКолонок(Видимость);
	
	Элементы.ТоварыПодробно.Пометка = Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура Подробно_ВидимостьКолонок(Видимость) 

	Элементы.ТоварыКодЕдиницыИзмеренияEDI.Видимость 	= Видимость;
	Элементы.ТоварыХарактеристикаНоменклатуры.Видимость = ЕстьХарактеристикаНоменклатуры И Видимость;
	Элементы.ТоварыМестонахождениеТовара1С.Видимость 	= Видимость;
	Элементы.ТоварыЗаказанноеКоличество.Видимость 		= Видимость;
	Элементы.ТоварыДоставленноеКоличество.Видимость 	= Видимость;
	Элементы.ТоварыПринятоеКоличество.Видимость			= Видимость;
	Элементы.ТоварыОстатокНаНачалоПериода.Видимость 	= Видимость;
	Элементы.ТоварыОстатокНаКонецПериода.Видимость 		= Видимость;
	Элементы.ТоварыПродажиЗаПериод.Видимость 			= Видимость;
	Элементы.ТоварыЦенаБезНДС.Видимость 				= Видимость;
	Элементы.ТоварыЦенаСНДС.Видимость 					= Видимость;
	
	Элементы.ТоварыТекущийОстатокРасчетный.Видимость    	 = Видимость;
	Элементы.ТоварыЗаказанноеКоличествоРасчетный.Видимость 	 = Видимость;
	Элементы.ТоварыДоставленноеКоличествоРасчетный.Видимость = Видимость;
	Элементы.ТоварыПринятоеКоличествоРасчетный.Видимость 	 = Видимость;
	Элементы.ТоварыОстатокНаНачалоПериодаРасчетный.Видимость = Видимость;
	Элементы.ТоварыОстатокНаКонецПериодаРасчетный.Видимость = Видимость;
	Элементы.ТоварыПродажиЗаПериодРасчетный.Видимость 		 = Видимость;
	Элементы.ТоварыЦенаБезНДСРасчетная.Видимость 			 = Видимость;
	Элементы.ТоварыЦенаСНДСРасчетная.Видимость 				 = Видимость;
	    
КонецПроцедуры

&НаСервере
Функция ОткрытьXMLСообщенияВызовСервера()
	
	_Товары = РеквизитФормыВЗначение("Товары");
	ТоварыКопия = _Товары.Скопировать();
	
	СтруктураПараметры = ПолучитьПараметрыДляПодготовкиСообщения();
	МассивСообщений = МодульОбъекта().ПолучитьМассивСообщенийINVRPTПоТочкамДоставки(ТоварыКопия, СтруктураПараметры);
	
	ПолученныйРезультат = Новый Массив;
	
	Для Каждого ИсходящееСообщение ИЗ МассивСообщений Цикл 
		
		РезультатКонвертации = МодульОбъекта().КонвертироватьИсходящееСообщениеПоНовому(ИсходящееСообщение);
		
		Если НЕ РезультатКонвертации.Успешно Тогда 
			
			Для каждого СтрокаОшибки из РезультатКонвертации.ТаблицаОшибок Цикл
				
				Сообщить(СтрокаОшибки.ТекстОшибки);
				
			КонецЦикла;
			
			Продолжить;
		КонецЕсли;
		
		ТекДок = Новый ТекстовыйДокумент;
		ТекДок.Прочитать(РезультатКонвертации.ПутьКФайлу, КодировкаТекста.UTF8);
		ПолученныйРезультат.Добавить(ТекДок.ПолучитьТекст());		
		
	КонецЦикла;
	
	Возврат ПолученныйРезультат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФайл(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если ПроверитьЗаполнение() = Ложь ИЛИ ПроверитьЗаполнениеТабличнойЧасти_КонтурEDI() = Ложь Тогда 
		Возврат;
	КонецЕсли;
	
	Результат = ОткрытьXMLСообщенияВызовСервера();
	
	Для Каждого ТекстФайла Из Результат Цикл 
		
		ТекДок = Новый ТекстовыйДокумент;
		ТекДок.УстановитьТекст(ТекстФайла);
		ИмяВремФайла = ПолучитьИмяВременногоФайла("xml");
		
		ТекДок.Записать(ИмяВремФайла,КодировкаТекста.UTF8);
		
		ЗапуститьПриложение(ИмяВремФайла);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыОтправить(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если ПроверитьЗаполнение() = Ложь ИЛИ ПроверитьЗаполнениеТабличнойЧасти_КонтурEDI() = Ложь Тогда 
		Возврат;
	КонецЕсли;
	
	Если НесколькоТочекДоставки = Истина И ПолучитьСоответствиеТочкаДоставкиСкладыОстатков().Количество() = 0 Тогда 
		
		Вопрос_ОтправлятьСообщениеЕслиНеУказаныТочкиДоставки();
		Возврат;
		
	КонецЕсли;
	
	НачалоОтправкиСообщения();
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоОтправкиСообщения()
	
	СтруктураПараметры = ПолучитьПараметрыДляПодготовкиСообщения();
	КоличествоСоответствий = СтруктураПараметры.СоответствиеТочкаДоставкиСкладыОстатков.Количество();
	
	Результат = ПроверитьНаличиеТоваровПоВыбраннымСкладам(СтруктураПараметры.СоответствиеТочкаДоставкиСкладыОстатков);
	
	Если Результат.Успешно = Ложь Тогда 
		
		СтруктураПараметры.Вставить("МассивТочекДоставокСПустымиТоварами", Результат.МассивТочекДоставокСПустымиТоварами);
		Вопрос_ЕстьВозможныеСообщенияСПустымиТоварами(СтруктураПараметры, Результат.ОписаниеОшибки);
		
	Иначе		
		
		Если КоличествоСоответствий > 1 Тогда 
			
			Вопрос_БудетОтправленоНесколькоСообщеений(СтруктураПараметры);
			
		Иначе
			
			ОтправитьСообщение(СтруктураПараметры);
			Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщение(СтруктураПараметры)
	
	_Товары = РеквизитФормыВЗначение("Товары");
	ТоварыКопия = _Товары.Скопировать();
	
	Если ЗначениеЗаполнено(СообщениеСсылка) Тогда 
		
		СтруктураПараметры.Вставить("СообщениеСсылка", СообщениеСсылка);		
		
	КонецЕсли;
	
	МодульОбъекта().ОтправитьНезависимоеСообщение("INVRPT", ТоварыКопия, СтруктураПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуБезПримененияДействия(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	ЭтаФорма.Закрыть(СообщениеСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОдинИлиГруппуТоваров(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если НЕ ЗначениеЗаполнено(Партнер) Тогда 
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Не заполнено поле ""Партнер""");
		
		Возврат;
		
	КонецЕсли;
	
	ВыбратьГруппу = (Команда.Имя = "ДобавитьГруппу");
	
	ПараметрыФормыВыбораНоменклатуры = Новый Структура;
	
	Если ВыбратьГруппу Тогда 
		ПараметрыФормыВыбораНоменклатуры.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Группы);
	Иначе
		ПараметрыФормыВыбораНоменклатуры.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
		ПараметрыФормыВыбораНоменклатуры.Вставить("РежимВыбора",Истина);
	КонецЕсли;
	
	ТипНоменклатуры = ПолучитьТипЗначенияОбъекта_НаСервере("Номенклатура",,Истина);
	ИмяФормыВыбора= ?(ВыбратьГруппу, "Справочник." + ТипНоменклатуры + ".ФормаВыбораГруппы", "Справочник." + ТипНоменклатуры + ".ФормаВыбора");
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI(ИмяФормыВыбора, "", ПараметрыФормыВыбораНоменклатуры, ЭтаФорма, "ПослеПодбораНоменклатуры", ЭтаФорма);

КонецПроцедуры

&НаСервере
Функция МыПоставщик()
	
	СмоглиОпределитьПартнера =  МодульОбъекта().ОпределитьПартнера(Новый Структура("ТипЗначения, ЮрФизЛицо, Сообщение","ЮрФизЛицо", Продавец, Сообщение));
	
	Если ЗначениеЗаполнено(СмоглиОпределитьПартнера) Тогда 
		Возврат Ложь
	Иначе 
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТочкаДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиПартнера = ПолучитьСписокСвойствEDI_НаСервере("ПартнерКакТорговаяСеть,ПартнерКакПоставщик", Партнер);
	ПартнерСеть         = НастройкиПартнера.ПартнерКакТорговаяСеть = Истина;
	ПартнерПоставщик    = НастройкиПартнера.ПартнерКакПоставщик    = Истина;
	ПартнерДистрибьютор = ПартнерСеть И ПартнерПоставщик;
	
	Если ПартнерДистрибьютор И ЕстьТочкиДоставкиСторонние И ЕстьТочкиДоставкиСвои Тогда
		
		Вопрос_КакиеТочкиДоставкиНеобходимоПодобрать();
		
	ИначеЕсли ПартнерСеть И ЕстьТочкиДоставкиСторонние Тогда 
		
		ЗаполнитьСписокЗначенийТочкаДоставки_НаСервере("ТочкиДоставкиСторонние", Партнер);
		ПоказатьВыборИзУниверсальнойФормы(Элементы.ТочкаДоставки);
		
	ИначеЕсли ЕстьТочкиДоставкиСвои Тогда
		
		ЗаполнитьСписокЗначенийТочкаДоставки_НаСервере("ТочкиДоставкиСвои");
		ПоказатьВыборИзУниверсальнойФормы(Элементы.ТочкаДоставки);
		
	Иначе 
									
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Точек доставки не обнаружено!");
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗначенийТочкаДоставки_НаСервере(НазваниеСправочника, _Партнер = Неопределено)
	
	Если НазваниеСправочника = "ТочкиДоставкиСвои" Тогда 
		
		СписокЭлементовСправочника = МодульОбъекта().ПолучитьСписокЭлементовСправочника(НазваниеСправочника);
		НазваниеКолонки = "ТочкаДоставки";
		
	Иначе 
		
		СписокЭлементовСправочника = МодульОбъекта().ПолучитьСписокЭлементовСправочника(НазваниеСправочника, _Партнер);
		НазваниеКолонки = "Ссылка";
		
	КонецЕсли;
	
	МассивТочекДоставок = СписокЭлементовСправочника.ВыгрузитьКолонку(НазваниеКолонки);
	СписокЗначенийТочекДоставок = Новый СписокЗначений;
	СписокЗначенийТочекДоставок.ЗагрузитьЗначения(МассивТочекДоставок);
	
	ЗаполнитьСписокВыбораЭлемента("ТочкаДоставки", СписокЗначенийТочекДоставок) 
	
КонецПроцедуры

&НаКлиенте
Процедура ПродавецНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КтоЯвляетсяПродавцом = ПолучитьПродавцаПоКонтрагентуИОрганизации_НаСервере(Контрагент, Организация, Истина);
	
	Если КтоЯвляетсяПродавцом = "Организация" Тогда 
		
		ЗаполнитьСписокВыбораЭлемента("Продавец", Элементы.Организация.СписокВыбора); 
		ПоказатьВыборИзУниверсальнойФормы(Элементы.Продавец);
		
	ИначеЕсли КтоЯвляетсяПродавцом = "Контрагент" Тогда 
		
		ЗаполнитьСписокВыбораЭлемента("Продавец", Элементы.Контрагент.СписокВыбора); 
		ПоказатьВыборИзУниверсальнойФормы(Элементы.Продавец);
		
	Иначе
		
		Вопрос_КтоЯвляетсяПродавцом();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗначенияЭлементов()
	
	Если НЕ ЗначениеЗаполнено(Партнер) Тогда 
		
		Контрагент    = Неопределено;
		Продавец 	  = Неопределено;
		ТочкаДоставки = Неопределено;
		СкладОстатков = Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда 
		
		Продавец      = Неопределено; 
		ТочкаДоставки = Неопределено;
		СкладОстатков = Неопределено;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
		
		Продавец = Неопределено; 
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТочкаДоставки) Тогда 
		
		СкладОстатков = Неопределено;
		
	КонецЕсли;
	
	ОбновитьДоступностьЭлементов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерОткрытие(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Партнер) = Ложь Тогда 
		
		Возврат; 
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаПартнера", Партнер);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Партнеры_ЭлементУправляемая", , ПараметрыФормы, ЭтаФорма, "ПослеОткрытииКарточкиПартнера", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытииКарточкиПартнера(Параметр, ДополнительныеПараметры = Неопределено) Экспорт 
	
	 УниверсальныйПриИзменении(Элементы.Партнер);
	
КонецПроцедуры

&НаКлиенте
Процедура СкладОстатковНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТипСкладОстатков = ПолучитьТипЗначенияОбъекта_НаСервере("ТочкаДоставкиСвоя",,Истина);
	ИмяФормыВыбора = "Справочник." + ТипСкладОстатков + ".ФормаВыбора";
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI(ИмяФормыВыбора, "", ПараметрыФормыВыбора, ЭтаФорма, "ОбработчикПослеВыбораСкладОстатков", ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеВыбораСкладОстатков(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
		
		СкладОстатков = ВыбранноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТолькоПросмотрСообщения = Истина Тогда 
		
		Возврат;                                              
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Партнер) Тогда 
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Не заполнено поле ""Партнер""");
		
		Возврат;
		
	КонецЕсли;
	
	ИмяКолонки = Поле.Имя;
	
	Если ИмяКолонки = "ТоварыНоменклатура"
		ИЛИ ИмяКолонки = "ТоварыЕдиницаИзмерения"
		ИЛИ ИмяКолонки = "ТоварыНаименование"
		ИЛИ ИмяКолонки = "ТоварыКодЕдиницыИзмеренияEDI" 
		ИЛИ ИмяКолонки = "ТоварыХарактеристикаНоменклатуры" 
		ИЛИ ИмяКолонки = "ТоварыКоэффициентEDIВ1С"
		Тогда
		
		СтандартнаяОбработка = Ложь;
		ТекСтрока = Элементы.Товары.ТекущиеДанные;
		
		Если МыПоставщик() Тогда 
			
			КодТовараПартнера = ТекСтрока.КодТовараПокупателя;
			
		Иначе
			
		    КодТовараПартнера = ТекСтрока.КодТовараПоставщика;
			
		КонецЕсли;
		
		СписокВыбора = СоставитьСписокВыбораПоСтрокеТоваров(ТекСтрока.GTIN, КодТовараПартнера, Партнер);
		
		МодульОбъектаКлиент().ВыбратьИзМеню_КонтурEDI("ПослеВыбораСоответствияИзМеню",ЭтаФорма,,СписокВыбора,Элемент);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СоставитьСписокВыбораПоСтрокеТоваров(GTIN, КодТовараПартнера, Партнер)
	
	СоответствиеТоваров = МодульОбъекта().СоответствиеТоваров_НайтиНоменклатуру(GTIN, КодТовараПартнера, Партнер);
	
	СписокВыбора = Новый СписокЗначений;
	Для Каждого Стр Из СоответствиеТоваров Цикл
		
		СтруктураТовара = Новый Структура();
		
		СтруктураТовара.Вставить("Номенклатура",				Стр.Номенклатура);
		СтруктураТовара.Вставить("ХарактеристикаНоменклатуры",	Стр.ХарактеристикаНоменклатуры);
		СтруктураТовара.Вставить("ЕдиницаИзмерения",			Стр.ЕдиницаИзмерения);
		СтруктураТовара.Вставить("КодЕдиницыИзмеренияEDI",		Стр.ЕдиницаEDI);
		СтруктураТовара.Вставить("КоэффициентEDIВ1С",			Стр.КоэффициентEDIВ1С);
		
		Представление = СокрЛП(Стр.Номенклатура);
		Если ЗначениеЗаполнено(Стр.ХарактеристикаНоменклатуры) Тогда
			Представление = Представление+", "+СокрЛП(Стр.ХарактеристикаНоменклатуры);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
			Представление = Представление + ", " + СокрЛП(Стр.ЕдиницаИзмерения);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.ЕдиницаEDI) Тогда
			Представление = Представление + ", " + СокрЛП(Стр.ЕдиницаEDI);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.КоэффициентEDIВ1С) Тогда
			Представление = Представление + ", коэф. " + СокрЛП(Стр.КоэффициентEDIВ1С);
		КонецЕсли;
		
		СписокВыбора.Добавить(СтруктураТовара, Представление);
		
	КонецЦикла;
	
	СписокВыбора.Добавить("Настроить соответствие товаров",,,);
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Процедура ПересчитатьСтрокуТоваровСервер(Строка = Неопределено, ИдентификаторТекСтроки = Неопределено, Направление = "ВEDI")
	
	СтрокаДляПересчета = Неопределено;
	
	Если НЕ ИдентификаторТекСтроки = Неопределено Тогда
		СтрокаДляПересчета = Товары.НайтиПоИдентификатору(ИдентификаторТекСтроки);
	ИначеЕсли Не Строка = Неопределено Тогда
		СтрокаДляПересчета = Строка;	
	Иначе
		Возврат;
	КонецЕсли;	

	МодульОбъекта().ПересчитатьСтрокуТоваровНезависимогоСообщения(СтрокаДляПересчета, Направление);	
		
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуТоваровКлиент(ТекСтрока, Направление = "ВEDI")

	ИдентификаторТекСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПересчитатьСтрокуТоваровСервер(, ИдентификаторТекСтроки, Направление);	
		
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличнуюЧасть(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Вопрос_ОчисткаТоваров("ПослеВопросаОбОчисткеТоваров_ОчиститьТовары");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ПараметрыФормыВыбора = Новый Структура;
	ДополнительныеПараметры = Новый Структура("ТекущиеДанные", ТекущиеДанные);
	
	Если ИмяКонфигурации1С = "УФ_УТ" Тогда 
		
		ПараметрыФормыВыбора.Вставить("ТекущийЭлемент"  , ТекущиеДанные.ХарактеристикаНоменклатуры);
		ПараметрыФормыВыбора.Вставить("Номенклатура"    , ТекущиеДанные.Номенклатура);
		
	ИначеЕсли ИмяКонфигурации1С = "УФ_УНФ" Тогда
		
		ОтборХарактеристик = Новый Структура;
		ОтборХарактеристик.Вставить("Владелец",ТекущиеДанные.Номенклатура);
		ПараметрыФормыВыбора.Вставить("Отбор"  , ОтборХарактеристик);
		ПараметрыФормыВыбора.Вставить("ТекущаяСтрока"  , ТекущиеДанные.ХарактеристикаНоменклатуры);
		                               
	Иначе
		Возврат; //на БП30 нет характеристик
	КонецЕсли;
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора", "", ПараметрыФормыВыбора, ЭтаФорма, "ДобавитьХарактеристикуЗавершение", ЭтаФорма, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьХарактеристикуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	Характеристика = Результат;
	Если Характеристика = Неопределено Тогда
		Возврат;
	Иначе
		ТекущиеДанные.ХарактеристикаНоменклатуры = Характеристика;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПересчетВEDI(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСтрокуТоваровКлиент(ТекСтрока,"ВEDI");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПересчетВ1С(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСтрокуТоваровКлиент(ТекСтрока,"В1С");

КонецПроцедуры

&НаКлиенте
Процедура КакиеТоварыНеПопадутВТаблицуКнопка(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ТекстПодсказки = "При стандартном заполнении не будут добавлены товары:
					|
					| - если указан склад остатков и товара нет на остатках указаных складов;
					| - если не указан склад остатков и товара нет на остатках;
					|
					|Для разработки своего алгоритма заполнения товаров можно
					|воспользоваться событием ""ПолучитьТоварыДляНезависимогоСообщения"" 
					|подключаемого модуля или расширения.";
					
	МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПодсказки);
	
КонецПроцедуры
 
//{ Центр поддержки

&НаКлиенте
Процедура ПомощьЦентрПоддержкиОшибкиСообщения(Команда)
	
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
	ОбращениеВЦентрПоддержкиПоОшибкам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбращениеВЦентрПоддержкиПоОшибкам() Экспорт
	
	ДопКонтекстДляЦентраПоддержки = Новый Структура;
	ДопКонтекстДляЦентраПоддержки.Вставить("МассивОшибок", МассивОшибокСообщения_КонтурEDI());
	ДопКонтекстДляЦентраПоддержки.Вставить("СообщениеСсылка", СообщениеСсылка);
			
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПараметрыСессии", МодульОбъектаКлиент().СформироватьПараметрыЦентраПоддержки(ДопКонтекстДляЦентраПоддержки));
	
	МодульОбъектаКлиент().ОткрытьЦентрПоддержки(ДопПараметры);
	
КонецПроцедуры 

&НаКлиенте
Функция МассивОшибокСообщения_КонтурEDI()
	
	МассивОшибок = Новый Массив;
	МассивОшибок.Добавить(Элементы.ОписаниеОшибки.Заголовок);
			
	Возврат МассивОшибок;
	
КонецФункции 

//}