&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	Параметры.МодальностьЗапрещена = МодульОбъекта().МодальностьЗапрещена();
	Документ = Параметры.Документ;
	Партнер = Параметры.Партнер;
	
	Если Параметры.ИсточникРасхождений = "ОбратныйЗаказ" Тогда
		
		ЭтаФорма.Заголовок = "Обработка уточнений по обратному заказу";
		
		Элементы.ТабСуммаБезНДСВНакладной.Видимость = Ложь;
		Элементы.ТабСуммаБезНДСПринято.Видимость = Ложь;
		Элементы.ТабСуммаСНДСВНакладной.Видимость = Ложь;
		Элементы.ТабСуммаСНДСПринято.Видимость = Ложь;
		Элементы.ТабКодыМаркировкиВНакладнойПредставление.Видимость = Ложь;
		Элементы.ТабКодыМаркировкиПринятоПредставление.Видимость = Ложь;
		
		Элементы.ПодменюОбработатьРезультатПриемки.Видимость = Ложь;
		
	Иначе
		
		Элементы.ФормаПеренестиВДокумент1С.Видимость = Ложь;
		
		ПодменюОбработкиРезультатов = Элементы.ПодменюОбработатьРезультатПриемки;
		ПодменюОбработкиРезультатов.ЦветФона = Новый Цвет(255,225,0);
		ПодменюОбработкиРезультатов.ШрифтЗаголовка = Новый Шрифт(ПодменюОбработкиРезультатов.ШрифтЗаголовка,,,Истина);
		
		Если Метаданные.Документы.Найти("КорректировкаРеализации")=Неопределено Тогда
			Элементы.ФормаСоздатьКорректировку.Видимость = Ложь;
		КонецЕсли;	
		
		ПараметрыОбработкиРасхождений = МодульОбъекта().ПолучитьСписокСвойствEDI("СверятьВRECADVЦеныИСтавки
																                 |ОтправлятьВозвратнуюТаруВDESADV
																				 |СверятьВRECADVКодыМаркировки
																				 |ЗагружатьКодыМаркировкиИзRECADV",
																				 Партнер);
																				 
		СверятьВRECADVЦеныИСтавки 		= ПараметрыОбработкиРасхождений.СверятьВRECADVЦеныИСтавки = Истина;
		СверятьВRECADVКодыМаркировки 	= ПараметрыОбработкиРасхождений.СверятьВRECADVКодыМаркировки = Истина;
		ЗагружатьВRECDAVКодыМаркировки 	= ПараметрыОбработкиРасхождений.ЗагружатьКодыМаркировкиИзRECADV = Истина И СверятьВRECADVКодыМаркировки;
		ОтправлятьВозвратнуюТаруВDESADV	= ПараметрыОбработкиРасхождений.ОтправлятьВозвратнуюТаруВDESADV = Истина;
		
		Если СверятьВRECADVЦеныИСтавки Тогда
			ТекстПодсказки = "Перенести расхождения в накладную (будут перенесены количества и цены)";
		Иначе
			ТекстПодсказки = "Перенести расхождения в накладную (будут перенесены только количества)";
		КонецЕсли;
		
		Элементы.ПодменюОбработатьРезультатПриемки.Подсказка = ТекстПодсказки;
		
		Если Не СверятьВRECADVЦеныИСтавки Тогда
			
			ИменаНевидимыхКолонок = Новый Массив;
			ИменаНевидимыхКолонок.Добавить("ТабЦенаБезНДС");
			ИменаНевидимыхКолонок.Добавить("ТабЦенаСНДС");
			ИменаНевидимыхКолонок.Добавить("ТабСуммаБезНДС");
			ИменаНевидимыхКолонок.Добавить("ТабСуммаСНДС");
			
			Для Каждого ИмяКолонки Из ИменаНевидимыхКолонок Цикл
				
				Элементы[ИмяКолонки + "ВНакладной"].Видимость = Ложь;
				Элементы[ИмяКолонки + "Принято"].Видимость = Ложь;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не СверятьВRECADVКодыМаркировки Тогда
			Элементы.ТабКодыМаркировкиВНакладнойПредставление.Видимость = Ложь;
			Элементы.ТабКодыМаркировкиПринятоПредставление.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + ": " + Документ;
	
	Если Объект.ПараметрыКлиентСервер.Имяконфигурации1С = "БП" ИЛИ Объект.ПараметрыКлиентСервер.Имяконфигурации1С = "УФ_БП" Тогда
		
		Элементы.ТабХарактеристикаНоменклатуры.Видимость = Ложь;
		Элементы.ТабСерияНоменклатуры.Видимость = Ложь;
		
		Если МодульОбъекта().ПолучитьТипЗначенияОбъекта("ВходящийЗаказПокупателя",,Истина) = "схРеализацияСельхозПродукции" Тогда
			Элементы.ФормаСоздатьВозвратОтПокупателя.Доступность = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ТипДокументаВозврат = МодульОбъекта().ПолучитьТипЗначенияОбъекта("ВходящийВозврат",,Истина);
	
	Если Метаданные.Перечисления.Найти("ВидыОперацийВозвратТоваровОтПокупателя") <> Неопределено Тогда
		
		Если МодульОбъекта().ПеременнаяСодержитСвойство(Перечисления.ВидыОперацийВозвратТоваровОтПокупателя, "Товары") Тогда
			ВидОперацииВозвратаБП = Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.Товары;
		ИначеЕсли МодульОбъекта().ПеременнаяСодержитСвойство(Перечисления.ВидыОперацийВозвратТоваровОтПокупателя, "ПродажаКомиссия") Тогда
			ВидОперацииВозвратаБП = Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПродажаКомиссия;
		Иначе
			ВидОперацииВозвратаБП = Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.Получить(0);
		КонецЕсли;
		
	КонецЕсли;
	
	Успешно = Истина;
	ДеревоРасхождений = РеквизитФормыВЗначение("Таб",Тип("ДеревоЗначений"));
	
	МодульОбъекта().ЗаполнитьДеревоРасхожденийДокумента(ДеревоРасхождений,Документ,Параметры.ИсточникРасхождений,Успешно,,Параметры.СообщениеСсылка);
	
	Если Не Успешно Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПоместитьДеревоВХранилище(ДеревоРасхождений);
	ВосстановитьДеревоИзХранилища(ДеревоСРасхождениями);
	
	МодульОбъекта().ПриОткрытииФормыОбработкиРасхождений(Параметры.СообщениеСсылка, ЭтаФорма);
	
КонецПроцедуры

// #Область Действия_Кнопок

&НаКлиенте
Процедура ПеренестиВДокумент1С(Команда)//для обратных заказов               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ВосстановитьДеревоИзХранилища(ДеревоСоВсемиТоварами);
	
	Если Не ЕстьВсеСоответствия() Тогда
		ТекстПредупреждения="Невозможно выполнить выбранное действие: для некоторых строк не установлены соответствия товаров.";
		Если Параметры.МодальностьЗапрещена Тогда 
			Выполнить("ПоказатьПредупреждение(,ТекстПредупреждения,,""Контур.EDI"")");
		Иначе
			Предупреждение(ТекстПредупреждения,,"Контур.EDI");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ПеренестиВЗаказСервер() Тогда 
		ЭтаФорма.Закрыть(Неопределено); // неопределено - гарантированно вычеркнем строку в режиме вычеркивания, ведь нам удалось её обработать
	КонецЕсли;
	
КонецПроцедуры

// Обрабатываем расхождения на сервере
&НаСервере
Функция ПеренестиВЗаказСервер()
	
	ДеревоРасхождений = ПолучитьИзВременногоХранилища(ДеревоСоВсемиТоварами);
	
	ТабСоответствий = МодульОбъекта().РазложитьДеревоСоответствийВТаблицу(ДеревоРасхождений);
	МодульОбъекта().ПересчитатьТабРасхожденийПриемки(ТабСоответствий);
	
	Попытка
		
		Док = Документ.ПолучитьОбъект();
		МодульОбъекта().ЗаполнитьТоварыДокументаПоПриемке_Реализация_Заказ(Док, ТабСоответствий, "Заказ");
		
		Если Док.Проведен Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;	
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		
		Док.Записать(РежимЗаписи);
		
	Исключение
		
		ТекстОшибки = "Не удалось перенести расхождения в документ заказа - " + ОписаниеОшибки();
		МодульОбъекта().ЗаписьЖурналаРегистрации_КонтурEDI(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;				
		
	КонецПопытки;
	
	МодульОбъекта().УстановитьСтатусДокумента(Документ, "НетРасхождений", "ОбратныйЗаказ");
	
	Возврат Истина;

КонецФункции // ПеренестиВЗаказСервер()

&НаКлиенте
Процедура ПеренестиВДокументРеализация(Команда)//для обработок recadv               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ВосстановитьДеревоИзХранилища(ДеревоСоВсемиТоварами);
	
	Если Не ЕстьВсеСоответствия() Тогда
		ТекстПредупреждения="Невозможно выполнить выбранное действие: для некоторых строк не установлены соответствия товаров.";
		Если Параметры.МодальностьЗапрещена Тогда 
			Выполнить("ПоказатьПредупреждение(,ТекстПредупреждения,,""Контур.EDI"")");
		Иначе
			Предупреждение(ТекстПредупреждения,,"Контур.EDI");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	РезультатОбработки = ПеренестиВДокументРеализацияСервер();
	
	Если РезультатОбработки.ЗакрытьФорму = Истина Тогда 
		ЭтаФорма.Закрыть(Параметры.СообщениеСсылка);
	КонецЕсли;
	
	Для каждого ТекстСообщения Из РезультатОбработки.СообщенияПользователю Цикл
		Сообщить(ТекстСообщения);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиВДокументРеализацияСервер()

	СтандартнаяОбработкаEDI = Истина;
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("ЗакрытьФорму", Истина);
	РезультатОбработки.Вставить("СообщенияПользователю", Новый Массив);
	
	ДеревоРасхождений = ПолучитьИзВременногоХранилища(ДеревоСоВсемиТоварами);
	
	ТабСоответствий = МодульОбъекта().РазложитьДеревоСоответствийВТаблицу(ДеревоРасхождений);
	МодульОбъекта().ПересчитатьТабРасхожденийПриемки(ТабСоответствий);
	
	ПараметрыПМ = Новый Структура("Накладная,ТаблицаРасхождений,ВыбранноеДействие,СообщениеСсылка");
	
	ПараметрыПМ.Накладная = Документ;
	ПараметрыПМ.ТаблицаРасхождений = ТабСоответствий;
	ПараметрыПМ.ВыбранноеДействие = "ПеренестиВДокумент";
	ПараметрыПМ.СообщениеСсылка = Параметры.СообщениеСсылка;
	
	Результат = 
	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ОбработатьРасхожденияРезультатовПриемки", СтандартнаяОбработкаEDI, ПараметрыПМ);
	
	Если СтандартнаяОбработкаEDI = Истина Тогда
		
		Док = Документ.ПолучитьОбъект();
		
		МодульОбъекта().ЗаполнитьТоварыДокументаПоПриемке_Реализация_Заказ(Док, ТабСоответствий, "Реализация");
		
		Если ЗагружатьВRECDAVКодыМаркировки
			И Не МодульОбъекта().СистемаУчетаМаркировкиДляОбработкиПриемки(Документ) = "КонтурМаркировка" Тогда
			
			РезультатЗагрузки = МодульОбъекта().ЗагрузитьКодыМаркировкиИзПриемки_КонтурEDI(Док, 
																	   					   ПолучитьТаблицуКодовМаркировкиПриемки(), 
																	   					   Документ,
																						   Параметры.СообщениеСсылка);
																						   
			Если Не РезультатЗагрузки.Успешно Тогда
				
				ТекстОшибки = "Не удалось перенести коды маркировки в документ " + Док.Ссылка + " по причине: 
							  |" + РезультатЗагрузки.ОписаниеОшибки + "
							  |Необходимо выполнить перенос кодов маркировки в документ вручную.";
				РезультатОбработки.СообщенияПользователю.Добавить(ТекстОшибки);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// продублировано из обычных форм	
		Попытка
			
			Если Док.Проведен Тогда
				Док.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				Док.Записать(РежимЗаписиДокумента.Запись);	
			КонецЕсли;
			
		Исключение
			
			ТекстОшибки = "Не удалось обработать расхождения по причине:" + ОписаниеОшибки();
			
			РезультатОбработки.ЗакрытьФорму = Ложь;
			РезультатОбработки.СообщенияПользователю.Добавить(ТекстОшибки);
			
			Возврат РезультатОбработки;
			
		КонецПопытки;
		
		Если ЗагружатьВRECDAVКодыМаркировки
			И МодульОбъекта().СистемаУчетаМаркировкиДляОбработкиПриемки(Документ) = "КонтурМаркировка" Тогда
			
			РезультатЗагрузки = МодульОбъекта().ЗагрузитьКодыМаркировкиИзПриемки_КонтурEDI(Док, 
																	   					   ПолучитьТаблицуКодовМаркировкиПриемки(), 
																	   					   Документ,
																						   Параметры.СообщениеСсылка);
																						   
			Если Не РезультатЗагрузки.Успешно Тогда
				
				ТекстОшибки = "Не удалось перенести коды маркировки в документ " + Док.Ссылка + " по причине: 
							  |" + РезультатЗагрузки.ОписаниеОшибки + "
							  |Необходимо выполнить перенос кодов маркировки в документ вручную.";
				РезультатОбработки.СообщенияПользователю.Добавить(ТекстОшибки);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//В УНФ перезаполнение СФ вызывается из формы документа РасходнаяНакладная в обработчике ПослеЗаписи
		Если МодульОбъекта().ИмяКонфигурации1С = "УФ_УНФ" Тогда
			
			РезультатПерезаполненияУНФ = ПерезаполнитьСчетФактуру_УНФ(Док.Ссылка);
			
			Если НЕ РезультатПерезаполненияУНФ.Успешно Тогда
				
				ТекстСообщения = "Не удалось перезаполнить счет-фактуру по причине:" + РезультатПерезаполненияУНФ.ОписаниеОшибки;
				РезультатОбработки.СообщенияПользователю.Добавить(ТекстСообщения);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// перенесли в документ
		МодульОбъекта().УстановитьСтатусДокумента(Документ,"НакладнаяПринятЧастичноОбработан","Приемка",Параметры.СообщениеСсылка);
		
		// проверим, был ли уже отправлен INVIOC
		СчетФактура = МодульОбъекта().ПолучитьСчетФактуруНакладной(Документ);
		СообщениеINVOIC = МодульОбъекта().НайтиСообщениеДокумента(СчетФактура,"INVOIC");
		
		Если СообщениеINVOIC <> Неопределено Тогда
			
			// Будем просить переотправить INVOIC в любом случае
			// +надо указать в ошибке причину, почему мы это требуем
			
			МодульОбъекта().УстановитьСтатусСообщения(СообщениеINVOIC,	, "INVOIC", "ИсходящийОжидаетИсправленияОшибок");
			
			СообщениеОбъект = МодульОбъекта().ПолучитьОбъектСообщения(СообщениеINVOIC);
			СообщениеОбъект.ОписаниеОшибки = "Внимание! Была произведена обработка расхождений RECADV после отправки INVOIC! Требуется переотправить INVOIC";
			
			МодульОбъекта().СохранитьОбъектСообщения(СообщениеОбъект);
			
		КонецЕсли;
		
	    // Для УФ_УТ изменения серий
		// Програмно нажимаем кнопку Заполнить серии по FEFO
		Если Объект.ПараметрыКлиентСервер.Имяконфигурации1С = "УФ_УТ" Тогда
			
			Попытка
				Выполнить("ЕстьСтрокиСЗаполняемымиПоFEFOСериями=НоменклатураСервер.ЕстьСтрокиСЗаполняемымиПоFEFOСериями(Док.Товары);");
			Исключение
				ЕстьСтрокиСЗаполняемымиПоFEFOСериями=Ложь;
			КонецПопытки;
			
			Если ЕстьСтрокиСЗаполняемымиПоFEFOСериями Тогда
				
				Попытка
					Выполнить("НоменклатураСервер.ЗаполнитьСерииПоFEFO(Док, Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Док, Документы.РеализацияТоваровУслуг)));");	
				Исключение
					МодульОбъекта().ЗаписьЖурналаРегистрации_КонтурEDI(УровеньЖурналаРегистрации.Ошибка, "Не удалось заполнить серии при создании реализации - " + ОписаниеОшибки());	
				Конецпопытки;
				
			КонецЕсли;
			
			Попытка
				
				Если Док.Проведен Тогда
					Док.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					Док.Записать(РежимЗаписиДокумента.Запись);	
				КонецЕсли;
				
			Исключение
				
				ТекстОшибки = "Не удалось обработать расхождения по причине:" + ОписаниеОшибки();
				РезультатОбработки.ЗакрытьФорму = Ложь;
				РезультатОбработки.СообщенияПользователю.Добавить(ТекстОшибки);
				
				Возврат РезультатОбработки;
				
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли; //СтандартнаяОбработкаEDI = Истина 
	
	// Можно выполнить какие-то еще действия. Например, обработать возвратную тару, если выбрали действие "Создать корректировку реализации".
	// Документ - сама Реализация.     	
	ПараметрыПМ = Новый Структура("Накладная,ВыбранноеДействие,ТаблицаРасхождений,СообщениеСсылка");
	
	ПараметрыПМ.Накладная = Документ;
	ПараметрыПМ.ВыбранноеДействие = "Реализация";
	ПараметрыПМ.ТаблицаРасхождений = ТабСоответствий;
	ПараметрыПМ.СообщениеСсылка = Параметры.СообщениеСсылка;
	
	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ПослеОбработкиРасхожденияРезультатовПриемки", СтандартнаяОбработкаEDI, ПараметрыПМ); 
																			
	Если Результат = Ложь Тогда 
		РезультатОбработки.ЗакрытьФорму = Ложь;
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции 

&НаСервере
Функция ПерезаполнитьСчетФактуру_УНФ(ДокументРеализация)
	
	Результат = МодульОбъекта().ПерезаполнитьСчетФактуру_УНФ(ДокументРеализация);
	      	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СоздатьВозвратОтПокупателя(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ОбработатьПриемку("СоздатьВозврат")
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПриемку(ВыбранноеДействие)
	
	ПараметрыФормыДокумента = Новый Структура;  
   	
	Если ВыбранноеДействие = "СоздатьКорректировку" Тогда  
		
		ПараметрыФормыДокумента.Вставить("Основание", Документ); 
		ФормаДокумента = ПолучитьФорму("Документ.КорректировкаРеализации.ФормаОбъекта", ПараметрыФормыДокумента); 
		
	ИначеЕсли ВыбранноеДействие = "СоздатьВозврат" Тогда 
		
		Если Объект.ПараметрыКлиентСервер.ИмяКонфигурации1С = "УФ_БП" И ЗначениеЗаполнено(ВидОперацииВозвратаБП) Тогда
				
			ЗначенияЗаполнения = Новый Структура;
			ЗначенияЗаполнения.Вставить("ВидОперации", ВидОперацииВозвратаБП);
			ПараметрыФормыДокумента.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения); 
			
		КонецЕсли;
		
		ФормаДокумента = ПолучитьФорму("Документ." + ТипДокументаВозврат + ".ФормаОбъекта", ПараметрыФормыДокумента); 
		
	Иначе		
		Возврат;		
	КонецЕсли;
	
	ДанныеФормы = ФормаДокумента.Объект;
	
	СтандартнаяОбработкаEDI = Истина;
	
	РезультатЗаполненияДанныхФормы = ЗаполнитьДанныеФормыДокументаНаСервере(ДанныеФормы, ВыбранноеДействие, СтандартнаяОбработкаEDI);
		
	Если СтандартнаяОбработкаEDI Тогда
		
		КопироватьДанныеФормы(ДанныеФормы, ФормаДокумента.Объект);
				
		Если Объект.ПараметрыКлиентСервер.ИмяКонфигурации1С = "УФ_УТ" Тогда
			Попытка
				Если ЗначениеЗаполнено(ФормаДокумента.Объект.ДокументОснование) И Найти(ФормаДокумента.ПредставлениеДокументаОснования,"<не выбран>") > 0 Тогда
					// поправить представление заполненного документа основания
					ФормаДокумента.ПредставлениеДокументаОснования = ФормаДокумента.Объект.ДокументОснование; 
				КонецЕсли;
			Исключение
				// этих реквизитов нет
				_ОписаниеОшибки = ОписаниеОшибки();	
			КонецПопытки;
		КонецЕсли;	
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("ФормаОбъекта", ФормаДокумента);
		ПараметрыОповещения.Вставить("ВыбранноеДействие", ВыбранноеДействие);
		
		Если Параметры.МодальностьЗапрещена Тогда
			
			ФормаДокумента.ОписаниеОповещенияОЗакрытии = Вычислить("Новый ОписаниеОповещения(""ОбработчикПослеСозданияДокумента_Клиент"", ЭтаФорма, ПараметрыОповещения)");
		    ФормаДокумента.Открыть();
			
		Иначе
			
			ФормаДокумента.ОткрытьМодально();
			ОбработчикПослеСозданияДокумента_Клиент(Неопределено, ПараметрыОповещения); 
		
		КонецЕсли;
				
		Если ТипЗнч(РезультатЗаполненияДанныхФормы) = Тип("Массив") Тогда
			
			Для каждого СообщениеПользователю Из РезультатЗаполненияДанныхФормы Цикл
				Сообщить(СообщениеПользователю);
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли РезультатЗаполненияДанныхФормы = Истина Тогда
			
		Закрыть();
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировку(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ОбработатьПриемку("СоздатьКорректировку");
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеСозданияДокумента_Клиент(Результат, ДопПараметры) Экспорт
	
	ДокументСсылка = Неопределено;
	
	Если ДопПараметры.Свойство("ФормаОбъекта") 
		И ТипЗнч(ДопПараметры.ФормаОбъекта) = Тип("УправляемаяФорма") Тогда
		
		ДокументСсылка = ДопПараметры.ФормаОбъекта.Объект.Ссылка;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		ДопПараметры.Вставить("ФормаОбъекта", Неопределено);
	
		РезультатОбработки = ОбработчикПослеСозданияДокумента_Сервер(ДокументСсылка, ДопПараметры);
		
		Если РезультатОбработки.ЗакрытьФорму = Истина И Открыта() Тогда
			Закрыть();
		КонецЕсли;
		
		Для каждого СообщениеПользователю Из РезультатОбработки.СообщенияДляПользователя Цикл
			Сообщить(СообщениеПользователю);
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Функция ОбработчикПослеСозданияДокумента_Сервер(ДокументСсылка, ДопПараметры) Экспорт
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("ЗакрытьФорму", Истина);
	РезультатОбработки.Вставить("СообщенияДляПользователя", Новый Массив);
	
	Если ДокументСсылка <> Неопределено Тогда
		
		МодульОбъекта().УстановитьСтатусДокумента(Документ, "НакладнаяПринятЧастичноОбработан", "Приемка", Параметры.СообщениеСсылка);
		
		Если ДопПараметры.ВыбранноеДействие = "СоздатьКорректировку"
			И ЗагружатьВRECDAVКодыМаркировки 
			И МодульОбъекта().СистемаУчетаМаркировкиДляОбработкиПриемки(Документ) = "КонтурМаркировка" Тогда
						
			РезультатЗагрузки = МодульОбъекта().ЗагрузитьКодыМаркировкиИзПриемки_КонтурEDI(ДокументСсылка.ПолучитьОбъект(), 
											   						   					   ПолучитьТаблицуКодовМаркировкиПриемки(), 
																	   					   Документ,
																						   Параметры.СообщениеСсылка);
																	   
			Если Не РезультатЗагрузки.Успешно Тогда
				ТекстОшибки = "Не удалось перенести коды маркировки в документ " + ДокументСсылка + " по причине: 
							  |" + РезультатЗагрузки.ОписаниеОшибки + "
							  |Необходимо выполнить перенос кодов маркировки в документ вручную.";
				РезультатОбработки.СообщенияДляПользователя.Добавить(ТекстОшибки);
			КонецЕсли;																	   
			
		КонецЕсли;
		
		ПараметрыПМ = Новый Структура("Накладная,ВыбранноеДействие,ТаблицаРасхождений,СообщениеСсылка");
		
		ПараметрыПМ.Накладная = ДокументСсылка;
		
		Если ДопПараметры.ВыбранноеДействие = "СоздатьКорректировку" Тогда
			
			ПараметрыПМ.ВыбранноеДействие = "КорректировкаРеализации";
			
		ИначеЕсли ДопПараметры.ВыбранноеДействие = "СоздатьВозврат" Тогда
			
			ПараметрыПМ.ВыбранноеДействие = "Возврат";
			
		КонецЕсли;
		
		ДеревоРасхождений = ПолучитьИзВременногоХранилища(ДеревоСоВсемиТоварами);
		
		_Таб = МодульОбъекта().РазложитьДеревоСоответствийВТаблицу(ДеревоРасхождений);
		МодульОбъекта().ПересчитатьТабРасхожденийПриемки(_Таб); 
		
		ПараметрыПМ.ТаблицаРасхождений = _Таб;
		ПараметрыПМ.СообщениеСсылка = Параметры.СообщениеСсылка;
		
		МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ПослеОбработкиРасхожденияРезультатовПриемки",, ПараметрыПМ);
		  		
	КонецЕсли; 
	
	Возврат РезультатОбработки;
	
КонецФункции 

&НаСервере
Функция ЗаполнитьДанныеФормыДокументаНаСервере(ДанныеФормы, ВыбранноеДействие, СтандартнаяОбработкаEDI)
	
	СтандартнаяОбработкаEDI = Истина;
	
	ДеревоРасхождений = ПолучитьИзВременногоХранилища(ДеревоСоВсемиТоварами);
	
	_Таб = МодульОбъекта().РазложитьДеревоСоответствийВТаблицу(ДеревоРасхождений);
	МодульОбъекта().ПересчитатьТабРасхожденийПриемки(_Таб);
	
	ПараметрыПМ = Новый Структура("Накладная,ТаблицаРасхождений,ВыбранноеДействие,СообщениеСсылка");
	
	ПараметрыПМ.Накладная = Документ;
	ПараметрыПМ.ТаблицаРасхождений = _Таб;
	ПараметрыПМ.ВыбранноеДействие = ВыбранноеДействие;
	ПараметрыПМ.СообщениеСсылка = Параметры.СообщениеСсылка; 
	
	РезультатПМ = МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ОбработатьРасхожденияРезультатовПриемки", СтандартнаяОбработкаEDI, ПараметрыПМ);
	
	Если СтандартнаяОбработкаEDI = Ложь Тогда
		Возврат РезультатПМ;
	КонецЕсли;
	
	МассивОшибок = Новый Массив;
	
	Если ВыбранноеДействие = "СоздатьКорректировку" Тогда
		
		ДокументКорректировки = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.КорректировкаРеализации"));
		
		ДокументКорректировки = МодульОбъекта().СоздатьКорректировкуПоРезультатамПриемки_КонтурEDI(_Таб, Документ, Истина, ДокументКорректировки);
				
		Если ДокументКорректировки <> Неопределено Тогда
			
			Если ЗагружатьВRECDAVКодыМаркировки 
				И Не МодульОбъекта.СистемаУчетаМаркировкиДляОбработкиПриемки(Документ) = "КонтурМаркировка" Тогда
				
				РезультатЗагрузки = МодульОбъекта().ЗагрузитьКодыМаркировкиИзПриемки_КонтурEDI(ДокументКорректировки, 
				ПолучитьТаблицуКодовМаркировкиПриемки(), 
				Документ,
				Параметры.СообщениеСсылка);
				
				Если Не РезультатЗагрузки.Успешно Тогда
					
					ТекстОшибки = "Не удалось перенести коды маркировки в документ корректировки по причине: 
					|" + РезультатЗагрузки.ОписаниеОшибки + "
					|Необходимо выполнить перенос кодов маркировки в документ вручную.";
					
					МассивОшибок.Добавить(ТекстОшибки);
					
				КонецЕсли;																	   
				
			КонецЕсли;
			
			ЗначениеВДанныеФормы(ДокументКорректировки, ДанныеФормы);

			ЗаполнитьСлужебныеРеквизитыВДанныхФормыКоллеции_КонтурEDI(ДанныеФормы, ВыбранноеДействие, ДокументКорректировки);
				
		КонецЕсли;
		
	ИначеЕсли ВыбранноеДействие = "СоздатьВозврат" Тогда
		
		ДокументВозврат = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект." + ТипДокументаВозврат));
		
		ДокументВозврат = МодульОбъекта().СоздатьВозвратПоРезультатамПриемки_КонтурEDI(_Таб, Документ, Истина, ДокументВозврат);
		
		Если ДокументВозврат <> Неопределено Тогда
			
			ЗначениеВДанныеФормы(ДокументВозврат, ДанныеФормы);
			
			ЗаполнитьСлужебныеРеквизитыВДанныхФормыКоллеции_КонтурEDI(ДанныеФормы, ВыбранноеДействие, ДокументВозврат);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивОшибок;
	
КонецФункции

&НаСервере
Функция СоответствиеДействийВТабличнойЧастиПоНоменклатуре(ДанныеФормы, ВыбранноеДействие)
	
	ДействияПоТабличнойЧасти = Новый Соответствие;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", ОписаниеСлужебногоРеквизита("ХарактеристикиИспользуются"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", ОписаниеСлужебногоРеквизита("ТипНоменклатуры"));
		
	Если ВыбранноеДействие = "СоздатьКорректировку" Тогда
		
		ДействияПоТабличнойЧасти.Вставить(ДанныеФормы.Расхождения, СтруктураДействий); 
		
		КопияСтруктураДействий = МодульОбъекта().КонтурСтандарт_СкопироватьРекурсивно(СтруктураДействий);
		
		КопияСтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", ОписаниеСлужебногоРеквизита("Артикул"));
		
		ДействияПоТабличнойЧасти.Вставить(ДанныеФормы.Товары, КопияСтруктураДействий);
		
	ИначеЕсли ВыбранноеДействие = "СоздатьВозврат" Тогда 
		
		СтруктураДействий.ЗаполнитьПризнакХарактеристикиИспользуются.Вставить("НоменклатураОприходование", "ХарактеристикиИспользуютсяОприходование");
		
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", ОписаниеСлужебногоРеквизита("Артикул"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакВедетсяУчетПоГТД", ОписаниеСлужебногоРеквизита("ВедетсяУчетПоГТД"));
		
		ДействияПоТабличнойЧасти.Вставить(ДанныеФормы.Товары, СтруктураДействий);
		
	КонецЕсли;
	
	Возврат ДействияПоТабличнойЧасти;
	
КонецФункции

&НаСервере
Функция ОписаниеСлужебногоРеквизита(ИмяСлужебногоРеквизита)
	Возврат Новый Структура("Номенклатура", ИмяСлужебногоРеквизита);
КонецФункции

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыВДанныхФормыКоллеции_КонтурEDI(ДанныеФормы, ВыбранноеДействие, ДокументПриемник)
	
	Если Не Объект.ПараметрыКлиентСервер.ИмяКонфигурации1С = "УФ_УТ" Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеДействий = СоответствиеДействийВТабличнойЧастиПоНоменклатуре(ДанныеФормы, ВыбранноеДействие);
	                          
	Попытка
		
		ОбщийМодуль_НоменклатураСервер = МодульОбъекта().ОбщийМодуль1С_КонтурEDI("НоменклатураСервер");
		
		Для Каждого КлючИЗначение Из СоответствиеДействий Цикл 
			
			ТабличнаяЧастьФормы = КлючИЗначение.Ключ; 
			СтруктураДействий 	= КлючИЗначение.Значение; 
			
			ОбщийМодуль_НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(ТабличнаяЧастьФормы, СтруктураДействий);
			
		КонецЦикла;
		
	Исключение
		
		ПриемникПредставление = ДокументПриемник.Метаданные().ПредставлениеОбъекта;
		
		ТекстОшибки = "Не удалось заполнить служебные реквизиты формы документа '%1' - %2";
		
		ТекстОшибки = МодульОбъекта().КонтурСтандарт_СтрШаблон_(ТекстОшибки, ПриемникПредставление, ОписаниеОшибки());
		
		МодульОбъекта().ЗаписьЖурналаРегистрации_КонтурEDI(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ИгнорироватьРасхождения(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	ИгнорироватьРасхожденияСервер();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ИгнорироватьРасхожденияСервер()
	
	МодульОбъекта().УстановитьСтатусДокумента(Документ,"НакладнаяПринятЧастичноОбработан","Приемка",Параметры.СообщениеСсылка);
	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ПослеОбработкиРасхожденияРезультатовПриемки",,
														Новый Структура("Накладная,ВыбранноеДействие,ТаблицаРасхождений,СообщениеСсылка",
																		Документ, "Игнорировать", Неопределено, Параметры.СообщениеСсылка));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ПоказатьЗначение(Неопределено, Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеТовары(Команда)
	
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Кнопка = Элементы.ТабПоказатьВсеТовары;
	Кнопка.Пометка = Не Кнопка.Пометка;
	
	Если Кнопка.Пометка Тогда
		АдресВХранилище = ДеревоСоВсемиТоварами;
	Иначе
		АдресВХранилище = ДеревоСРасхождениями;
	КонецЕсли;
	
	ВосстановитьДеревоИзХранилища(АдресВХранилище);
	
КонецПроцедуры

// #КонецОбласти //Действия_Кнопок

// #Область Интерфейсные_Обработчики
	
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(Параметры.ПараметрыАвтотестирования) Тогда
		ПодключитьОбработчикОжидания("ЗапуститьАвтотесты",0.1,Истина);
	КонецЕсли;
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "Сервис_ОбработкаРасхожденийПриемкиУправляемая");
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПередУдалением(Элемент, Отказ)
	Отказ=истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ=истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабКоличествоПринятоПриИзменении(Элемент)
	ПересчитатьСтрокуПринято(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТабЦенаБезНДСПринятоПриИзменении(Элемент)
	ПересчитатьСтрокуПринято(Элемент.Родитель);
КонецПроцедуры

&НаКлиенте
Процедура ТабЦенаСНДСПринятоПриИзменении(Элемент)
	ПересчитатьСтрокуПринято(Элемент.Родитель);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПринято(Элемент)

	ТекСтрокаДанныеФормы = Элемент.Родитель.ТекущиеДанные;
	ТекСтрокаДанныеФормы.СуммаБезНДСПринято = ТекСтрокаДанныеФормы.КоличествоПринято * ТекСтрокаДанныеФормы.ЦенаБезНДСПринято;
	ТекСтрокаДанныеФормы.СуммаСНДСПринято = ТекСтрокаДанныеФормы.КоличествоПринято * ТекСтрокаДанныеФормы.ЦенаСНДСПринято;

КонецПроцедуры // ПересчитатьСтрокуПринято()

&НаКлиенте
Процедура ТабВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТабКодыМаркировкиПринятоПредставление" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтрокаСообщения = Элемент.ТекущиеДанные.ПолучитьРодителя();
		Если СтрокаСообщения = Неопределено Тогда
			СтрокаСообщения = Элемент.ТекущиеДанные;
		КонецЕсли;
		
		ОткрытьФормуКодовМаркировки(СтрокаСообщения.НомерСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти //Интерфейсные_Обработчики

// #Область Сервисные_Функции

&НаКлиенте
Функция ЕстьВсеСоответствия()
	//если у нас нет хотя бы одного соответствия товаров, то мы не сможем корректно заполнить реализацию, возврат или КСФ
	ФлагОтмены = Ложь;
	Для Каждого Стр1 Из Таб.ПолучитьЭлементы() Цикл
		Если Стр1.ГруппаНоменклатур Тогда
		Для Каждого Стр2 Из Стр1.ПолучитьЭлементы() Цикл
			Если ТипЗнч(Стр2.Номенклатура)<>Тип("СправочникСсылка.Номенклатура") 
				Или Не ЗначениеЗаполнено(Стр2.Номенклатура) Тогда
				ФлагОтмены = Истина;
				Сообщить("Не назначено соответствие для наименования сети: "+Стр2.Номенклатура);
			КонецЕсли;	
		КонецЦикла;	
		
		ИначеЕсли ТипЗнч(Стр1.Номенклатура)<>Тип("СправочникСсылка.Номенклатура") 
			Или Не ЗначениеЗаполнено(Стр1.Номенклатура) Тогда
			ФлагОтмены = Истина;
			Сообщить("Не назначено соответствие для наименования сети: "+Стр1.Номенклатура);
		КонецЕсли;	
	КонецЦикла;	
	Возврат Не ФлагОтмены;
КонецФункции	

&НаКлиенте
Функция Автотесты_ПолучитьКодСледующегоШага()
	
	Код = Неопределено;
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.ПараметрыАвтотестирования);

	Для Каждого Стр Из СтруктураПараметров.ВыполняемыйКод Цикл
		
		Если Стр.Выполнено Тогда
			Продолжить;
		КонецЕсли;
		Если Стр.ФормаОбработки = "ФормаОбработкиРасхождений" Тогда
			Код = Стр.ВыполняемыйКод;
			Прервать;
		Иначе
			Прервать;//есть невыполненный код в другой форме
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Код;
	
КонецФункции

&НаКлиенте
Процедура Автотесты_ПометитьПоследнийШагКакВыполненный()
	
	Код = Неопределено;
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.ПараметрыАвтотестирования);
	Для Каждого Стр Из СтруктураПараметров.ВыполняемыйКод Цикл
		
		Если Стр.Выполнено Тогда
			Продолжить;
		КонецЕсли;
		Если Стр.ФормаОбработки = "ФормаОбработкиРасхождений" Тогда
			Стр.Выполнено = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(СтруктураПараметров,Параметры.ПараметрыАвтотестирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьАвтотесты()
	
	Пока Истина Цикл
		
		Код = Автотесты_ПолучитьКодСледующегоШага();
		
		Если Код = Неопределено Тогда
			
			Прервать;
			
		Иначе
			
			Выполнить(Код);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "Сервис_ОбработкаРасхожденийПриемкиУправляемая");
	КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКодовМаркировки(НомерСтроки) Экспорт
	
	ПараметрыФормы = ПолучитьПараметрыФормыКодовМаркировки();
	ПараметрыФормы.СтрокаПозиционирования = НомерСтроки;
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сервис_КодыМаркировкиУправляемая",
												 ,
												 ПараметрыФормы,
												 ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормыКодовМаркировки()
	
	ПараметрыФормы = МодульОбъекта().СтруктураПараметровФормыПросмотраКодовМаркировки();
	ПараметрыФормы.ТолькоПросмотр = Истина;
	ПараметрыФормы.ПросмотрРасхождений = Истина;
	ПараметрыФормы.КодыМаркировкиОтредактированыВручную = Ложь;
	ПараметрыФормы.СкрытьУпаковки = Истина;
	ПараметрыФормы.ИмяКолонкиКодовВСообщении = " принятые партнером: " + Документ;
	
	Если Не ЭтоАдресВременногоХранилища(АдресКодовМаркировкиВВх) 
		ИЛИ Не ЭтоАдресВременногоХранилища(АдресРасхожденийКодовМаркировкиВВх) Тогда

		ПоместитьТаблицуКодовМаркировкиВВХ();
		
	КонецЕсли;
		
	ПараметрыФормы.АдресКодовМаркировкиТоваров = АдресКодовМаркировкиВВх;
	ПараметрыФормы.АдресРасхождений = АдресРасхожденийКодовМаркировкиВВх;
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервере
Процедура ПоместитьТаблицуКодовМаркировкиВВХ()
	
	ТаблицаКодовМаркировки = МодульОбъекта().ИнициализироватьТаблицуКодовМаркировки_КонтурEDI();
		
	ТаблицаРасхожденийКодовМаркировки = ТаблицаКодовМаркировки.Скопировать();
	ТаблицаРасхожденийКодовМаркировки.Колонки.Добавить("ЕстьВОтгрузке");
	ТаблицаРасхожденийКодовМаркировки.Колонки.Добавить("ЕстьВПриемке");
	ТаблицаРасхожденийКодовМаркировки.Колонки.Добавить("СуммаДляОтбора");
	
	СвойстваДляКопирования = "НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, СерияНоменклатуры";
	
	ДеревоТоваров = ПолучитьИзВременногоХранилища(ДеревоСоВсемиТоварами);
	
	Для каждого Строка Из ДеревоТоваров.Строки Цикл
		
		Если Не ЗначениеЗаполнено(Строка.КодыМаркировкиПринято) Тогда
			
			СтрокаТовараБезКодаМаркировки = ТаблицаКодовМаркировки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовараБезКодаМаркировки, Строка, СвойстваДляКопирования);

		Иначе
			
			Для каждого КодМаркировки Из Строка.КодыМаркировкиПринято Цикл
				
				СтрокаКодаМаркировки = ТаблицаКодовМаркировки.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаКодаМаркировки, Строка, СвойстваДляКопирования);
				
				СтрокаКодаМаркировки.Артикул = "";
				СтрокаКодаМаркировки.Наименование = Строка(Строка.Номенклатура);
				СтрокаКодаМаркировки.Код = КодМаркировки.Значение;
				СтрокаКодаМаркировки.Вид = КодМаркировки.Представление;
				
				СтрокаРасхождений = ТаблицаРасхожденийКодовМаркировки.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаРасхождений, СтрокаКодаМаркировки);
				
				СтрокаРасхождений.ЕстьВПриемке = 1;
				СтрокаРасхождений.СуммаДляОтбора = 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Для каждого КодМаркировки Из Строка.КодыМаркировкиВНакладной Цикл
			
			СтрокаРасхождений = ТаблицаРасхожденийКодовМаркировки.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаРасхождений, Строка, СвойстваДляКопирования);
			
			СтрокаРасхождений.Артикул = "";
			СтрокаРасхождений.Наименование = Строка(Строка.Номенклатура);
			СтрокаРасхождений.Код = КодМаркировки.Значение;
			СтрокаРасхождений.Вид = КодМаркировки.Представление;
			СтрокаРасхождений.ЕстьВОтгрузке = 1;
			СтрокаРасхождений.СуммаДляОтбора = 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	КолонкиДляСвертки = "Обработан,НомерСтроки,Артикул,Наименование,Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,СерияНоменклатуры,Код,Вид";
	КолонкиДляСуммирования = "ЕстьВОтгрузке, ЕстьВПриемке, СуммаДляОтбора";
	
	ТаблицаРасхожденийКодовМаркировки.Свернуть(КолонкиДляСвертки, КолонкиДляСуммирования);
	
	ОтборСтрокСРасхождениями = Новый Структура;
	ОтборСтрокСРасхождениями.Вставить("СуммаДляОтбора", 1);
	
	СтрокиСРасхождениями = ТаблицаРасхожденийКодовМаркировки.НайтиСтроки(ОтборСтрокСРасхождениями);
	
	Если СтрокиСРасхождениями.Количество() > 0 Тогда
		ТаблицаРасхожденийКодовМаркировки = ТаблицаРасхожденийКодовМаркировки.Скопировать(СтрокиСРасхождениями);
	Иначе
		ТаблицаРасхожденийКодовМаркировки.Очистить();
	КонецЕсли;
		
	АдресКодовМаркировкиВВх = ПоместитьВоВременноеХранилище(ТаблицаКодовМаркировки, УникальныйИдентификатор);
	АдресРасхожденийКодовМаркировкиВВх = ПоместитьВоВременноеХранилище(ТаблицаРасхожденийКодовМаркировки, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьДеревоВХранилище(ДеревоРасхождений)
	
	КопияДерева = ДеревоРасхождений.Скопировать();
	
	ОтборСтрокБезРасхождений = Новый Структура;
	ОтборСтрокБезРасхождений.Вставить("ЕстьРасхождения", Ложь);
	СтрокиБезРасхождений = КопияДерева.Строки.НайтиСтроки(ОтборСтрокБезРасхождений);
	
	Для каждого Строка Из СтрокиБезРасхождений Цикл
		КопияДерева.Строки.Удалить(Строка);
	КонецЦикла;
	
	ДеревоСРасхождениями = ПоместитьВоВременноеХранилище(КопияДерева, УникальныйИдентификатор);
	ДеревоСоВсемиТоварами = ПоместитьВоВременноеХранилище(ДеревоРасхождений, УникальныйИдентификатор);

КонецПроцедуры

&НаСервере
Процедура ВосстановитьДеревоИзХранилища(АдресДерева)
	
	Если ЭтоАдресВременногоХранилища(АдресДерева) Тогда
		
		ДеревоИзХранилища = ПолучитьИзВременногоХранилища(АдресДерева);
		ЗначениеВРеквизитФормы(ДеревоИзХранилища, "Таб");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуКодовМаркировкиПриемки()
	
	Если Не ЭтоАдресВременногоХранилища(АдресКодовМаркировкиВВх) Тогда
		ПоместитьТаблицуКодовМаркировкиВВХ();
	КонецЕсли;
	
	ТаблицаКодовМаркировки = ПолучитьИзВременногоХранилища(АдресКодовМаркировкиВВх);
	
	Возврат ТаблицаКодовМаркировки;
	
КонецФункции

// #КонецОбласти //Сервисные_Функции
