&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	Партнер = Параметры.Партнер;
	
	НастроитьФормуСогласноРежимуРаботы();
	ЗаполнитьСписокПартнеровСервер();
	ЗаполнитьДанныеОРасширениях();
    УстановитьУсловноеОформлениеФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()
	
	ЭлементыУсловногоОформления = ЭтаФорма.УсловноеОформление.Элементы;
	ЭлементыУсловногоОформления.Очистить();
	
	//Установка шрифта
	ВариантыШрифтаТекста = ОписаниеВариантовШрифтаТекста();
		
	НовыйЭлементУО = ЭлементыУсловногоОформления.Добавить();
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ВариантыШрифтаТекста.АвтоШрифтПодчеркнутый);
	
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокРасширенияУстановить");
	
	НовыйЭлементУО = ЭлементыУсловногоОформления.Добавить();
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ВариантыШрифтаТекста.АвтоШрифтПолужирный);
	
	ЭлементУсловия 					= НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СписокРасширения.Обязательный");	
	ЭлементУсловия.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение 	= Истина;	
	ЭлементУсловия.Использование	= Истина;
		
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокРасширенияНаименование");
	
	НовыйЭлементУО = ЭлементыУсловногоОформления.Добавить();
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ВариантыШрифтаТекста.АвтоШрифтПолужирныйПодчеркнутый);
	
	ЭлементУсловия 					= НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СписокРасширения.Обязательный");	
	ЭлементУсловия.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение 	= Истина;	
	ЭлементУсловия.Использование	= Истина;
		
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокРасширенияУстановить");
	
	//Установка цвета
	СинийЦвет = Новый Цвет(0, 0, 255);
	ЗеленыйЦвет = Новый Цвет(0, 128, 0);
	НебесныйЦвет = Новый Цвет(0, 191, 255);
	
	НовыйЭлементУО = ЭлементыУсловногоОформления.Добавить();
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", СинийЦвет);
	
	ЭлементУсловия 						= НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("СписокРасширения.Установить");
	ЭлементУсловия.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение 		= "установить";
	ЭлементУсловия.Использование		= Истина;
	
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокРасширенияУстановить");
	
	НовыйЭлементУО = ЭлементыУсловногоОформления.Добавить();
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЗеленыйЦвет);
	
	ЭлементУсловия 						= НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("СписокРасширения.Установить");
	ЭлементУсловия.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение 		= "подключен";
	ЭлементУсловия.Использование		= Истина;
	
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокРасширенияУстановить");
	
	НовыйЭлементУО = ЭлементыУсловногоОформления.Добавить();
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", НебесныйЦвет);
	
	ЭлементУсловия 						= НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("СписокРасширения.Установить");
	ЭлементУсловия.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение 		= "обновить";
	ЭлементУсловия.Использование		= Истина;
	
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокРасширенияУстановить");
		
КонецПроцедуры

&НаСервере
Функция ОписаниеВариантовШрифтаТекста()
	
	ОписаниеВариантовШрифта = Новый Структура;
	
	АвтоШрифтТекста = Новый Шрифт;
		
	ОписаниеВариантовШрифта.Вставить("АвтоШрифт"						, АвтоШрифтТекста);
	ОписаниеВариантовШрифта.Вставить("АвтоШрифтПолужирный"				, Новый Шрифт(АвтоШрифтТекста,,, Истина));
	ОписаниеВариантовШрифта.Вставить("АвтоШрифтПодчеркнутый"			, Новый Шрифт(АвтоШрифтТекста,,,,, Истина));
	ОписаниеВариантовШрифта.Вставить("АвтоШрифтПолужирныйПодчеркнутый"	, Новый Шрифт(АвтоШрифтТекста,,, Истина,, Истина));
	
	Возврат ОписаниеВариантовШрифта;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораЭлемента(Элемент, Список)
	
	Элемент.СписокВыбора.Очистить();
	
	Для каждого Эл Из Список Цикл
		Элемент.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура НастроитьФормуСогласноРежимуРаботы()

	МыПоставщик = МодульОбъекта().НастройкиМодуля.МыПоставщик;
	МыТорговаяСеть = МодульОбъекта().НастройкиМодуля.МыТорговаяСеть;	
	
	РежимРаботыДистрибьютор = МыПоставщик И МыТорговаяСеть;
	СписокРежимовРаботы = Новый СписокЗначений;
	
	Если РежимРаботыДистрибьютор Тогда
		СписокРежимовРаботы.Добавить("Поставщик,Сеть", "Поставщик и сеть (дистрибьютор)");
	КонецЕсли;
	
	Элементы.РежимРаботы.Видимость 						= РежимРаботыДистрибьютор;
	Элементы.СписокРасширенияДляПоставщика.Видимость 	= РежимРаботыДистрибьютор;
	Элементы.СписокРасширенияДляСети.Видимость 			= РежимРаботыДистрибьютор;
	
	Если МыПоставщик Тогда
		СписокРежимовРаботы.Добавить("Поставщик");
	КонецЕсли;
	Если МыТорговаяСеть Тогда
		СписокРежимовРаботы.Добавить("Сеть");
	КонецЕсли;
	
	ЗаполнитьСписокВыбораЭлемента(Элементы.РежимРаботы, СписокРежимовРаботы);
	РежимРаботы = Элементы.РежимРаботы.СписокВыбора.Получить(0).Значение;

КонецПроцедуры

&НаКлиенте
Процедура СписокРасширенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокРасширенияПередУдалением(Элемент, Отказ)
	Отказ=Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОРасширениях()
	
	ДляПоставщика = НЕ Найти(РежимРаботы, "Поставщик") = 0;
	ДляСети = НЕ Найти(РежимРаботы, "Сеть") = 0;
	
	РезультатДанныеОРасширениях = МодульОбъекта().ПолучитьДанныеОРасширенияхССервера(ТолькоРекомендованные, 
																						Партнер, 
																						ДляПоставщика, 
																						ДляСети, 
																						ПоНазванию);
																						
							
	Если Не РезультатДанныеОРасширениях.Успешно Тогда
		
		ТекстПредупреждения = "Не удалось получить данные о расширениях: """ 
								+ РезультатДанныеОРасширениях.ОписаниеОшибки + """.";
								
		МодульОбъекта().ВывестиПредупреждение_КонтурEDI(ТекстПредупреждения);
		Отказ = Истина;
		
	КонецЕсли;
	
	ОтобразитьДанныеОРасширениях(РезультатДанныеОРасширениях.ДанныеОРасширениях);	
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьДанныеОРасширениях(ДанныеОРасширениях)
	
	//СписокРасширения.Очистить();
	Дерево = ДанныеФормыВЗначение(СписокРасширения,Тип("ДеревоЗначений"));
	Дерево.Строки.Очистить();
	
	//СОздатьПапки	
	ТипыРасширений=ДанныеОРасширениях.Скопировать(,"ТипРасширения");
	ТипыРасширений.Свернуть("ТипРасширения");
	ТипыРасширений.Сортировать("ТипРасширения");
	Для Каждого СтрокаТипа Из ТипыРасширений Цикл
		ГруппаТипа = Дерево.Строки.Добавить();
		ГруПпаТипа.Наименование = СтрокаТипа.ТипРасширения;
		СтрокиЭтогоТипа = ДанныеОРасширениях.НайтиСтроки(Новый Структура("ТипРасширения",СтрокаТипа.ТипРасширения));
		Для Каждого СтрокаЭтогоТипа Из СтрокиЭтогоТипа Цикл
			НоваяСтрокаРасширения = ГруппаТипа.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРасширения,СтрокаЭтогоТипа);
			Если НоваяСтрокаРасширения.Установить = "обновить" Тогда 
				НоваяСтрокаРасширения.ИндексКартинки = 1;
			ИначеЕсли НоваяСтрокаРасширения.Установить = "подключен" Тогда 
				НоваяСтрокаРасширения.ИндексКартинки = 2;
			ИначеЕсли НоваяСтрокаРасширения.Установить = "установить" Тогда 
				НоваяСтрокаРасширения.ИндексКартинки = 3;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	Дерево.Строки.Сортировать("ТипРасширения");
	
	//СписокРасширения = ДанныеОРасширениях;	       
	//ЗначениеВРеквизитФормы(ДанныеОРасширениях,"СписокРасширения");
	ЗначениеВРеквизитФормы(Дерево,"СписокРасширения");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРасширенияПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокРасширенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Колонка = Поле;
	ТекСтрока = Элемент.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено или Колонка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// установка расширения
	Если Колонка.Имя = "СписокРасширенияУстановить"
		И ТекСтрока.Установить = "установить" Тогда
		
		УстановитьРасширениеВызовСервера(ТекСтрока.Наименование, 
											ТекСтрока.Идентификатор, 
											ТекСтрока.ТекИнтерфейс, 
											ТекСтрока.Ссылка);
											
	// обновление расширения										
	ИначеЕсли Колонка.Имя = "СписокРасширенияУстановить"
		И ТекСтрока.Установить = "обновить" Тогда
		
		ОбновитьРасширениеВызовСервера(ТекСтрока.Ссылка);
		
	ИначеЕсли Колонка.Имя = "СписокРасширенияУстановить" 
		И ТекСтрока.Установить = "удалить" Тогда
		
		УдалитьРасширениеВызовСервера(ТекСтрока.Ссылка);
		
	ИначеЕсли Колонка.Имя = "СписокРасширенияУстановить" 
		И ТекСтрока.Установить = "устарело" Тогда
		
		ТекстПредупреждения = "Когда-то расширение трудилось на благо поставщиков, но теперь оно никому не нужно.";
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
		
		Возврат;
		
	КонецЕсли;
	
	РазвернутьРасширения();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРасширениеВызовСервера(Наименование, Идентификатор, Интерфейс, Знач РасширениеСсылка = Неопределено)

	РезультатУстановки = МодульОбъекта().УстановитьРасширение(Наименование, Идентификатор, Интерфейс, РасширениеСсылка);
	
	Если Не РезультатУстановки.Успешно Тогда
		МодульОбъекта().ВывестиПредупреждение_КонтурEDI(РезультатУстановки.ОписаниеОшибки);
	Иначе
		ЗаполнитьДанныеОРасширениях();	
	КонецЕсли;

КонецПроцедуры // УстановитьРасширениеВызовСервера()

&НаСервере
Процедура ОбновитьРасширениеВызовСервера(РасширениеСсылка)

	РезультатОбновления = МодульОбъекта().ОбновитьРасширение(РасширениеСсылка);
	
	Если Не РезультатОбновления.Успешно Тогда
		МодульОбъекта().ВывестиПредупреждение_КонтурEDI(РезультатОбновления.ОписаниеОшибки);
	Иначе
		ЗаполнитьДанныеОРасширениях();	
	КонецЕсли;

КонецПроцедуры // ОбновитьРасширениеВызовСервера()

&НаСервере
Процедура УдалитьРасширениеВызовСервера(РасширениеСсылка)

	РезультатУдаления = МодульОбъекта().УдалитьРасширение(РасширениеСсылка, Истина);
	
	Если Не РезультатУдаления.Успешно Тогда
		МодульОбъекта().ВывестиПредупреждение_КонтурEDI(РезультатУдаления.ОписаниеОшибки);
	Иначе
		ЗаполнитьДанныеОРасширениях();	
	КонецЕсли;

КонецПроцедуры // УдалитьРасширениеВызовСервера()

&НаКлиенте
Процедура РазвернутьРасширения()
	
	Элементы1Ур = СписокРасширения.ПолучитьЭлементы();
	
	Для Каждого Элемент1Ур ИЗ Элементы1Ур Цикл
		Элементы.СписокРасширения.Развернуть(Элемент1Ур.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры // РазвернутьРасширения()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазвернутьРасширения();
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "ФормаРасширения_СписокУправляемая");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзменении_ЗаполнитьДанныеОРасширениях()
	
	Состояние("Ищем нужные расширения...",,"применяем отборы",БиблиотекаКартинок.ДобавитьВИзбранное);
	ЗаполнитьДанныеОРасширениях();
	РазвернутьРасширения();
	Состояние("Готово!",,,БиблиотекаКартинок.ВыполнитьЗадачу);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПартнеровСервер()
	
	СписокПартнеров = Новый СписокЗначений;
	МассивПартнеров = МодульОбъекта().ПолучитьСписокЭлементовСправочника("Партнеры").ВыгрузитьКолонку("Ссылка");
	СписокПартнеров.ЗагрузитьЗначения(МассивПартнеров);
	
	ЗаполнитьСписокВыбораЭлемента(Элементы.Партнер, СписокПартнеров);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "ФормаРасширения_СписокУправляемая");
		
	КонецЕсли;
	
КонецПроцедуры
