////////////////////////////////////////////////////////////////////////////////
// Методы для работы с Аутентификацией 
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Контекст текущего запроса авторизации
&НаКлиенте
Перем
КодУстройстваЛок,
ОписаниеОповещенияЗакрытияЛок,
Сессия;

// Служебные свойства
&НаКлиенте
Перем
ГенераторQrЛок, // Генератор для генерации qr
СтэкДействий,
СтэкОшибки,
НачалоАвторизацииИзФормы;

// Служебные
&НаСервере
Перем 
АутентификаторЛок;

&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);

	Объект_ = Объект_();
	
	Элементы.ЗаголовокОжидания.Заголовок = Объект_.АутентификаторEDI_ПолучитьЗаголовокОжидания(Организация);
	
	КомпонентаГенерацииQrЕсть = Объект_.Аутентификатор_КомпонентаГенератораQrЕсть(); 
		
	КонфигурацияПровайдера = Объект_.Аутентификатор_КонфигурацияПровайдераПоУмолчанию();
	
	КонфигурацияПриложения = Объект_.АутентификаторEDI_КонфигурацияПриложенияПоУмолчанию();
	
	ОтборСессий = Объект_.ХранилищеСессийEDI_ОтборСессийПоУмолчанию(СобратьКлючОбъектаНаСервере());
		
	НастройкиПрокси = Объект_.ПолучитьПараметрыИнтернетСоединения_KE();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДобавитьМетрику("ОткрытаФорма");
	
	УстановитьВидимостьОпциональнойГиперссылки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ДобавитьМетрику("ЗакрытаФорма");
	
	ОтключитьОбработчикОжидания("ПроверитьТокенАсинх");
	ЗаполнитьДополнительныеПараметрыОповещения();
	МодульОбъектаКлиент().КонтурСтандарт_ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗакрытияЛок, Сессия);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Асинхронно получает сессию из хранилища или обновляет её.
// 
// Возвращает:
//  - Валидную сессию из хранилища, если она актуальна.
//  - Обновлённую сессию, если токен обновления доступен и сессия устарела.
//  - Неопределено, если сессию не удалось получить или обновить.
//
// Параметры:
//  ОписаниеОповещения - ОписаниеОповещения, ФиксированнаяСтруктура - Обработчик завершения получения сессии.
//                                            Результат: ФиксированнаяСтруктура (см. Аутентификатор.МодельОтветТокен).
//
&НаКлиенте
Процедура НачатьПолучениеСессии(ОписаниеОповещения) Экспорт	
	
	Если Открыта() Тогда
		ВызватьИсключение "Ошибка: Форма должна быть закрыта";	
	КонецЕсли;
	
	РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОписаниеОповещенияЗакрытияЛок = ОписаниеОповещения;
	
	Элементы.ГруппаОсновная.Видимость = Ложь;
	Элементы.ГруппаОжидания.Видимость = Истина;

	Сессия = Сессия();
	Если Сессия = Неопределено Тогда
		ПодключитьОбработчикОжидания("ПродолжитьПолучениеСессииАсинх", Таймаут01(), Истина);
		Открыть();
	Иначе
		ЗаполнитьДополнительныеПараметрыОповещения();
		МодульОбъектаКлиент().КонтурСтандарт_ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗакрытияЛок, Сессия);
	КонецЕсли;	
	
КонецПроцедуры

// Открывает форму аутентификатора, без начало аутентификации.
//
// Параметры:
//  ОписаниеОповещения - ОписаниеОповещения, ФиксированнаяСтруктура - Обработчик завершения получения сессии.
//                                            Результат: ФиксированнаяСтруктура (см. Аутентификатор.МодельОтветТокен).
//
&НаКлиенте
Процедура ОткрытьАутентификатор(ОписаниеОповещения) Экспорт
	
	Если Открыта() Тогда
		ВызватьИсключение "Ошибка: Форма должна быть закрыта";	
	КонецЕсли;
	
	НачалоАвторизацииИзФормы = Истина;
	РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОписаниеОповещенияЗакрытияЛок = ОписаниеОповещения;
	
	Элементы.ГруппаОсновная.Видимость = Истина;
	Элементы.ГруппаОжидания.Видимость = Ложь;

	Сессия = Сессия();
	Если Сессия = Неопределено Тогда
		Открыть();
	Иначе                                                                                        
		ЗаполнитьДополнительныеПараметрыОповещения();
		МодульОбъектаКлиент().КонтурСтандарт_ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗакрытияЛок, Сессия);
	КонецЕсли;
	
КонецПроцедуры

// Инициирует асинхронное обновление сессии с использованием токена обновления.
//
// Параметры:
//  ОписаниеОповещения - ОписаниеОповещения, ФиксированнаяСтруктура - Обработчик, вызываемый по завершении обновления 
//												сессии. Результат содержит обновлённые данные сессии.
//
&НаКлиенте
Процедура НачатьОбновлениеСессии(ОписаниеОповещения) Экспорт
	
	ОписаниеОповещенияЗакрытияЛок = ОписаниеОповещения;
	
	ПродолжитьОбновлениеСессии();
	
КонецПроцедуры

// Делает отзыв токена, сессия при этом остается живой.
//
&НаКлиенте
Процедура ЗавершитьСессию() Экспорт
	
	ЗавершитьСессиюНаСервере();
	
КонецПроцедуры

// Устанавливает свойство формы для использования указанного объекта метаданных в качестве хранилища сессий.
//
// Параметры:
//  Значение - Строка - Имя объекта метаданных, используемого как хранилище сессий.
//                     Допустимые значения: "Обработка", "Справочник", "РегистрСведений", "ОбщийМодуль".
//
&НаКлиенте
Процедура УстановитьХранилищеСессий(Значение) Экспорт
	
	Если Значение = Неопределено Тогда
		ВызватьИсключение "Ошибка установки хранилища сессий: Неопределенный тип хранилища сессией";	
	КонецЕсли;
	
	ХранилищеСессий = Значение;	
	
КонецПроцедуры

// Устанавливает свойство формы для использования указанной конфигурации приложения.
//
// Параметры:
//  Значение - ФиксированнаяСтруктура - Конфигурация приложения.
//                                     См. МодельКонфигурацияПриложения.
//
&НаКлиенте
Процедура УстановитьКонфигурациюПриложения(Знач Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Значение = Новый ФиксированнаяСтруктура(Значение);	
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("ФиксированнаяСтруктура") Тогда
		ВызватьИсключение "Ошибка установки конфигурации приложения: ожидалась структура или фиксированная структура";	
	КонецЕсли;
	
	ПроверитьКонфигурациюПриложения(Значение);
	
	КонфигурацияПриложения = Значение;
	
КонецПроцедуры

// Устанавливает свойство формы для использования указанной конфигурации провайдера.
//
// Параметры:
//  Значение - ФиксированнаяСтруктура - Конфигурация провайдера.
//                                     См. МодельКонфигурацияПровайдера.
//
&НаКлиенте
Процедура УстановитьКонфигурациюПровайдера(Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Значение = Новый ФиксированнаяСтруктура(Значение);	
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("ФиксированнаяСтруктура") Тогда
		ВызватьИсключение "Ошибка установки конфигурации провайдера: ожидалась структура или фиксированная структура";	
	КонецЕсли;
	
	ПроверитьКонфигурациюПровайдера(Значение);
	
	КонфигурацияПровайдера = Значение;
	
КонецПроцедуры

// Устанавливает свойство формы для использования отбора сессий.
//
// Параметры:
//  Значение - Произвольный - Модель зависит от реализации хранилища.
//
&НаКлиенте
Процедура УстановитьОтборСессий(Значение) Экспорт
	
	Если Значение = Неопределено Тогда
		ВызватьИсключение "Пустое значение отбора сессией";	
	КонецЕсли;
	
	ОтборСессий = Значение;	
	
КонецПроцедуры

// Устанавливает свойство формы для генерации QR-кода средствами приложения
//
// Параметры:
//  Значение - Произвольный - клиентский генератор QR-кода приложения.
//
&НаКлиенте
Процедура УстановитьГенераторQr(Значение) Экспорт

	Если Значение = Неопределено Тогда
		ВызватьИсключение "Пустое значение генератора QR-кода";	
	КонецЕсли;
	
	ГенераторQrЛок = Значение;
	
КонецПроцедуры

// Устанавливает свойство формы для настроек прокси
//
// Параметры:
//  Значение - Структура, ФиксированнаяСтруктура - см КоннекторHTTP.СоздатьНастройкиПрокси.
//
&НаКлиенте
Процедура УстановитьНастройкиПрокси(Значение) Экспорт

	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Значение = Новый ФиксированнаяСтруктура(Значение);	
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("ФиксированнаяСтруктура") Тогда
		ВызватьИсключение "Ошибка установки прокси: ожидалась структура или фиксированная структура";	
	КонецЕсли;
	
	НастройкиПрокси = Значение;
	
КонецПроцедуры

// Возвращает контракт конфигурации приложения.
//
// Возвращаемое значение:
//  Структура - Описание конфигурации приложения.
//
&НаКлиенте
Функция МодельКонфигурацияПриложения() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Имя");
	Результат.Вставить("Ключ");
	Результат.Вставить("Разрешения");
	Результат.Вставить("ПроверятьАктуальностьТокена", Ложь);
	Результат.Вставить("Опции", МодельОпции());
	
	Возврат Результат;
	
КонецФункции

// Возвращает контракт конфигурации провайдера.
//
// Возвращаемое значение:
//  Структура - Описание конфигурации провайдера.
//
&НаКлиенте
Функция МодельКонфигурацияПровайдера() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Хост");
	Результат.Вставить("Тип");
	
	Возврат Результат;
	
КонецФункции

// Собирает ключ объекта аутентификатора по конифгурации приложения и конфигурации провайдера.
//
// Возвращаемое значение:
//	Строка - ключ объекта аутентификатора.
//
&НаКлиенте
Функция СобратьКлючОбъекта() Экспорт
			
	Возврат СобратьКлючОбъектаНаСервере();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПоСсылке(Команда)
	
	ДобавитьМетрику(Команда);
	
	БуферОбмена = МодульОбъектаКлиент().КонтурСтандарт_СтрШаблон_("
		|<!DOCTYPE html>
		|<html>
		|	<body onload='copy()'>
		|		<input id='input' type='text'/>
		|		<script>
		|			function copy() {
		|				var text = '%1';
		|				var ua = navigator.userAgent;
		|				if (ua.search(/MSIE/) > 0 || ua.search(/Trident/) > 0) {
		|					window.clipboardData.setData('Text', text);
		|				} else {
		|					var copyText = document.getElementById('input');
		|					copyText.value = text;
		|					copyText.select();
		|					document.execCommand('copy');
		|				}
		|			}
		|		</script>
		|	</body>
		|</html>", 
		СсылкаАвторизации);    

	ПоказатьОповещениеПользователя("Ссылка готова",, "Ссылка для авторизации скопирована в буфер обмена");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоQRКоду(Команда)
	              
	ДобавитьМетрику(Команда);
	
	Сессия = Сессия();
	Если Сессия = Неопределено Тогда
		КодУстройстваЛок = КодУстройстваВызовСервера();
		СсылкаАвторизации = КодУстройстваЛок.СсылкаАвторизации;
		ПроверитьТокенАсинх();
	КонецЕсли;
	
	Элементы.ГруппаОсновная.Видимость = Ложь;
	Элементы.ГруппаОжидания.Видимость = Ложь;
	Элементы.ГруппаВходаПоQR.Видимость = Истина;
	Элементы.ГруппаОжидания.Видимость = Ложь;
	Элементы.ГруппаОжиданиеОкончено.Видимость = Ложь;

	СгенерироватьQrКод(СсылкаАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура НазадИзОжидания(Команда)
	
	ДобавитьМетрику(Команда);
	
	Элементы.ГруппаОжидания.Видимость = Ложь;
	Элементы.ГруппаОтказ.Видимость = Ложь;
	Элементы.ГруппаОжиданиеОкончено.Видимость = Ложь;
	Элементы.ГруппаОсновная.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НазадИзQR(Команда)
	
	ДобавитьМетрику(Команда);
	
	Элементы.ГруппаВходаПоQR.Видимость = Ложь;
	Элементы.ГруппаОтказ.Видимость = Ложь;
	Элементы.ГруппаОжиданиеОкончено.Видимость = Ложь;
	Элементы.ГруппаОсновная.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НазадИзОтказа(Команда)
	
	ДобавитьМетрику(Команда);
	
	Элементы.ГруппаОтказ.Видимость = Ложь;
	Элементы.ГруппаОжиданиеОкончено.Видимость = Ложь;
	Элементы.ГруппаОсновная.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НазадИзОжиданиеОкончено(Команда)
	
	ДобавитьМетрику(Команда);
	
	Элементы.ГруппаОтказ.Видимость = Ложь;
	Элементы.ГруппаОжиданиеОкончено.Видимость = Ложь;
	Элементы.ГруппаОсновная.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВойтиЧерезБраузер(Команда)
	
	ДобавитьМетрику(Команда);
	
	Сессия = Сессия();
	Если Сессия = Неопределено Тогда
		ПодключитьОбработчикОжидания("ПродолжитьПолучениеСессииАсинх", Таймаут01(), Истина);
		Элементы.ГруппаОсновная.Видимость = Ложь;
		Элементы.ГруппаОжидания.Видимость = Истина;
	Иначе
		ЗаполнитьДополнительныеПараметрыОповещения();
		МодульОбъектаКлиент().КонтурСтандарт_ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗакрытияЛок, Сессия);
	КонецЕсли;	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОпциональнаяГиперссылкаНажатие(Элемент)
	
	ДобавитьМетрику(Элемент);
	ПерейтиПоНавигационнойСсылке(КонфигурацияПриложения.Опции.Ссылка);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Процедура ПродолжитьПолучениеСессииАсинх()
	
	ПродолжитьПолучениеСессии();
	ПроверитьТокенАсинх();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПолучениеСессии()

	КодУстройстваЛок = КодУстройстваВызовСервера();
	Если КодУстройстваЛок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СсылкаАвторизации = КодУстройстваЛок.СсылкаАвторизации;	
	
	Попытка
		ПерейтиПоНавигационнойСсылке(СсылкаАвторизации);
		ДобавитьМетрику("БраузерОткрылся");
	Исключение
		ДобавитьОшибку("Не удалось открыть браузер");
		Ошибка = ИнформацияОбОшибке();
		ДобавитьОшибку(Ошибка);
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьТекстСсылки()

	Элементы.СсылкаАвторизации.УстановитьГраницыВыделения(1, СтрДлина(СсылкаАвторизации) + 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТокенАсинх()
	
	Если КодУстройстваЛок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Результат = ПроверитьТокенНаСервере(КодУстройстваЛок);
	Исключение
		Результат = ИнформацияОбОшибке();
		ДобавитьОшибку(Результат);
	КонецПопытки;
	
	ТипРезультата = ТипЗнч(Результат);
	
	Если ТипРезультата = Тип("ФиксированнаяСтруктура") 
		И Результат.ТокенДоступа = Неопределено Тогда
		ПодключитьОбработчикОжидания("ПроверитьТокенАсинх", КодУстройстваЛок.Интервал, Истина);
	ИначеЕсли ТипРезультата = Тип("ИнформацияОбОшибке") Тогда
		ОбработатьИнформациюОбОшибке(Результат);
	Иначе
		ОбработатьЗавершениеСессии(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИнформациюОбОшибке(ИнформацияОбОшибке)

	Если НачалоАвторизацииИзФормы И МодульОбъектаКлиент().КонтурСтандарт_СтрНайти_(ИнформацияОбОшибке.Описание, "access_denied") > 0 Тогда
		ПоказатьГруппуОтказ();
	ИначеЕсли НачалоАвторизацииИзФормы И МодульОбъектаКлиент().КонтурСтандарт_СтрНайти_(ИнформацияОбОшибке.Описание, "TimeoutError") > 0 Тогда
		ПоказатьГруппуВремяОжиданиеОкончено();
	ИначеЕсли НачалоАвторизацииИзФормы Тогда
		ВызватьИсключение ИнформацияОбОшибке.Описание;
	Иначе
		ОбработатьЗавершениеСессии(Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗавершениеСессии(Результат)

	Оповещение = МодульОбъектаКлиент().КонтурСтандарт_ОписаниеОповещения("НачатьПолучениеСессииЗавершение", ЭтаФорма);
	МодульОбъектаКлиент().КонтурСтандарт_ВыполнитьОбработкуОповещения(Оповещение, Результат);
		
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеСессииЗавершение(Результат, ДопПараметры) Экспорт
	
	Сессия = Результат;
	КодУстройстваЛок = Неопределено;	
	
	Если Открыта() Тогда
		Если Сессия <> Неопределено Тогда
			ДобавитьМетрику("Аутентификация " + Сессия.ПортальныйИд);
		КонецЕсли;
		Закрыть(Результат);
	Иначе
		ЗаполнитьДополнительныеПараметрыОповещения();
		МодульОбъектаКлиент().КонтурСтандарт_ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗакрытияЛок, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбновлениеСессии()
	
	Сессия = ОбновитьСессиюНаСервере();
	
	Если Открыта() Тогда
		Закрыть(Сессия);
	Иначе
		ЗаполнитьДополнительныеПараметрыОповещения();
		МодульОбъектаКлиент().КонтурСтандарт_ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗакрытияЛок, Сессия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонфигурациюПриложения(Значение)
		
	Результат = ПроверитьКоллекцию(МодельКонфигурацияПриложения(), Значение);
	
	Если Результат.Количество() Тогда
		Ошибки = МодульОбъектаКлиент().КонтурСтандарт_СтрСоединить_(Результат, ", ");
		Сообщение = МодульОбъектаКлиент().КонтурСтандарт_СтрШаблон_("При проверке конфигурации приложения обнаружены ошибки: %1", Ошибки);
		ВызватьИсключение Сообщение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонфигурациюПровайдера(Значение)
	
	Результат = ПроверитьКоллекцию(МодельКонфигурацияПровайдера(), Значение);
	
	Если Результат.Количество() Тогда
		Ошибки = МодульОбъектаКлиент().КонтурСтандарт_СтрСоединить_(Результат, ", ");
		Сообщение = МодульОбъектаКлиент().КонтурСтандарт_СтрШаблон_("При проверке конфигурации провайдера обнаружены ошибки: %1", Ошибки);
		ВызватьИсключение Сообщение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКоллекцию(Модель, Коллекция)
	
	Ошибки = Новый Массив;
	Для Каждого Элемент Из Модель Цикл
		Если Элемент.Ключ = "Опции" Тогда
			Продолжить;
		КонецЕсли;
		Если Коллекция.Свойство(Элемент.Ключ) = Ложь Тогда
				Ошибки.Добавить(МодульОбъектаКлиент().КонтурСтандарт_СтрШаблон_("Не найден ключ: %1", Элемент.Ключ));
				Продолжить;
		КонецЕсли;                                        
		Если ЗначениеКоллекцииЗаполнено(Коллекция[Элемент.Ключ]) = Ложь Тогда
				Ошибки.Добавить(МодульОбъектаКлиент().КонтурСтандарт_СтрШаблон_("Пустое значение ключа: %1", Элемент.Ключ));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ошибки;
	
КонецФункции

&НаКлиенте
Функция ГенераторQrЛок(Ссылка)
	
	Если ГенераторQrЛок = Неопределено И КомпонентаГенерацииQrЕсть Тогда
		ГенераторQrЛок = МодульОбъектаКлиент().ПолучитьФорму_КонтурEDI("Аутентификатор_ГенераторQr", , , ВладелецФормы);
	КонецЕсли;

	ГенераторQrЛок.УстановитьЗначениеКода(Ссылка);
	
	Возврат ГенераторQrЛок;
	
КонецФункции

&НаКлиенте
Процедура СгенерироватьQrКод(Ссылка)
	
	Попытка
		ГенераторQrЛок(Ссылка).НачатьСоздатьКод(_ОповещениеОЗавершенииГенерацииQrКода());
	Исключение
		УстановитьВидимостьПанелиВыбораДействий(Ложь);
		ДобавитьОшибку(ИнформацияОбОшибке());
	КонецПопытки;
		
КонецПроцедуры

&НаКлиенте
Функция _ОповещениеОЗавершенииГенерацииQrКода() Экспорт
	
	Возврат МодульОбъектаКлиент().КонтурСтандарт_ОписаниеОповещения("_ПослеГенерацииQrКода", ЭтаФорма);
	
КонецФункции

&НаКлиенте
Процедура _ПослеГенерацииQrКода(ДвоичныеДанные, ДопПараметры) Экспорт
	
	Если ДвоичныеДанные = Неопределено Тогда
		УстановитьВидимостьПанелиВыбораДействий(Ложь);
	Иначе
		КартинкаQrКод = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		УстановитьВидимостьПанелиВыбораДействий(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьГруппуОтказ()
	
	Элементы.ГруппаОтказ.Видимость = Истина;
	Элементы.ГруппаОжиданиеОкончено.Видимость = Ложь;
	Элементы.ГруппаОжидания.Видимость = Ложь;
	Элементы.ГруппаВходаПоQR.Видимость = Ложь;
	Элементы.ГруппаОсновная.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьГруппуВремяОжиданиеОкончено()

	Элементы.ГруппаОжиданиеОкончено.Видимость = Истина;
	Элементы.ГруппаОтказ.Видимость = Ложь;
	Элементы.ГруппаОжидания.Видимость = Ложь;
	Элементы.ГруппаВходаПоQR.Видимость = Ложь;
	Элементы.ГруппаОсновная.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМетрику(Элемент)
	
	ТипЗнч_ = ТипЗнч(Элемент);
	
	Если ТипЗнч_ = Тип("КомандаФормы") Или ТипЗнч_ = Тип("ДекорацияФормы") Тогда            
		Значение = Элемент.Имя;
	ИначеЕсли ТипЗнч_ = Тип("Строка") Тогда
		Значение = Элемент;	
	Иначе
		Значение = "Ошибка метрики: Тип элемента не определен";
	КонецЕсли;
	
	ИнициализироватьСтэкДействий();	
	СтэкДействий.Добавить(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОшибку(Ошибка)
	
	ИнициализироватьСтэкОшибок();	
	СтэкОшибки.Добавить(Ошибка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьСтэкДействий()

	Если СтэкДействий = Неопределено Тогда
		СтэкДействий = Новый Массив;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьСтэкОшибок()

	Если СтэкОшибки = Неопределено Тогда
		СтэкОшибки = Новый Массив;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДополнительныеПараметрыОповещения()
	
	Если ТипЗнч(ОписаниеОповещенияЗакрытияЛок.ДополнительныеПараметры) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьСтэкДействий();
	ИнициализироватьСтэкОшибок();
	
	ОписаниеОповещенияЗакрытияЛок.ДополнительныеПараметры.Вставить("Стэк", СтэкДействий);
	ОписаниеОповещенияЗакрытияЛок.ДополнительныеПараметры.Вставить("Ошибки", СтэкОшибки);
	
КонецПроцедуры

&НаКлиенте
Функция КодУстройстваВызовСервера()

	Попытка
		Результат = КодУстройства();
	Исключение
		Результат = Неопределено;
		Ошибка = ИнформацияОбОшибке();
		ДобавитьОшибку(Ошибка);
		ОбработатьИнформациюОбОшибке(Ошибка);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьТокенНаСервере(Знач ЗапросТокена)

	Если ТекущаяУниверсальнаяДата() >= ЗапросТокена.УниверсальнаяДатаОкончания Тогда
		ВызватьИсключение "TimeoutError: вышло время ожидания подтверждения запроса";
	КонецЕсли;
	
	Сессия = Аутентификатор().Аутентификатор_НоваяСессия(ЗапросТокена.Код);	
	Возврат Сессия;
	
КонецФункции

&НаСервере
Функция Сессия()
		
	Возврат Аутентификатор().Аутентификатор_ПолучитьСессию();
		
КонецФункции

&НаСервере
Процедура ЗавершитьСессиюНаСервере()

	Аутентификатор().Аутентификатор_ЗавершитьСессию();
	
КонецПроцедуры

&НаСервере
Функция КодУстройства()

	Возврат Аутентификатор().Аутентификатор_НовыйКодУстройства();
	
КонецФункции

&НаСервере
Функция ОбновитьСессиюНаСервере()
	
	Сессия = Сессия();
	Возврат Аутентификатор().Аутентификатор_ОбновитьСессию(Сессия);
	
КонецФункции

&НаСервере
Функция Аутентификатор()
	
	Если АутентификаторЛок = Неопределено Тогда
		АутентификаторЛок = Объект_();
	КонецЕсли;
	
	АутентификаторЛок.Аутентификатор_УстановитьХранилищеСессий(ХранилищеСессий);
	АутентификаторЛок.Аутентификатор_УстановитьКонфигурациюПриложения(КонфигурацияПриложения);
	АутентификаторЛок.Аутентификатор_УстановитьКонфигурациюПровайдера(КонфигурацияПровайдера);
	АутентификаторЛок.Аутентификатор_УстановитьОтборСессий(ОтборСессий);
	Если НастройкиПрокси <> Неопределено Тогда
		АутентификаторЛок.Аутентификатор_УстановитьНастройкиПрокси(НастройкиПрокси);
	КонецЕсли;
	АутентификаторЛок.АутентификаторEDI_СоздатьСессиюHttp();
	
	Возврат АутентификаторЛок;
	
КонецФункции

&НаСервере
Функция Объект_()
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат ЭтотОбъект;
	#Иначе
		Возврат МодульОбъекта();
	#КонецЕсли
	
КонецФункции

&НаСервере
Функция СобратьКлючОбъектаНаСервере()

	Аутентификатор = Объект_();
	Аутентификатор.Аутентификатор_УстановитьКонфигурациюПриложения(КонфигурацияПриложения);
	Аутентификатор.Аутентификатор_УстановитьКонфигурациюПровайдера(КонфигурацияПровайдера);
	
	Возврат Аутентификатор.Аутентификатор_СобратьКлючОбъекта(Организация);
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьПанелиВыбораДействий(Знач Значение)

	Элементы.ГруппаПанельВыборДействия1.Видимость = Значение;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеКоллекцииЗаполнено(Значение)
	
	ТипЗнч = ТипЗнч(Значение);
	
	Если ТипЗнч = Тип("Строка") Тогда
		Результат = Значение <> "";
	ИначеЕсли ТипЗнч = Тип("Массив") Тогда
		Результат = Значение.Количество() > 0;
	ИначеЕсли Значение = Неопределено Тогда
		Результат = Ложь;
	ИначеЕсли ТипЗнч = Тип("Булево") Или ТипЗнч = Тип("Число") Тогда
		Результат = Истина;
	Иначе
		ВызватьИсключение "Неопределенный ключ конфигурации";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Таймаут01()
	
	Возврат 0.1;
	
КонецФункции

// Возвращает контракт опций конифгурации приложения
//
// Возвращаемое значение:
//	- Структура:
// Ссылка - Строка - Наименование опциональной гиперссылки на основной форме. Необязательный
// ПредставлениеСсылки - Строка - Адрес перехода по опциональной ссылке на форме. Необязательный
//
&НаКлиентеНаСервереБезКонтекста
Функция МодельОпции()

	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("ПредставлениеСсылки");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьОпциональнойГиперссылки()
	 
	ОпцияЕсть = КонфигурацияПриложения.Свойство("Опции")
		И КонфигурацияПриложения.Опции.Свойство("ПредставлениеСсылки")
		И КонфигурацияПриложения.Опции.Свойство("Ссылка")
		И ЗначениеЗаполнено(КонфигурацияПриложения.Опции.ПредставлениеСсылки)
		И ЗначениеЗаполнено(КонфигурацияПриложения.Опции.Ссылка);
		
	Элементы.ОпциональнаяГиперссылка.Видимость = ОпцияЕсть;
	Если ОпцияЕсть Тогда
		Элементы.ОпциональнаяГиперссылка.Заголовок = КонфигурацияПриложения.Опции.ПредставлениеСсылки;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ

#Если Клиент Тогда
	НачалоАвторизацииИзФормы = Ложь;
#КонецЕсли