&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

&НаСервере
Перем ОсобенностиСообщений;

&НаСервере
Перем МетаданныеСообщения Экспорт;

&НаКлиенте
Перем ОсобенностьВыбранаИзСпискаВыбора;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

&НаКлиенте
Функция ТекстОбязательностиРеквизита(ИмяРеквизита)
	Возврат "Не заполнен обязательный реквизит """ + ИмяРеквизита + """.";	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИнициализироватьПараметрыЗаполненияТоваров()
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура"			, Неопределено);
	Структура.Вставить("ВидНоменклатуры"		, Неопределено);
	Структура.Вставить("ДобавлениеНоменклатуры"	, Ложь);
	Структура.Вставить("ПеревыборНоменклатуры"	, Ложь);
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Функция ПараметрыСоответствияНоменклатуры()

	Структура = Новый Структура;
	Структура.Вставить("GTIN");
	Структура.Вставить("Наименование");
	Структура.Вставить("КодЕдиницыИзмеренияEDI");
	Структура.Вставить("Партнер");
	Структура.Вставить("Номенклатура");
									
    Возврат Структура;
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	МодальностьЗапрещена = МодульОбъекта().МодальностьЗапрещена();
	ПутьКФормам = МодульОбъекта().Метаданные().ПолноеИмя() + ".Форма.";
	ИмяКонфигурации1С = МодульОбъекта().ОпределитьКонфигурацию();
	
	ИмяСправочникаНоменклатуры = МодульОбъекта().ПолучитьТипЗначенияОбъекта("Номенклатура",,Истина);
	ИмяРеквизитаЕдиницаИзмерения = МодульОбъекта().ПолучитьИмяРеквизитаВладельцаПоИмениТипа("Номенклатура", "ЕдиницаИзмерения");
	
	ТипСообщения 	= Параметры.ТипСообщения;
	Направление 	= Параметры.Направление;
	
	Если ЗначениеЗаполнено(Параметры.ПереотправляемоеСообщениеСсылка) Тогда
		ПереотправляемоеСообщениеСсылка = Параметры.ПереотправляемоеСообщениеСсылка;
	КонецЕсли;  
	
	РежимНастройкиРасписанияАвтоотправки = Параметры.НастройкаРасписанияАвтоотправки;
	
	ТолькоПросмотрСообщения = (Параметры.ТолькоПросмотр = Истина);
	
	СторонаЮрФизЛицаПартнера = МодульОбъекта().ОпределитьСторонуЮрФизЛица(ТипСообщения, Направление, Истина);
	СторонаЮрФизЛицаОрганизации = МодульОбъекта().ОпределитьСторонуЮрФизЛица(ТипСообщения, Направление, Ложь);
	
	НастройкаФормы = МодульОбъекта().ПолучитьНастройкиФормыНезависимогоСообщения(ТипСообщения, Направление);
	
	НастройкаСсылокИсправленияОшибок = МодульОбъекта().ПолучитьНастройкуВыводаСсылокНаОбъектыСообщения();
  	
	Если ЗначениеЗаполнено(Параметры.СообщениеСсылка) Тогда
		
		СообщениеСсылка = Параметры.СообщениеСсылка;
		Сообщение = МодульОбъекта().ПрочитатьСообщение(СообщениеСсылка, , ТипСообщения, Направление);
		
		АрхивноеСообщение = Сообщение.Свойство("Архив") И Сообщение.Архив = Истина;
		
		Если Сообщение.Направление = "Входящее" И НЕ АрхивноеСообщение Тогда
			МодульОбъекта().КонвертироватьСообщениеEDIв1С(Сообщение);
		КонецЕсли;
		
	ИначеЕсли РежимНастройкиРасписанияАвтоотправки = Истина 
			И Параметры.Свойство("АвтоотправкаПараметрыПодготовкиСообщения") 
			И ТипЗнч(Параметры.АвтоотправкаПараметрыПодготовкиСообщения) = Тип("Структура") Тогда
		
		Сообщение = МодульОбъекта().ПодготовитьИсходящееНезависимоеСообщение(ТипСообщения, 
																			 РеквизитФормыВЗначение("Товары"),
																			 Параметры.АвтоотправкаПараметрыПодготовкиСообщения);
																			 
		Параметры.Свойство("АвтоотправкаНаименованиеНастройки", НаименованиеНастройкиАвтоотправки);
		Параметры.Свойство("АвтоотправкаРасписание", РасписаниеНастройкиАвтоотправки);
		
		Если Не РасписаниеНастройкиАвтоотправки = Неопределено Тогда
			ПредставлениеРасписанияНастройкиАвтоотправки = Строка(РасписаниеНастройкиАвтоотправки);
		КонецЕсли;

	КонецЕсли;
	
	ВыполнитьНастройкиФормы();
	
	ЗаполнитьПоУмолчанию = Ложь;
	
	Если ЗначениеЗаполнено(Сообщение) Тогда
		
		ЗаполнитьОсобенностиСообщенияНаФорме_ОсновнойМодуль();
		
		ЗаполнитьПоляНаФорме();
		ПредставлениеПолучателя = МодульОбъекта().ПолучитьПредставлениеЭлементаСправочника(Получатель);
		        		
	Иначе
		
		ЗаполнитьПоУмолчанию = Истина;
		
		Сообщение =  МодульОбъекта().ПодготовитьИсходящееСообщение(ТипСообщения, Неопределено, Новый Структура);
		
		СтруктураПараметры = ПолучитьПараметрыДляПодготовкиСообщения(ТипСообщения);
		Сообщение = МодульОбъекта().ПодготовитьИсходящееНезависимоеСообщение(ТипСообщения, РеквизитФормыВЗначение("Товары"), СтруктураПараметры);
		
		ЗаполнитьОсобенностиСообщенияНаФорме_ОсновнойМодуль();
		
	КонецЕсли;
	
	Если ЗаполнитьПоУмолчанию Тогда
		ЗаполнитьПоляНаФормеЗначениямиПоУмолчанию();
	КонецЕсли; 
	
	КтоМы = МодульОбъекта().ОпределитьКемМыЯвляемся(Сообщение);

	// ... особенности
	МодульОбъекта().ДобавитьУсловноеОформлениеОсобенностейСообщения(ЭтаФорма);
	НужноКонвертироватьОсобенностиВСообщении = МодульОбъекта().НужноКонвертироватьОсобенностиВСообщении(Сообщение);
	
	УстановитьЗаголовокФормы_КонтурEDI();
	
	ФормаСодержитОшибки = НЕ ПроверитьЗаполнениеПолей();
	
	// ... вызов ПМ
	МодульОбъекта().ПриОткрытииФормыСообщения(Сообщение, ЭтаФорма);
	
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	СтруктураИдентификаторовДД = СтруктураИндетификаторовДД_Сервер();
	
КонецПроцедуры

&НаСервере
Процедура УничтожитьТаблицыЗначенийПроизвольныхРеквизитов() Экспорт 
	
	НастройкаСсылокИсправленияОшибок     = Неопределено;  

	Для Каждого ЭлементСтруктуры Из НастройкаФормы Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
			НастройкаФормы[ЭлементСтруктуры.Ключ] = Неопределено;	
		КонецЕсли;
	КонецЦикла;

	Для Каждого ЭлементСтруктуры Из Сообщение Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Или ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ДеревоЗначений") Тогда
			Сообщение[ЭлементСтруктуры.Ключ] = Неопределено;	
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище() Экспорт
	
	СтруктураВременногоХранилища = Новый Структура;

	Если ТипЗнч(НастройкаСсылокИсправленияОшибок) = Тип("ТаблицаЗначений") Тогда
		СтруктураВременногоХранилища.Вставить("НастройкаСсылокИсправленияОшибок", НастройкаСсылокИсправленияОшибок);
	КонецЕсли;
	
	СтруктураНастройкаФормы = Новый Структура;
	Для Каждого ЭлементСтруктуры Из НастройкаФормы Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
			СтруктураНастройкаФормы.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);	
		КонецЕсли;
	КонецЦикла;
	Если СтруктураНастройкаФормы.Количество() > 0 Тогда 
		СтруктураВременногоХранилища.Вставить("НастройкаФормы", СтруктураНастройкаФормы);	
	КонецЕсли;
	
	СтруктураСообщение = Новый Структура;
	Для Каждого ЭлементСтруктуры Из Сообщение Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Или ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ДеревоЗначений") Тогда
			СтруктураСообщение.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);	
		КонецЕсли;
	КонецЦикла;
	Если СтруктураСообщение.Количество() > 0 Тогда 
		СтруктураВременногоХранилища.Вставить("Сообщение", СтруктураСообщение);
	КонецЕсли;

	Если СтруктураВременногоХранилища.Количество() > 0 Тогда 
		АдресВХПроизвольныеРеквизиты = ПоместитьВоВременноеХранилище(СтруктураВременногоХранилища, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища() Экспорт
	
	// извлечем из ВХ если не инициализированы реквизиты и при этом там хоть что-то есть
	
	Если НЕ ПустаяСтрока(АдресВХПроизвольныеРеквизиты)
	  И (НастройкаСсылокИсправленияОшибок = Неопределено
		ИЛИ Сообщение.Товары = Неопределено) Тогда 
		
		СтруктураВременногоХранилища = ПолучитьИзВременногоХранилища(АдресВХПроизвольныеРеквизиты);
		Если СтруктураВременногоХранилища = Неопределено Тогда 
			ВызватьИсключение "Сервер потерял временное хранилище (откройте форму заново)";
		КонецЕсли;
		
		НастройкаСсылокИсправленияОшибок = СтруктураВременногоХранилища.НастройкаСсылокИсправленияОшибок;
		
		Если СтруктураВременногоХранилища.Свойство("НастройкаФормы") И ТипЗнч(СтруктураВременногоХранилища.НастройкаФормы) = Тип("Структура") Тогда
			Для Каждого ЭлементСтруктуры Из СтруктураВременногоХранилища.НастройкаФормы Цикл
				НастройкаФормы[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;							
			КонецЦикла;
		КонецЕсли;		

		Если СтруктураВременногоХранилища.Свойство("Сообщение") И ТипЗнч(СтруктураВременногоХранилища.Сообщение) = Тип("Структура") Тогда
			Для Каждого ЭлементСтруктуры Из СтруктураВременногоХранилища.Сообщение Цикл
				Если ЭлементСтруктуры.Ключ = "Товары" И Не Сообщение.Товары = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Сообщение[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;							
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы_КонтурEDI()
	
	Если РежимНастройкиРасписанияАвтоотправки = Истина Тогда
		ЭтаФорма.Заголовок = "Настройка правила формирования ценового листа";
	Иначе
		ПредставлениеТипаСообщения = НастройкаФормы.Заголовок;
		ПредставлениеДатыСообщения = МодульОбъекта().ПолучитьПредставлениеДатыСообщения(Сообщение);
		
		ЭтаФорма.Заголовок = ПредставлениеТипаСообщения + " (" + ТипСообщения + ") " + ПредставлениеДатыСообщения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНастройкиФормы()

	ЗаполнитьСпискиВыбораПолей();
	ЗаполнитьСпискиВыбораКолонок();
	УстановитьСвязиПараметровВыбораХарактеристик();
	УстановитьДоступностьЭлементов();
	УстановитьВидимостьЭлементов();
	УстановитьТипыПолей1С();
	УстановитьНадписиЭлементов();
	УстановитьСвойстваЭлементов_КонтурEDI();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбораХарактеристик()
	
	СвязиПараметровВыбора = Новый Массив;
	
	Если ИмяКонфигурации1С = "УФ_УТ" Тогда 
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Номенклатура", "Элементы.Товары.ТекущиеДанные.Номенклатура"));
	ИначеЕсли ИмяКонфигурации1С = "УФ_УНФ" Тогда
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы.Товары.ТекущиеДанные.Номенклатура"));
	КонецЕсли;	
	
	Если СвязиПараметровВыбора.Количество() > 0 Тогда
		Элементы.ТоварыХарактеристикаНоменклатуры.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораПолей()
	
	Если Направление = "Исходящее" Тогда
		
		СпискиВыбораПолей = НастройкаФормы.СпискиВыбораПолей;
		
		Для каждого ТекСписок Из СпискиВыбораПолей Цикл
			ЗаполнитьСписокВыбораЭлемента(Элементы[ТекСписок.Ключ], ТекСписок.Значение);
		КонецЦикла;
		
		СписокЮрФизЛицСвоих = Новый СписокЗначений;
		СписокЮрФизЛицСвоих.ЗагрузитьЗначения(МодульОбъекта().ПолучитьСписокЭлементовСправочника("ЮрФизЛицаСвои").ВыгрузитьКолонку("ЮрФизЛицо"));
		
		ЗаполнитьСписокВыбораЭлемента(Элементы.Отправитель, СписокЮрФизЛицСвоих);
		ЗаполнитьСписокВыбораЭлемента(Элементы[СторонаЮрФизЛицаОрганизации], СписокЮрФизЛицСвоих);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораКолонок()
	
	СпискиВыбораКолонок = НастройкаФормы.СпискиВыбораКолонок;
	
	Для каждого ТекСписок Из СпискиВыбораКолонок Цикл
	    ЗаполнитьСписокВыбораЭлемента(Элементы["Товары" + ТекСписок.Ключ], ТекСписок.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораЭлемента(Элемент, Список)
	
	Элемент.СписокВыбора.Очистить();
	
	Для каждого Эл Из Список Цикл
		Элемент.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	// только просмотр	
	
	ЭтоВходящееСообщение = Направление = "Входящее";
		
	Элементы.Отправитель.ТолькоПросмотр 				= ТолькоПросмотрСообщения ИЛИ ЭтоВходящееСообщение;
	Элементы.ПредставлениеПолучателя.ТолькоПросмотр  	= ТолькоПросмотрСообщения ИЛИ ЭтоВходящееСообщение;
	Элементы.Покупатель.ТолькоПросмотр  				= ТолькоПросмотрСообщения ИЛИ ЭтоВходящееСообщение;
	Элементы.Продавец.ТолькоПросмотр  					= ТолькоПросмотрСообщения ИЛИ ЭтоВходящееСообщение;
	Элементы.ТипЦен.ТолькоПросмотр		 				= ТолькоПросмотрСообщения;
	Элементы.СтатусТовараПоУмолчанию.ТолькоПросмотр		= ТолькоПросмотрСообщения;
	Элементы.Товары.ТолькоПросмотр		 				= ТолькоПросмотрСообщения;
	Элементы.ДатаНачалаПериода.ТолькоПросмотр      		= ТолькоПросмотрСообщения;
	Элементы.ДатаОкончанияПериода.ТолькоПросмотр   		= ТолькоПросмотрСообщения;
	Элементы.НомерДоговора.ТолькоПросмотр              	= ТолькоПросмотрСообщения;
	Элементы.ДатаДоговора.ТолькоПросмотр               	= ТолькоПросмотрСообщения;
	Элементы.ДатаИнвентаризации.ТолькоПросмотр      	= ТолькоПросмотрСообщения;
	Элементы.Валюта.ТолькоПросмотр     		 			= ТолькоПросмотрСообщения;
	Элементы.НомерПрайсЛиста.ТолькоПросмотр     		= ТолькоПросмотрСообщения;
	Элементы.ТипПрайсЛиста.ТолькоПросмотр     			= ТолькоПросмотрСообщения;
	Элементы.Склад.ТолькоПросмотр     					= ТолькоПросмотрСообщения;
	
	УстановитьДоступностьКомментария();
	
	// доступность
	
	Элементы.ПодменюДобавить.Доступность 				= Не (ТолькоПросмотрСообщения ИЛИ ЭтоВходящееСообщение);
	Элементы.ТоварыСкопировать.Доступность 				= Не (ТолькоПросмотрСообщения ИЛИ ЭтоВходящееСообщение);
	Элементы.ТоварыИзменить.Доступность 				= Не (ТолькоПросмотрСообщения ИЛИ ЭтоВходящееСообщение);
	Элементы.ТоварыУдалить.Доступность 					= Не (ТолькоПросмотрСообщения ИЛИ ЭтоВходящееСообщение);
	Элементы.ЗаполнитьТовары.Доступность 				= Не (ТолькоПросмотрСообщения ИЛИ ЭтоВходящееСообщение);
	Элементы.ТоварыОчиститьТаблицуТовары.Доступность 	= Не (ТолькоПросмотрСообщения ИЛИ ЭтоВходящееСообщение);
	Элементы.ВыгружатьОстаткиВПрайсЛист.Доступность		= Не (ТолькоПросмотрСообщения ИЛИ ЭтоВходящееСообщение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКомментария()
	
	Элементы.Комментарий.ТолькоПросмотр	= ТолькоПросмотрСообщения 
	ИЛИ НЕ МодульОбъекта().ПередаватьКомментарийВИсходящихСообщениях(Направление, ТипСообщения, Получатель);

Конецпроцедуры	

&НаСервере
Процедура УстановитьСвойстваЭлементов_КонтурEDI()
	
	// РежимВыбораИзСписка	
	 		
	Элементы.Отправитель.РежимВыбораИзСписка 				= НЕ Элементы.Отправитель.ТолькоПросмотр;
	Элементы.Покупатель.РежимВыбораИзСписка  				= НЕ Элементы.Покупатель.ТолькоПросмотр;
	Элементы.Продавец.РежимВыбораИзСписка  					= НЕ Элементы.Продавец.ТолькоПросмотр;
	
	// ВыбиратьТип	
	 		
	Элементы.Отправитель.ВыбиратьТип 				= НЕ Элементы.Отправитель.ТолькоПросмотр;
	Элементы.ПредставлениеПолучателя.ВыбиратьТип  	= НЕ Элементы.ПредставлениеПолучателя.ТолькоПросмотр ;
	Элементы.Покупатель.ВыбиратьТип  				= НЕ Элементы.Покупатель.ТолькоПросмотр;
	Элементы.Продавец.ВыбиратьТип  					= НЕ Элементы.Продавец.ТолькоПросмотр;
	
	Если РежимНастройкиРасписанияАвтоотправки = Истина Тогда
		
		Элементы.ГруппаШапка.ОтображатьЗаголовок = Ложь;
		Элементы.ГруппаСодержание.ОтображатьЗаголовок = Истина;
		Элементы.ФормаЗаписатьНастройкиАвтоотправки.КнопкаПоУмолчанию = Истина;
		Элементы.НаименованиеНастройкиАвтоотправки.АвтоОтметкаНезаполненного = Истина;
		Элементы.РасписаниеНастройкиАвтоотправки.АвтоОтметкаНезаполненного = Истина;
		
	КонецЕсли;
	
	МодульОбъекта().УстановитьФорматЭлементаФормы_КонтурEDI(Элементы.ТоварыКоэффициентEDIВ1С);
	
КонецПроцедуры   

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	// кнопки
	
	Если НЕ ТипСообщения = "PRICELIST" И НЕ ТипСообщения = "PRICAT" Тогда
		Элементы.КакиеТоварыНеПопадутВТаблицу.Видимость = Ложь;
		Элементы.ПодменюДобавить.Видимость = Ложь;
		Элементы.СтраницаДопИнформация.Видимость = Ложь; 
		Элементы.ФормаСохранить.Видимость = Ложь;
	ИначеЕсли ЗначениеЗаполнено(СообщениеСсылка) Тогда
		Элементы.ФормаУдалитьСообщение.Видимость = Истина;
	КонецЕсли;
	
	Если ТолькоПросмотрСообщения Тогда
		Элементы.ФормаОтправить.Видимость = Ложь;
		Элементы.ФормаСохранить.Видимость = Ложь;
	КонецЕсли;
	
	// видимость полей
	
	НевидимыеПоля = НастройкаФормы.НевидимыеПоля;
	
	Для каждого ИмяПоля Из НевидимыеПоля Цикл
		СделатьНевидимымЭлементФормы(ИмяПоля);	
	КонецЦикла;
	
	// видимость колонок товаров
	
	НевидимыеКолонки = НастройкаФормы.НевидимыеКолонки;
	
	Для каждого ИмяКолонки Из НевидимыеКолонки Цикл
		СделатьНевидимойКолонкуТоваров(ИмяКолонки);	
	КонецЦикла;
	
	Если НЕ МодульОбъекта().ЕстьНеобходимыеМетаданные("Справочники.ВидыНоменклатуры") Тогда 
		Элементы.ТоварыДобавитьНоменклатуруПоВиду.Видимость = Ложь;
		Элементы.ТоварыДобавитьНоменклатуруПоГруппеВида.Видимость = Ложь;
	КонецЕсли;
	
	ПоказатьСкрытьКолонкуСОстаткомИСклад();
	
	Если РежимНастройкиРасписанияАвтоотправки = Истина Тогда
		
		Элементы.НаименованиеНастройкиАвтоотправки.Видимость = Истина;
		Элементы.РасписаниеНастройкиАвтоотправки.Видимость = Истина;
		
		//Основная командная панель
		Для каждого КнопкаКоманднойПанели Из КоманднаяПанель.ПодчиненныеЭлементы Цикл
			КнопкаКоманднойПанели.Видимость = Ложь;
		КонецЦикла;
		
		Элементы.ОткрытьИнструкциюПоРаботеСПрайсЛистом.Видимость = Ложь;
		
		Элементы.ФормаЗаписатьНастройкиАвтоотправки.Видимость = Истина; 
		Элементы.ФормаПроверитьНастройкиАвтоотправки.Видимость = Истина;
		Элементы.ФормаЗакрыть.Видимость = Истина;
		
		//Командная панель таблицы товаров
		Элементы.ПодменюДобавить.Видимость = Ложь;
		Элементы.ЗаполнитьТовары.Видимость = Ложь;
		Элементы.ТоварыОчиститьТаблицуТовары.Видимость = Ложь;
		Элементы.ТоварыИзменить.Видимость = Ложь;
		Элементы.ТоварыУдалить.Видимость = Ложь;
		Элементы.ТоварыСкопировать.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СделатьНевидимымЭлементФормы(ИмяЭлементаФормы)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлементаФормы);
	
	Если НайденныйЭлемент <> Неопределено Тогда
		НайденныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СделатьНевидимойКолонкуТоваров(ИмяКолонки)
	
	НайденныйЭлемент = Элементы.Найти("Товары" + ИмяКолонки);
	
	Если НайденныйЭлемент <> Неопределено Тогда
		НайденныйЭлемент.Видимость		= Ложь;
		НайденныйЭлемент.Доступность	= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыПолей1С()
	
	ТипТипыЦен 				= МодульОбъекта().ПолучитьТипЗначенияОбъекта("ТипыЦен");
	ТипВалюта 				= МодульОбъекта().ПолучитьТипЗначенияОбъекта("Валюта");
	ТипЮрФизЛицоСвое 		= МодульОбъекта().ПолучитьТипЗначенияОбъекта("ЮрФизЛицоСвое");
    ТипЮрФизЛицоСтороннее	= МодульОбъекта().ПолучитьТипЗначенияОбъекта("ЮрФизЛицоСтороннее");
	ТипСклад				= МодульОбъекта().ПолучитьТипЗначенияОбъекта("ТочкаДоставкиСвоя");
	
	Если ЗначениеЗаполнено(ТипТипыЦен) Тогда
		
		Элементы.ТипЦен.ОграничениеТипа = Новый ОписаниеТипов(ТипТипыЦен);
		ТипЦен = МодульОбъекта().ПолучитьПустуюСсылкуОбъекта("ТипыЦен");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипВалюта) Тогда
		
		Элементы.Валюта.ОграничениеТипа = Новый ОписаниеТипов(ТипВалюта);
		Валюта = МодульОбъекта().ПолучитьПустуюСсылкуОбъекта("Валюта");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипЮрФизЛицоСвое) Тогда
		
		Элементы[СторонаЮрФизЛицаОрганизации].ОграничениеТипа = Новый ОписаниеТипов(ТипЮрФизЛицоСвое);
		
		Если Направление = "Исходящее" Тогда
			
			Элементы.Отправитель.ОграничениеТипа = Новый ОписаниеТипов(ТипЮрФизЛицоСвое);
								
			ПустаяСсылкаЮрФизЛицоСвое = МодульОбъекта().ПолучитьПустуюСсылкуОбъекта("ЮрФизЛицоСвое");
			Отправитель = ПустаяСсылкаЮрФизЛицоСвое;
			ЭтаФорма[СторонаЮрФизЛицаОрганизации] = ПустаяСсылкаЮрФизЛицоСвое;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипЮрФизЛицоСтороннее) Тогда
		
		Элементы[СторонаЮрФизЛицаПартнера].ОграничениеТипа = Новый ОписаниеТипов(ТипЮрФизЛицоСтороннее);
		
		Если Направление = "Исходящее" Тогда 			
						
			ПустаяСсылкаЮрФизЛицоСтороннее = МодульОбъекта().ПолучитьПустуюСсылкуОбъекта("ЮрФизЛицоСтороннее");
			ЭтаФорма[СторонаЮрФизЛицаПартнера] = ПустаяСсылкаЮрФизЛицоСтороннее;    			
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипСклад) Тогда
		ЭтаФорма.Склад.ТипЗначения = Новый ОписаниеТипов(ТипСклад);
	КонецЕсли;
	
	Если Направление = "Входящее" Тогда
		Элементы.Отправитель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КонтурEDI_ДополнительныеСправочники");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНадписиЭлементов()
	
	Если ТипСообщения = "PRICELIST" ИЛИ ТипСообщения = "PRICAT" Тогда
		
		Элементы.ДатаНачалаПериода.Заголовок = "Дата начала действия цен";
		Элементы.ДатаОкончанияПериода.Заголовок = "Дата окончания действия цен";
		
	ИначеЕсли ТипСообщения = "SLSRPT" ИЛИ ТипСообщения = "INVRPT" Тогда
		
		Элементы.Отправитель.Заголовок = "Отправитель отчета";
		Элементы.Покупатель.Заголовок = "Отчитывающаяся сторона";
		Элементы.Продавец.Заголовок = "Получатель отчета";
		
		Элементы.ДатаНачалаПериода.Заголовок = "Начало периода отчета";
		Элементы.ДатаОкончанияПериода.Заголовок = "Окончание периода отчета";
		
	КонецЕсли;
	
	Если ТипСообщения = "SLSRPT" Тогда	
		Элементы.ТипЦен.Заголовок = "Тип цен закупки";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПереотправляемоеСообщениеСсылка)
		И НЕ ТолькоПросмотрСообщения Тогда
		
		Элементы.ФормаОтправить.Заголовок = "Переотправить сообщение"; 
		
	ИначеЕсли Направление = "Входящее" 
		И НЕ ТолькоПросмотрСообщения Тогда
		
		Элементы.ФормаОтправить.Заголовок = "Обработать сообщение";
		
	КонецЕсли; 	
	
	Если РежимНастройкиРасписанияАвтоотправки = Истина Тогда
		
		Элементы.ГруппаШапка.Заголовок = "Правила формирования";
		Элементы.ГруппаСодержание.Заголовок = "Проверка правил";
		Элементы.ЗаполнитьТовары.Заголовок = "Проверить товары";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЮрФизЛицПартнера(Получатель)

   	СписокЮрФизЛицПартнера = ПолучитьСписокЮрФизЛицПартнера(Получатель);
	ЗаполнитьСписокВыбораЭлемента(Элементы[СторонаЮрФизЛицаПартнера], СписокЮрФизЛицПартнера);	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНомераСтрок()
	
	НомСтр = 1;
	
	Для Каждого Стр Из Товары Цикл
		Стр.НомерСтроки = НомСтр;
		НомСтр = НомСтр + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНомераСтрокКлиент()
	
	НомСтр = 1;
	
	Для Каждого Стр Из Товары Цикл
		Стр.НомерСтроки = НомСтр;
		НомСтр = НомСтр + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяСправочникаТипыЦен()
	
	ИмяСправочникаТипыЦен = МодульОбъекта().ПолучитьТипЗначенияОбъекта("ТипыЦен",,Истина);
	
	Возврат ИмяСправочникаТипыЦен;
	
КонецФункции

//получение и вывод данных ----------------------------------------------------------------

//у нас есть готовое сообщение - нужно распихать его по форме.
//по сути это обратная процедура для: ОтправитьСервер()
&НаСервере
Процедура ЗаполнитьПоляНаФорме()

	//заголовок
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " № " + Сообщение.ДокументEDI.Номер + " от " + Формат(Сообщение.ДокументEDI.Дата, "ДЛФ=Д");
	
	//шапка
	Отправитель = Сообщение.Отправитель1С; 	
	Партнер		= Сообщение.Партнер; 
				
	Если ЗначениеЗаполнено(Сообщение.Получатель1С) И Сообщение.Направление = "Исходящее" Тогда
		Получатель = Сообщение.Получатель1С;
	Иначе
		Получатель = Сообщение.Партнер;
	КонецЕсли;
	
	ЗаполнитьСписокЮрФизЛицПартнера(Получатель);
	
	Продавец 	= Сообщение.Продавец1С;
	Покупатель 	= Сообщение.Покупатель1С;
	
	Если ТипСообщения = "PRICELIST" ИЛИ ТипСообщения = "PRICAT" Тогда
		ДатаНачалаПериода		= Сообщение.ДатаНачалаДействияЦен;
		ДатаОкончанияПериода 	= Сообщение.ДатаОкончанияДействияЦен;
		НомерПрайсЛиста 		= Сообщение.ДокументEDI.Номер;
		Комментарий			 	= Сообщение.Комментарий;
		ТипПрайсЛиста 			= Сообщение.ТипПрайсЛиста;
		Если НЕ ЗначениеЗаполнено(ТипПрайсЛиста) Тогда
			ТипПрайсЛиста 		= "Catalogue";
		КонецЕсли;	
	ИначеЕсли ТипСообщения = "SLSRPT" 
		ИЛИ ТипСообщения = "INVRPT" Тогда
		ДатаНачалаПериода		= Сообщение.ДатаНачалаПериодаОтчета;
		ДатаОкончанияПериода 	= Сообщение.ДатаОкончанияПериодаОтчета;
	
	КонецЕсли;
	
	Если ТипСообщения = "INVRPT" Тогда
		ДатаИнвентаризации		= Сообщение.ДатаИнвентаризации;
		
	КонецЕсли;
	
	Валюта = Сообщение.Валюта1С;
	
	Если ЗначениеЗаполнено(Сообщение.Контракт.Номер) Тогда 
		НомерДоговора 	= Сообщение.Контракт.Номер;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Сообщение.Контракт.Дата) Тогда 
		ДатаДоговора 	= Сообщение.Контракт.Дата;
	КонецЕсли;	
	
	Если Сообщение.Свойство("ТипЦен") Тогда //для совместимости со старыми сообщениями
		ТипЦен = Сообщение.ТипЦен;
	КонецЕсли;
	
	Если Сообщение.Свойство("ВыгружатьОстаткиВПрайсЛист") Тогда 
        ВыгружатьОстаткиВПрайсЛист = Сообщение.ВыгружатьОстаткиВПрайсЛист;
        ПоказатьСкрытьКолонкуСОстаткомИСклад();
    КонецЕсли;
    
    Если Сообщение.Свойство("Склад")  Тогда 
        Склад = Сообщение.Склад;
	КонецЕсли;
	
	МодульОбъекта().ПересчитатьТоварыСообщения(Сообщение.Товары, Получатель, "В1С", Сообщение);
	
	ПересчитыватьКоличество = (Сообщение.Направление = "Входящее");
	
	// товары
	Для Каждого Строка Из Сообщение.Товары Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		ПересчитатьСтрокуТоваров(НоваяСтрока,,ПересчитыватьКоличество);
	КонецЦикла;
	
	ОбновитьНомераСтрок();
	
	//описание ошибки
	Если ЗначениеЗаполнено(ПереотправляемоеСообщениеСсылка)
		И ЗначениеЗаполнено(Сообщение.СообщениеСсылка.ОписаниеОшибки) Тогда
		СообщениеСсылка = Сообщение.СообщениеСсылка;
		ОписаниеОшибки = СообщениеСсылка.ОписаниеОшибки;
		НоваяСтрока = ТаблицаОшибок.Добавить();
		НоваяСтрока.ТекстОшибки = ОписаниеОшибки;
		ФормаСодержитОшибки = Истина;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПоляНаФорме()

&НаСервере
Процедура ЗаполнитьПоляНаФормеЗначениямиПоУмолчанию()
	
	Валюта = МодульОбъекта().ВалютаУчета_КонтурEDI();
	
	Если Элементы.Отправитель.СписокВыбора.Количество() = 1 Тогда
		Отправитель = Элементы.Отправитель.СписокВыбора.Получить(0).Значение;
		ЭтаФорма[СторонаЮрФизЛицаОрганизации] = Отправитель;
	КонецЕсли;
	
	Если ТипСообщения = "PRICELIST" ИЛИ ТипСообщения = "PRICAT" Тогда
		СтатусТовараПоУмолчанию = "Changed";		
		ТипПрайсЛиста = "Catalogue";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОткрытьПанельОшибокСервер()
	
	Элементы.ГруппаОшибки.Видимость = истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьПанельОшибокСервер()
	
	Элементы.ГруппаОшибки.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПанельОшибокКлиент()
	
	Элементы.ГруппаОшибки.Видимость = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПанельОшибокКлиент()
	
	Элементы.ГруппаОшибки.Видимость = Ложь;
	
КонецПроцедуры

//кнопки нижней командной панели ----------------------------------------------------------
&НаКлиенте
Процедура ОтправитьСообщение(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ПроверитьЗаполнениеФормы();
	
	ТабличнаяЧастьЗаполнена = ПроверитьЗаполнениеТабличнойЧасти_КонтурEDI();
	
	Если ФормаСодержитОшибки ИЛИ НЕ ТабличнаяЧастьЗаполнена Тогда
		ОткрытьПанельОшибокКлиент();
		Возврат;
	КонецЕсли;
	
	Если Сообщение.Направление = "Входящее" Тогда
		
		ОбработатьВходящееНезависимоеСообщение_Сервер();
		
	Иначе
		
		ОтправитьСообщениеСервер();
		
	КонецЕсли;
	
	Закрыть();	
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеТабличнойЧасти_КонтурEDI()
	
	Успешно = Истина;
	
	Если Товары.Количество() = 0 Тогда 
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Заполните табличную часть ""Товары""");	
		Успешно = Ложь;
		
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции

&НаКлиенте
Процедура Сохранить(Команда)
	
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();	
	СохранитьСообщениеСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСообщение(Команда)
	
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	МодульОбъектаКлиент().ОткрытьФормуПроверкиПароляУчетнойЗаписи(Неопределено, Истина, "ОбработчикПроверкиПароляДляУдаленияСообщения", ЭтаФорма); 
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВходящееНезависимоеСообщение_Сервер()
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();	
	
	ПеренестиПоля1СвСообщение(Сообщение);
	
	МодульОбъекта().ОбработатьВходящееНезависимоеСообщение(Сообщение);
	
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры 

&НаСервере
Процедура ОтправитьСообщениеСервер()
	
	ТоварыКопия = РеквизитФормыВЗначение("Товары");
	СтруктураПараметры = ПолучитьПараметрыДляПодготовкиСообщения(ТипСообщения);
	МодульОбъекта().ОтправитьНезависимоеСообщение(ТипСообщения, ТоварыКопия, СтруктураПараметры);
	
КонецПроцедуры // Отправить()

&НаСервере
Процедура СохранитьСообщениеСервер()
	
	ТоварыКопия = РеквизитФормыВЗначение("Товары");
	
	СтруктураПараметры = ПолучитьПараметрыДляПодготовкиСообщения(ТипСообщения);
	СтруктураПараметры.Вставить("ПроверитьСообщение", Истина);
	
	СообщениеСтруктура = МодульОбъекта().ПодготовитьИсходящееНезависимоеСообщение(ТипСообщения, ТоварыКопия, СтруктураПараметры);
	
	РезультатСохранения = МодульОбъекта().КнопкаФормыСообщенияНажатие("Сохранить", СообщениеСтруктура);
	
	Если РезультатСохранения.СообщениеСохранено = Истина Тогда
		СообщениеСсылка = СообщениеСтруктура.СообщениеСсылка;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыДляАвтоотправкиСообщенияПоРасписанию()
	
	Возврат ПолучитьПараметрыДляПодготовкиСообщения(ТипСообщения);
	
КонецФункции

&НаКлиенте
Процедура ОбработчикПроверкиПароляДляУдаленияСообщения(РезультатПроверкиПароля,ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатПроверкиПароля = Истина Тогда
		
		ТекстВопроса = "Текущее сообщение будет навсегда удалено из 1С. Продолжить?";
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить("Да, удалить сообщение");
		СписокКнопок.Добавить("Нет, не удалять");
		
		ИмяОбработчика = "ОбработчикСогласияУдаленияСообщения";
		
		МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика, ЭтаФорма, Неопределено, ТекстВопроса, СписокКнопок);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСогласияУдаленияСообщения(РезультатВопроса,ДополнительныеПараметры = Неопределено) Экспорт

	Если РезультатВопроса = "Да, удалить сообщение" Тогда
		
		УдалитьСообщениеВызовСервера();
		Закрыть(Неопределено);
		
	КонецЕсли;

КонецПроцедуры // ОбработчикСогласияУдаленияСообщения()

&НаСервере
Процедура УдалитьСообщениеВызовСервера()
	
	МодульОбъекта().УдалитьСообщение(Сообщение);

КонецПроцедуры // УдалитьСообщениеВызовСервера()


//кнопки верхней командной панели ---------------------------------------------------------

&НаКлиенте
Процедура ДобавитьЭлемент(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если ПустаяСтрока(ПредставлениеПолучателя) Тогда
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстОбязательностиРеквизита("Партнер"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипЦен) Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Признак", "ОдинИлиГруппаТоваров");
		ДопПараметры.Вставить("Команда", Команда);
		ЗадатьВопросПроЗаполнениеТипаЦен(ДопПараметры);
	Иначе
		ВыбратьТовары(Команда.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросПроЗаполнениеТипаЦен(ДопПараметры = Неопределено)
	
	ЗаголовокДиалога	= "Контур.EDI. Заполнение типа цен";
	ТекстВопроса		= "Не выбран тип цен. Заполнить товар(ы) без цен?";
	ОбработчикВопроса 	= "ОбработчикСогласияЗаполненияТоваровБезЦен";
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить("Да, заполнить без цен");
	КнопкиВопроса.Добавить("Выбрать тип цен");
	КнопкиВопроса.Добавить("Отмена");

	
	КнопкаПоУмолчанию = "Да, заполнить без цен";
			
	МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ОбработчикВопроса, 
												   ЭтаФорма, 
												   ДопПараметры, 
												   ТекстВопроса, 
												   КнопкиВопроса,
												   ,
												   КнопкаПоУмолчанию, 
												   ЗаголовокДиалога);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОдинИлиГруппуТоваров(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ВыбратьТовары(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТовары(ЭлементИлиГруппа)
	
	ВыбратьГруппу = (ЭлементИлиГруппа = "ДобавитьГруппу");
	
	ПараметрыФормыВыбораНоменклатуры = Новый Структура;
	
	Если ВыбратьГруппу Тогда 
		ПараметрыФормыВыбораНоменклатуры.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Группы);
	иначе //элемент
		ПараметрыФормыВыбораНоменклатуры.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
		ПараметрыФормыВыбораНоменклатуры.Вставить("РежимВыбора",Истина);
	КонецЕсли;
	
	ИмяФормыВыбора=?(ВыбратьГруппу,"Справочник.Номенклатура.ФормаВыбораГруппы","Справочник.Номенклатура.ФормаВыбора");
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI(ИмяФормыВыбора, "", ПараметрыФормыВыбораНоменклатуры, ЭтаФорма, "ОбработчикПодбораНоменклатуры", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВидИлиГруппуВидаНоменклатуры(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ВыбратьВидНоменклатуры(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВидНоменклатуры(ВидИлиГруппаВида)
	
	ВыбратьГруппу = (ВидИлиГруппаВида = "ДобавитьНоменклатуруПоГруппеВида");
	
	ПараметрыФормыВыбораВидаНоменклатуры = Новый Структура;
	
	Если ВыбратьГруппу Тогда 
		ПараметрыФормыВыбораВидаНоменклатуры.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Группы);
	иначе //элемент
		ПараметрыФормыВыбораВидаНоменклатуры.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
		ПараметрыФормыВыбораВидаНоменклатуры.Вставить("РежимВыбора",Истина);
	КонецЕсли;
	
	ИмяФормыВыбора = ?(ВыбратьГруппу,"Справочник.ВидыНоменклатуры.ФормаВыбораГруппы", "Справочник.ВидыНоменклатуры.ФормаВыбора");
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI(ИмяФормыВыбора, "", ПараметрыФормыВыбораВидаНоменклатуры, ЭтаФорма, "ОбработчикПодбораВидаНоменклатуры", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПодбораВидаНоменклатуры(ВыбранныйВид, ДопПараметр = Неопределено) Экспорт
	
	Если ВыбранныйВид <> Неопределено Тогда
		
		СтруктураДопПараметры = ИнициализироватьПараметрыЗаполненияТоваров();
		СтруктураДопПараметры.ВидНоменклатуры = ВыбранныйВид;
		СтруктураДопПараметры.ДобавлениеНоменклатуры = Истина;
		
		ЗаполнитьТоварыКлиент(ТипСообщения, СтруктураДопПараметры);
		
	КонецЕсли;

КонецПроцедуры // ОбработчикПодбораНоменклатуры()

&НаКлиенте
Процедура ОбработчикПодбораНоменклатуры(ВыбранаяНоменклатура, ДопПараметр = Неопределено) Экспорт
	
	//один и тот же на элемент и группу
	Если ВыбранаяНоменклатура <> Неопределено Тогда
		
		СтруктураДопПараметры = ИнициализироватьПараметрыЗаполненияТоваров();
		СтруктураДопПараметры.Номенклатура = ВыбранаяНоменклатура;
		СтруктураДопПараметры.ДобавлениеНоменклатуры = Истина;
		
		ЗаполнитьТоварыКлиент(ТипСообщения, СтруктураДопПараметры);
		
	КонецЕсли;

КонецПроцедуры // ОбработчикПодбораНоменклатуры()

&НаКлиенте
Процедура ОбработчикВыбораТипаЦен(Значение, ДопПараметрПереданныйВОбработчик = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда 
		ТипЦен = Значение;
		ТипЦенОбработкаВыбораСервер(Значение);
		Если ДопПараметрПереданныйВОбработчик.Признак = "ОдинИлиГруппаТоваров" Тогда
			ВыбратьТовары(ДопПараметрПереданныйВОбработчик.Команда.Имя);
		ИначеЕсли ДопПараметрПереданныйВОбработчик.Признак = "ВсеТовары" Тогда
			ЗаполнитьТоварыКлиент(ТипСообщения);
		КонецЕсли;
	Иначе
		//Пользователь не выбрал элемент справочника
		НоваяСтрока = ТаблицаОшибок.Добавить();
		НоваяСтрока.ТекстОшибки = "Для заполнения цены товара(ов) необходимо выбрать тип цен";
		ОткрытьПанельОшибокКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСогласияПерезаполненияТЧ(РезультатВопроса,ДопПараметрПереданныйВОбработчик=Неопределено) Экспорт
	
	Если РезультатВопроса = "Да, перезаполнить" Тогда 
		ОбработчикСогласияЗаполнения();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСогласияЗаполнения(ТолькоОбновить = Ложь)
	
	ДопПараметры = ИнициализироватьПараметрыЗаполненияТоваров();
	ДопПараметры.Вставить("ТолькоОбновить", ТолькоОбновить);
	
	Если Не ЗначениеЗаполнено(ТипЦен) Тогда
		ДопПараметры.Вставить("Признак", "ВсеТовары");
		ЗадатьВопросПроЗаполнениеТипаЦен(ДопПараметры);
	Иначе
		ЗаполнитьТоварыКлиент(ТипСообщения, ДопПараметры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСогласияЗаполненияТоваровБезЦен(РезультатВопроса, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВопроса = "Выбрать тип цен" Тогда
		
		ИмяСправочникаТипыЦен = ПолучитьИмяСправочникаТипыЦен();
		Если Не ЗначениеЗаполнено(ИмяСправочникаТипыЦен) Тогда
			//Не смогли определить тип справочника
			НоваяСтрока = ТаблицаОшибок.Добавить();
			НоваяСтрока.ТекстОшибки = "Для заполнения цены товара(ов) необходимо выбрать тип цен."
										+ Символы.ПС + "Не определено имя справочника ""Типы цен"" в таблице типов";
			ОткрытьПанельОшибокКлиент();
		Иначе	
			ИмяФормыВыбора = "Справочник." + ИмяСправочникаТипыЦен + ".ФормаВыбора";
			
			МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI(ИмяФормыВыбора, "", , ЭтаФорма, "ОбработчикВыбораТипаЦен", ЭтаФорма, ДополнительныеПараметры);
			
		КонецЕсли;
		
	ИначеЕсли РезультатВопроса = "Да, заполнить без цен" Тогда
		
		Если ДополнительныеПараметры.Признак = "ОдинИлиГруппаТоваров" Тогда
			ВыбратьТовары(ДополнительныеПараметры.Команда.Имя);
		ИначеЕсли ДополнительныеПараметры.Признак = "ВсеТовары" Тогда
			ЗаполнитьТоварыКлиент(ТипСообщения);
		КонецЕсли;
		
	ИначеЕсли РезультатВопроса = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуТовары(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если Товары.Количество() <> 0 Тогда
	
		ТекстВопроса = "Данные таблицы товаров будут очищены. Продолжить?";
		
		КнопкиВопроса = Новый СписокЗначений;
		КнопкиВопроса.Добавить("Да, очистить");
		КнопкиВопроса.Добавить("Нет, НЕ очищать");
		
		МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI("ОбработчикОчиститьТЧ", ЭтаФорма,, ТекстВопроса, КнопкиВопроса);
		
	Иначе
		//нечего очищать
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОчиститьТЧ(РезультатВопроса, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВопроса = "Да, очистить" Тогда 
		
		Товары.Очистить();
		
		Обновить_ИнформациюОбОшибках();
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КакиеТоварыНеПопадутВТаблицуКнопка(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ЗаголовокПодсказки = "Какие товары не попадут в таблицу?";
	
	ТекстПодсказки = "При стандартном заполнении не будут добавлены товары:
					|
					| - которые помечены на удаление;
					| - с нулевой ценой для выбранного типа цен;
					| - которые по виду номенклатуры относятся к услугам.
					|
					|Для разработки своего алгоритма заполнения товаров можно
					|воспользоваться событием ""ПолучитьТоварыДляНезависимогоСообщения"" 
					|подключаемого модуля или расширения.";
					
	МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПодсказки,,ЗаголовокПодсказки);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЮрФизЛицПартнера(Получатель)
		
	СписокЮрФизЛицПартнера = Новый СписокЗначений;
	
	ДанныеПартнера = МодульОбъекта().ТаблицаКэшПартнеровКонтрагентов.НайтиСтроки(Новый Структура("Партнер", Получатель));
	Для Каждого Элемент Из ДанныеПартнера Цикл
		
		Если ЗначениеЗаполнено(Элемент.Контрагент) Тогда
			
			СписокЮрФизЛицПартнера.Добавить(Элемент.Контрагент);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокЮрФизЛицПартнера;
	
КонецФункции

&НаКлиенте
Процедура ПредставлениеПолучателяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Сообщение.Направление = "Исходящее" Тогда
		
		Состояние("Открытие формы выбора партнеров");
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОткрытаКакВыбор", Истина);
		
		МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Партнеры_СписокУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикВыбораПартнера", ЭтаФорма);
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораПартнера(Значение, ДопПараметр = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда 
		
		Состояние("Обработка выбора партнера");
		Получатель = Значение;
		
		ОбработчикВыбораПартнераСервер();
		
		Обновить_ИнформациюОбОшибках();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработчикВыбораПартнераСервер()
	
	ПредставлениеПолучателя = МодульОбъекта().ПолучитьПредставлениеЭлементаСправочника(Получатель);
	ЗаполнитьСписокЮрФизЛицПартнера(Получатель);
	ВыбратьЮрФизЛицоПартнераПоУмолчанию(СторонаЮрФизЛицаПартнера);
	ПриИзмененииПолучателя();
	ВосстановитьНастройкиЗаполнения();
	
	Сообщение.Партнер = Получатель;
		
	// ... особенности
	ЗаполнитьОсобенностиСообщенияНаФорме_ОсновнойМодуль();
	МодульОбъекта().ДобавитьУсловноеОформлениеОсобенностейСообщения(ЭтаФорма);
	НужноКонвертироватьОсобенностиВСообщении = МодульОбъекта().НужноКонвертироватьОсобенностиВСообщении(Сообщение);
	 	
КонецПроцедуры

&НаСервере
Процедура ВыбратьЮрФизЛицоПартнераПоУмолчанию(СторонаЮрФизЛицаПартнера)

	Если Элементы[СторонаЮрФизЛицаПартнера].СписокВыбора.Количество() = 1 Тогда
		ЭтаФорма[СторонаЮрФизЛицаПартнера] = Элементы[СторонаЮрФизЛицаПартнера].СписокВыбора.Получить(0).Значение;
	Иначе
		ЭтаФорма[СторонаЮрФизЛицаПартнера] = МодульОбъекта().ПолучитьПустуюСсылкуОбъекта("ЮрФизЛицоСтороннее");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПолучателя()

	ОбязателенGTIN 	= Не (ЗначениеЗаполнено(Получатель)
						И (МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Получатель, "РазрешитьПустыеКодыGTINВИсходящихСообщениях") = Истина));
	//только в этом случае можно говорить о том можно отправить без GTIN
	
	ТипЦен 			= МодульОбъекта().ПолучитьПустуюСсылкуОбъекта("ТипыЦен");
	ЦенаВключаетНДС = Ложь;
	НомерДоговора	= "";
	ДатаДоговора	= Дата(1, 1, 1);
	
	Если ТипСообщения = "PRICELIST" ИЛИ ТипСообщения = "PRICAT" Тогда
		НомерПрайсЛиста = "";
		УстановитьДоступностьКомментария();
	КонецЕсли;
	
КонецПроцедуры

//валидация значений полей ----------------------------------------------------------------

&НаКлиенте
Процедура ПроверитьЗаполнениеФормы()
	
	ФормаСодержитОшибки = НЕ ПроверитьЗаполнениеПолей();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеПолей() Экспорт
	
	Если Сообщение.Направление = "Исходящее" И Не ТолькоПросмотрСообщения Тогда
		
		СтруктураПараметры = ПолучитьПараметрыДляПодготовкиСообщения(ТипСообщения);
		Сообщение = МодульОбъекта().ПодготовитьИсходящееНезависимоеСообщение(Сообщение.ТипСообщения, РеквизитФормыВЗначение("Товары"), СтруктураПараметры);
		Если ЗначениеЗаполнено(СообщениеСсылка) Тогда
			Сообщение.СообщениеСсылка = СообщениеСсылка;
		КонецЕсли;
	КонецЕсли;   
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	ТаблицаОшибок.Очистить();
	
	ЕстьОшибкиВПрикрепленных = Ложь;
	
	// смотрим на статусное сообщение
	ОтразитьОшибкиИзСтатусногоСообщения_Сервер(); 	   
	
	КопияСообщения = МодульОбъекта().ПолучитьКопиюСообщения(Сообщение);
	
	Если Сообщение.Направление = "Входящее" Тогда
		
		ПеренестиПоля1СвСообщение(КопияСообщения);		
				
	КонецЕсли;
			
	РезультатПроверки = МодульОбъекта().ПроверитьПоляСообщения(КопияСообщения);
	
	Если РежимНастройкиРасписанияАвтоотправки = Истина И РезультатПроверки.Успешно = Ложь Тогда
		
		ОтборОшибокТоваров = Новый Структура("ИмяТабличнойЧасти", "Товары");
		ОшибкиТоваров = РезультатПроверки.СписокОшибок.НайтиСтроки(ОтборОшибокТоваров);
		СтрокаОшибкиЗаполненияТоваров = Неопределено;
		
		Для каждого ОшибкаТоваров Из ОшибкиТоваров Цикл
			Если МодульОбъекта().КонтурСтандарт_СтрНайти_(ОшибкаТоваров.ТекстОшибки, "должна быть заполнена") > 0 Тогда
				СтрокаОшибкиЗаполненияТоваров = ОшибкаТоваров;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не СтрокаОшибкиЗаполненияТоваров = Неопределено Тогда
			РезультатПроверки.СписокОшибок.Удалить(СтрокаОшибкиЗаполненияТоваров);
		КонецЕсли;
		
		Если РезультатПроверки.СписокОшибок.Количество() = 0 Тогда
			РезультатПроверки.Успешно = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ РезультатПроверки.Успешно Тогда
		
		ПеренестиСписокОшибокНаФорму(РезультатПроверки);
		
	КонецЕсли;
	
	ВывестиВОшибкиСостояниеЮЗДО(СтатусыЮЗДО, ТаблицаОшибок, КлассификаторСтатусовДД);
	
	ЕстьОшибки = Ложь;
	
	Для Каждого Ошибка Из ТаблицаОшибок Цикл 
		Если Ошибка.Действие <> "Информация" Тогда
			ЕстьОшибки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаОшибок.Количество() = 0 Тогда
		ЗакрытьПанельОшибокСервер();
	Иначе
		ОткрытьПанельОшибокСервер();
	КонецЕсли;
			
	КопияСообщения = Неопределено;
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	Возврат РезультатПроверки.Успешно И НЕ ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура ОтразитьОшибкиИзСтатусногоСообщения_Сервер()

	 МодульОбъекта().ОтразитьОшибкиИзСтатусногоСообщения(Сообщение, ТаблицаОшибок);

КонецПроцедуры 

&НаСервере
Процедура ПеренестиСписокОшибокНаФорму(РезультатПроверки)
		
	СписокОшибок = РезультатПроверки.СписокОшибок;
	
	СписокКоманд = Элементы.ТаблицаОшибокКоманднаяПанель.ПодчиненныеЭлементы;
	СписокКоманд.ТаблицаОшибокОткрытьИнструкциюСопоставленияТоваров.Видимость = Ложь;
	
	НайденнаяСтрока = СписокОшибок.Найти("Номенклатура", "ИмяПоля");
	
	Если НайденнаяСтрока <> Неопределено Тогда
		СписокКоманд.ТаблицаОшибокОткрытьИнструкциюСопоставленияТоваров.Видимость = Истина;
	КонецЕсли;
		
	Для Каждого Стр Из СписокОшибок Цикл
		
		НоваяСтрока = ТаблицаОшибок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		
		НайденнаяСтрока = НастройкаСсылокИсправленияОшибок.Найти(Стр.ИмяПоля, "ИмяПоля");
		
		Если Не НайденнаяСтрока = Неопределено Тогда
			НоваяСтрока.Действие = НайденнаяСтрока.ТекстСсылки;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Стр.ИмяТабличнойЧасти) Тогда
			
			Поле = Элементы.Найти(Стр.ИмяПоля);
			Если Не Поле = Неопределено Тогда
				Поле.ЦветФона = WebЦвета.ЛососьСветлый;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ИмяТабличнойЧасти) 
			И НЕ Стр.ИмяПоля = Стр.ИмяТабличнойЧасти Тогда
			
			ТекКолонка = Элементы.Найти(Стр.ИмяТабличнойЧасти + Стр.ИмяПоля); // это поле формы а не колонка
			
			Если НЕ ТекКолонка = Неопределено 
				И ТекКолонка.Видимость = Ложь Тогда
				
				ТекКолонка.Видимость	= Истина;
				ТекКолонка.Доступность	= Истина;
				
			КонецЕсли;
		 			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПеренестиПоля1СвСообщение(ТекСообщение)
	
	ТекСообщение.Продавец1С 		= Продавец;
	ТекСообщение.Покупатель1С 		= Покупатель;
	ТекСообщение.Валюта1С			= Валюта;
	
	ТекСообщение.Отправитель1С		= Отправитель;
	ТекСообщение.Получатель1С		= Получатель;
	
	ПереформироватьЕдиницыИзмерения = Ложь;
	
	сч = 0;
	
	Для каждого Стр Из Товары Цикл
		
		ТекСтрокаТоваров = ТекСообщение.Товары[сч];
 		ЗаполнитьЗначенияСвойств(ТекСтрокаТоваров, Стр);
		
		Если ТипЗнч(ТекСтрокаТоваров.ЕдиницаИзмерения) <> ТипЗнч(Стр.ЕдиницаИзмерения) Тогда
			ПереформироватьЕдиницыИзмерения = Истина;
		КонецЕсли;
		
		сч = сч + 1;
		
	КонецЦикла;
	
	Если ПереформироватьЕдиницыИзмерения Тогда  
		// ... заменить тип единицы измерения интерактивными действиями
		
		ТекСообщение.Товары.Колонки.Удалить(ТекСообщение.Товары.Колонки.ЕдиницаИзмерения);
		ТекСообщение.Товары.Колонки.Добавить("ЕдиницаИзмерения");
		
		сч = 0;
		Для каждого Стр Из Товары Цикл
			
			ТекСтрокаТоваров = ТекСообщение.Товары[сч];
			ТекСтрокаТоваров.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
			сч = сч + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТекСообщение.Направление = "Входящее" Тогда
		
		ТекСообщение.Партнер = Отправитель;
		
	Иначе
		
		ТекСообщение.Партнер = Получатель;
		
	КонецЕсли;
	
	
КонецПроцедуры

//обработчики табличной части ---------------------------------------------------------

&НаКлиенте
Процедура ПодготовитьВывестиПредупреждениеПользователю(ОписаниеОшибки, ПеревыборНоменклатуры = Ложь)
	
	ЗаголовокПодсказки 	= "Контур.EDI. Заполнение товаров сообщения " + ТипСообщения;
	ТекстПодсказки 		= ОписаниеОшибки;
	
	Если ПеревыборНоменклатуры Тогда  
		
		СтрокаПоиска = "Товары не добавлены, проверьте, что они не попадают в следующие категории:";
		СтрокаЗамены = "Товар не выбран, проверьте, что он не попадает в следующие категории:";	
		
		ТекстПодсказки = СтрЗаменить(ОписаниеОшибки, СтрокаПоиска, СтрокаЗамены);
		
	КонецЕсли;
	
	МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПодсказки,,ЗаголовокПодсказки);
	
КонецПроцедуры

&НаКлиенте
Функция ПрайсЛистВходящий()

	Возврат (ТипСообщения = "PRICAT" ИЛИ ТипСообщения = "PRICELIST") И Направление = "Входящее";

КонецФункции

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИмяКолонки = Поле.Имя;
	
	Если ИмяКолонки = "ТоварыНоменклатура"
		ИЛИ ИмяКолонки = "ТоварыЕдиницаИзмерения"
		ИЛИ ИмяКолонки = "ТоварыКоэффициентEDIВ1С"
		ИЛИ ИмяКолонки = "ТоварыКодЕдиницыИзмеренияEDI" Тогда
		
		СтандартнаяОбработка = Ложь;
				
		ТекСтрока = Элементы.Товары.ТекущиеДанные;
			
		ДопПараметры = ПараметрыСоответствияНоменклатуры();
		
		ЗаполнитьЗначенияСвойств(ДопПараметры, ТекСтрока, "GTIN,КодЕдиницыИзмеренияEDI,Наименование,Номенклатура");
		
		ДопПараметры.Вставить("КодТовараСторонний");
		ДопПараметры.Вставить("КодТовараСвой");
		
		Если Направление = "Входящее" Тогда
			ДопПараметры.КодТовараСторонний	= ТекСтрока.КодТовараПоставщика;
			ДопПараметры.КодТовараСвой		= ТекСтрока.КодТовараПокупателя;
		Иначе  			
			ДопПараметры.КодТовараСторонний	= ТекСтрока.КодТовараПокупателя;
			ДопПараметры.КодТовараСвой		= ТекСтрока.КодТовараПоставщика;
		КонецЕсли;
			
		ДопПараметры.Вставить("Партнер"		, Сообщение.Партнер);
		ДопПараметры.Вставить("Продавец1С"	, Продавец); 
		ДопПараметры.Вставить("Покупатель1С", Покупатель);		
		ДопПараметры.Вставить("ТипСообщения", ТипСообщения);
		ДопПараметры.Вставить("Направление"	, Направление);
		
		СписокВыбора = ПолучитьСписокВыбораПоСтрокеТовара(ДопПараметры);
			
		МодульОбъектаКлиент().ВыбратьИзМеню_КонтурEDI("ОбработчикВыбораСоответствияИзМеню", ЭтаФорма, ДопПараметры, СписокВыбора); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораПоСтрокеТовара(ПараметрыПоискаСоответствий)

	Возврат МодульОбъекта().СоставитьСписокВыбораПоСтрокеТоваров(ПараметрыПоискаСоответствий.GTIN, 
																 ПараметрыПоискаСоответствий.КодТовараСторонний, 
																 ПараметрыПоискаСоответствий.Партнер, 
																 ПараметрыПоискаСоответствий.Направление, 
																 ПараметрыПоискаСоответствий);

КонецФункции 

&НаКлиенте
Процедура МетрикаВыборДействияПоСтрокеТоваровСообщения(ВыбранноеЗначение)
	
	ТекущееПолеТаблицы = Элементы.Товары.ТекущийЭлемент;	

	КонтекстКлиентМетрика = НоваяМетрика().Категория("ВыборДействияПоСтрокеТоваровСообщения").ПолеВводаОбработкаВыбора(ТекущееПолеТаблицы);
		
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		КонтекстКлиентМетрика.ДобавитьПеременную("ВыбранноеДействие", ВыбранноеЗначение.Действие);
	Иначе
		КонтекстКлиентМетрика.ДобавитьПеременную("ВыбранноеДействие", ВыбранноеЗначение);
	КонецЕсли;
	
	КонтекстКлиентМетрика.НаФорме(ЭтаФорма).ПоместитьВОчередь();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСоответствияИзМеню(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МетрикаВыборДействияПоСтрокеТоваровСообщения(ВыбранноеЗначение.Значение);
	
	ИдентификаторСтроки = Элементы.Товары.ТекущаяСтрока;
	
	Если ВыбранноеЗначение.Значение = "Настроить соответствие товаров" Тогда
		
		Если ПрайсЛистВходящий() И НЕ ЗначениеЗаполнено(Партнер) Тогда
			
			ТекстПредупреждения = "Для установки соответствий номенклатуры в форму должен быть передан партнер.";
			МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
			
		Иначе
						
			ПараметрыФормы = ПараметрыСоответствияНоменклатуры();
			
			ЗаполнитьЗначенияСвойств(ПараметрыФормы, ДополнительныеПараметры);
			
			ПараметрыФормы.Вставить("КодТовараПартнера", ДополнительныеПараметры.КодТовараСторонний);
			
			МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Номенклатура_ЭлементУправляемая",
														 ,
														 ПараметрыФормы,
														 ЭтаФорма,
														 "ОбработчикПослеИнтерактивнойНастройкиСоответствий",
														 ЭтаФорма,
														 ПараметрыФормы);
														 
		КонецЕсли;
				
	ИначеЕсли ВыбранноеЗначение.Значение.Действие = "СоздатьНовинку" Тогда
		
		УникальныйИдентификторНовойСсылки = Новый УникальныйИдентификатор;
		
		ФормаОбъекта = ПолучитьФорму("Справочник." + ИмяСправочникаНоменклатуры + ".Форма.ФормаЭлемента");
		
		ДанныеФормы	= ФормаОбъекта.Объект;			
		
		ЗаполнитьНовуюНоменклатуру_НаСервере(ДанныеФормы, ИдентификаторСтроки, УникальныйИдентификторНовойСсылки);
		
		КопироватьДанныеФормы(ДанныеФормы, ФормаОбъекта.Объект);
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("СтруктураТовара"						, ВыбранноеЗначение.Значение);
		ПараметрыОповещения.Вставить("СтруктураСоответствия"				, ДополнительныеПараметры);
		ПараметрыОповещения.Вставить("ИдентификаторСтроки"					, Элементы.Товары.ТекущаяСтрока);
		ПараметрыОповещения.Вставить("УникальныйИдентификторНовойСсылки"	, УникальныйИдентификторНовойСсылки);
		ПараметрыОповещения.Вставить("ФормаОбъекта"							, ФормаОбъекта);
		
		Если МодальностьЗапрещена Тогда
			ФормаОбъекта.ОписаниеОповещенияОЗакрытии = Вычислить("Новый ОписаниеОповещения(""ОбработчикПослеСозданияНовойНоменклатуры_Клиент"", ЭтаФорма, ПараметрыОповещения)");
			ФормаОбъекта.Открыть();  			
		Иначе
			ФормаОбъекта.ОткрытьМодально();
			ОбработчикПослеСозданияНовойНоменклатуры_Клиент(Неопределено, ПараметрыОповещения);
		КонецЕсли;
		
	Иначе
		
		РезультатОбработчика = ОбработчикПослеВыбораСоответствияНаСервере(ВыбранноеЗначение.Значение, ИдентификаторСтроки);
		
		Если НЕ РезультатОбработчика.Успешно Тогда 
			ПодготовитьВывестиПредупреждениеПользователю(РезультатОбработчика.ОписаниеОшибки, Истина);	
		КонецЕсли;
		
		Обновить_ИнформациюОбОшибках();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНовуюНоменклатуру_НаСервере(ДанныеФормы, ИдентификаторСтроки, УникальныйИдентификторНовойСсылки) Экспорт
	
	НоменклатураОбъект = ДанныеФормыВЗначение(ДанныеФормы, Тип("СправочникОбъект." + ИмяСправочникаНоменклатуры));
	
	СтрокаТоваров = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	МодульОбъекта().ЗаполнитьНовуюНоменклатуру_КонтурEDI(НоменклатураОбъект, Сообщение, СтрокаТоваров, УникальныйИдентификторНовойСсылки, ИмяСправочникаНоменклатуры);
			
	ЗначениеВДанныеФормы(НоменклатураОбъект, ДанныеФормы);  	
	
КонецПроцедуры

&НаСервере
Функция НеобходимоОбновитьДанныеПоНоменклатуре(ДанныеСоответствия, СтрокаТаблицы)
	
	ПустаяСсылкаХарактеристики = МодульОбъекта().ПолучитьПустуюСсылкуОбъекта("ХарактеристикаНоменклатуры");
	
	Если ДанныеСоответствия.ХарактеристикаНоменклатуры = Неопределено И ПустаяСсылкаХарактеристики <> Неопределено Тогда		
		ДанныеСоответствия.ХарактеристикаНоменклатуры = ПустаяСсылкаХарактеристики;
	КонецЕсли;  
	
	Возврат ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) 
			И (ДанныеСоответствия.Номенклатура <> СтрокаТаблицы.Номенклатура 
				ИЛИ ДанныеСоответствия.ХарактеристикаНоменклатуры <> СтрокаТаблицы.ХарактеристикаНоменклатуры);
	
КонецФункции
			
&НаСервере
Функция ОбработчикПослеВыбораСоответствияНаСервере(ДанныеСоответствия, ИдентификаторСтроки)
	
	Результат = Новый Структура("Успешно, ОписаниеОшибки", Истина, "");
	
	СтрокаТаблицы = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если НеобходимоОбновитьДанныеПоНоменклатуре(ДанныеСоответствия, СтрокаТаблицы) Тогда
		
		ДопПараметры = ИнициализироватьПараметрыЗаполненияТоваров();
		ДопПараметры.Номенклатура = ДанныеСоответствия.Номенклатура;
		ДопПараметры.ПеревыборНоменклатуры = Истина;
		
		ДопПараметры.Вставить("СтрокаТаблицы"		, СтрокаТаблицы);
		ДопПараметры.Вставить("ДанныеСоответствия"	, ДанныеСоответствия);
		
		Результат = ЗаполнитьТоварыСервер(ТипСообщения, ДопПараметры);
		
	Иначе 	
		
		ПересчитатьСтрокуТоваров(СтрокаТаблицы,,, Истина);
		
		СписокСвойств = СписокСвойствСтроки_КонтурEDI("ХарактеристикаНоменклатуры");
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеСоответствия, СписокСвойств);
		
		ПересчитатьСтрокуТоваров(СтрокаТаблицы);
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СохранитьСоответствияНоменклатуры_Сервер(СтруктураТовара, ДопПараметры)

	СписокНоменклатуры = Новый ТаблицаЗначений;
	
	Колонки = "Артикул,Код,Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,
			  |Основной,ЕдиницаEDI,ДействиеПересчета,КоэффициентEDIВ1С,Контрагент,Договор";
	
	МодульОбъекта().ДобавитьКолонкиВТаблицуЗначений(СписокНоменклатуры, Колонки);
	
	СтрокаНоменклатуры = СписокНоменклатуры.Добавить();
	СтрокаНоменклатуры.Номенклатура					= СтруктураТовара.Номенклатура;
	СтрокаНоменклатуры.ХарактеристикаНоменклатуры	= СтруктураТовара.ХарактеристикаНоменклатуры;
	СтрокаНоменклатуры.ЕдиницаИзмерения				= СтруктураТовара.ЕдиницаИзмерения;
	СтрокаНоменклатуры.ЕдиницаEDI					= ДопПараметры.КодЕдиницыИзмеренияEDI;
	
	ТекущееСоответствие = Новый Структура;
	ТекущееСоответствие.Вставить("GTIN",				ДопПараметры.GTIN);
	ТекущееСоответствие.Вставить("КодТовараПартнера",	ДопПараметры.КодТовараСторонний);
						
	РезультатСохранения = МодульОбъекта().СоответствиеТоваров_Сохранить(СписокНоменклатуры,
																		ДопПараметры.GTIN,
																		ДопПараметры.КодТовараСторонний,
																		ДопПараметры.Наименование,
																		ДопПараметры.Партнер,
																		ТекущееСоответствие,
																		СтруктураТовара.ТипЕдиницы);
	  
КонецПроцедуры
																	
&НаКлиенте
Процедура ОбработчикПослеСозданияНовойНоменклатуры_Клиент(Результат, ДопПараметры) Экспорт
	
	НоменклатураСсылка = Неопределено;
	
	Если ДопПараметры.Свойство("ФормаОбъекта") 
		И ТипЗнч(ДопПараметры.ФормаОбъекта) = Тип("УправляемаяФорма") Тогда
		
		НоменклатураСсылка = ДопПараметры.ФормаОбъекта.Объект.Ссылка;
		
	КонецЕсли;
	
	ДопПараметры.Вставить("ФормаОбъекта", Неопределено);
	
	ОбработчикПослеСозданияНовойНоменклатуры(НоменклатураСсылка, ДопПараметры);
	
	ПроверитьЗаполнениеФормы();
	
	Если ФормаСодержитОшибки Тогда
		ОткрытьПанельОшибокКлиент();
	Иначе
		ЗакрытьПанельОшибокКлиент();
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ОбработчикПослеСозданияНовойНоменклатуры(Номенклатура, ДопПараметры) Экспорт
	  	
	СтрокаТоваров = Товары.НайтиПоИдентификатору(ДопПараметры.ИдентификаторСтроки);
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		
		ТаблицаТоваров = Новый ТаблицаЗначений;
		МодульОбъекта().ДобавитьКолонкиВТаблицуЗначений(
		ТаблицаТоваров, "GTIN,КодТовараСторонний,КодТовараСвой,КодЕдиницыИзмеренияEDI", МодульОбъекта().ОписаниеТипаСтрока_КонтурEDI(100));
		
		СтрокаТоваровДляПоиска = ТаблицаТоваров.Добавить();
		СтрокаТоваровДляПоиска.GTIN						= ДопПараметры.СтруктураСоответствия.GTIN;
		СтрокаТоваровДляПоиска.КодТовараСторонний		= ДопПараметры.СтруктураСоответствия.КодТовараСторонний;
		СтрокаТоваровДляПоиска.КодТовараСвой			= ДопПараметры.СтруктураСоответствия.КодТовараСвой;
		СтрокаТоваровДляПоиска.КодЕдиницыИзмеренияEDI	= ДопПараметры.СтруктураСоответствия.КодЕдиницыИзмеренияEDI;
		
		РезультатПодбора = МодульОбъекта().КонвертироватьТоварыEDIв1С(ТаблицаТоваров, ДопПараметры.СтруктураСоответствия, Истина);
		
		Если РезультатПодбора.Количество() > 0 Тогда
			Номенклатура = РезультатПодбора[0].Номенклатура;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		Структура = Новый Структура("Номенклатура");
		
		Структура.Вставить("Номенклатура", 					Номенклатура);
		Структура.Вставить("ХарактеристикаНоменклатуры",	Неопределено);
		
		Если ЗначениеЗаполнено(ИмяРеквизитаЕдиницаИзмерения) Тогда
			ЕдиницаИзмерения = Номенклатура[ИмяРеквизитаЕдиницаИзмерения];
		Иначе
			ЕдиницаИзмерения = Неопределено;
		КонецЕсли;
		
		Структура.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
		
		Структура.Вставить("ТипЕдиницы",					"");
		Структура.Вставить("КоэффициентEDIВ1С",				ДопПараметры.СтруктураТовара.КоэффициентEDIВ1С);
		
		СохранитьСоответствияНоменклатуры_Сервер(Структура, ДопПараметры.СтруктураСоответствия);
		
		ЗаполнитьЗначенияСвойств(СтрокаТоваров, Структура, "Номенклатура,ЕдиницаИзмерения,КоэффициентEDIВ1С");
						
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеИнтерактивнойНастройкиСоответствий(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ИдентификаторТекСтроки = ТекСтрока.ПолучитьИдентификатор();
	ОбработчикПослеИнтерактивнойНастройкиСоответствийСервер(ИдентификаторТекСтроки, ДопПараметры.КодТовараПартнера);
	
	ПроверитьЗаполнениеФормы();
	
	Если ФормаСодержитОшибки Тогда
		ОткрытьПанельОшибокКлиент();
	Иначе
		ЗакрытьПанельОшибокКлиент();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбработчикПослеИнтерактивнойНастройкиСоответствийСервер(ИдентификаторТекСтроки, КодТовараПартнера)
	
	ВыбраннаяСтрока = Товары.НайтиПоИдентификатору(ИдентификаторТекСтроки);
	
	СоответствиеТоваров = МодульОбъекта().СоответствиеТоваров_НайтиНоменклатуру(ВыбраннаяСтрока.GTIN, КодТовараПартнера, Получатель);
	
	Для каждого Стр Из СоответствиеТоваров Цикл
		
		Если Стр.Номенклатура = ВыбраннаяСтрока.Номенклатура 
			ИЛИ Не ЗначениеЗаполнено(ВыбраннаяСтрока.Номенклатура) Тогда
			
			ПересчитатьСтрокуТоваров(ВыбраннаяСтрока,,, Истина);
			
			ЗаполнитьЗначенияСвойств(ВыбраннаяСтрока, Стр, "Номенклатура,ЕдиницаИзмерения,КоэффициентEDIВ1С");
			
			ВыбраннаяСтрока.КодЕдиницыИзмеренияEDI 	= Стр.ЕдиницаEDI;
						
			ПересчитатьСтрокуТоваров(ВыбраннаяСтрока);
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоставитьСписокВыбораПоСтрокеТоваровСервер(GTIN, КодТовараПартнера, КодЕдиницыИзмеренияEDI, Партнер)
	
	СписокВыбора = МодульОбъекта().СоставитьСписокВыбораСоответствийПоТовару(GTIN, КодТовараПартнера, КодЕдиницыИзмеренияEDI, Партнер);
	Возврат СписокВыбора;
	
КонецФункции

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	ОбновитьНомераСтрокКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.Товары.ТекущиеДанные.НомерСтроки = ЭтаФорма.Товары.Количество();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ИмяКолонки 	= Элемент.ТекущийЭлемент.Имя;
	ТекСтрока 	= Элемент.ТекущиеДанные;

	Если ИмяКолонки = "ТоварыЦенаБезНДС" 
		ИЛИ ИмяКолонки = "ТоварыЦенаСНДС" Тогда
		ПересчитатьЦенуПослеИнтерактивногоРедактированияКлиент(ИмяКолонки, ТекСтрока);
	КонецЕсли;	 	

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦенуПослеИнтерактивногоРедактированияКлиент(ИмяКолонки, ТекСтрока)

	ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
	ПересчитатьЦенуПослеИнтерактивногоРедактированияСервер(ИмяКолонки, ИдентификаторСтроки)	

КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦенуПослеИнтерактивногоРедактированияСервер(ИмяКолонки, ИдентификаторСтроки)

	Строка = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если ИмяКолонки = "ТоварыЦенаБезНДС" Тогда 
		ПересчитатьЦенуСНДС(Строка);	
	ИначеЕсли ИмяКолонки = "ТоварыЦенаСНДС" Тогда
		ПересчитатьЦенуБезНДС(Строка);	
	КонецЕсли;
	
 	ПересчитатьСтрокуТоваров(Строка,, Ложь);

КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦенуСНДС(Строка)
	
	СтавкаНДС = МодульОбъекта().ПолучитьСтавкуНДС_КонтурEDI(Строка.СтавкаНДС1С);
	Строка.ЦенаСНДС = Окр((Строка.ЦенаБезНДС * (100 + СтавкаНДС)) / 100, 2, 1);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦенуБезНДС(Строка)

	СтавкаНДС = МодульОбъекта().ПолучитьСтавкуНДС_КонтурEDI(Строка.СтавкаНДС1С);
	Строка.ЦенаБезНДС = Окр((Строка.ЦенаСНДС * 100) / (100 + СтавкаНДС), 2, 1);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТовары(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если ПустаяСтрока(ПредставлениеПолучателя) Тогда
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстОбязательностиРеквизита("Партнер"));
		Возврат;
	КонецЕсли;
	
	Если Товары.Количество() <> 0 Тогда
		
		ТекстВопроса = "Данные таблицы товаров будут очищены. Продолжить?";
		
		КнопкиВопроса = Новый СписокЗначений;
		КнопкиВопроса.Добавить("Да, перезаполнить");
		КнопкиВопроса.Добавить("Нет, не перезаполнять");
		
		МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI("ОбработчикСогласияПерезаполненияТЧ", ЭтаФорма, , ТекстВопроса, КнопкиВопроса);
		
	Иначе
		ОбработчикСогласияЗаполнения();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыДляПодготовкиСообщения(ТипСообщения, ДопПараметры = Неопределено)
	
	СтруктураПараметры = Новый Структура;
	
	СтруктураПараметры.Вставить("Сообщение", 				Сообщение);
	СтруктураПараметры.Вставить("Отправитель", 				Отправитель);
	СтруктураПараметры.Вставить("Получатель", 				Получатель);
	СтруктураПараметры.Вставить("Покупатель", 				Покупатель); 
	СтруктураПараметры.Вставить("Продавец", 				Продавец);
	СтруктураПараметры.Вставить("Партнер", 					Получатель);
	СтруктураПараметры.Вставить("ДатаНачалаПериода", 		ДатаНачалаПериода);
	СтруктураПараметры.Вставить("ДатаОкончанияПериода", 	ДатаОкончанияПериода);
	СтруктураПараметры.Вставить("ТипЦен", 					ТипЦен);
	СтруктураПараметры.Вставить("ЦенаВключаетНДС", 			ЦенаВключаетНДС);
	СтруктураПараметры.Вставить("ОбязателенGTIN",			ОбязателенGTIN);
	СтруктураПараметры.Вставить("Валюта", 					Валюта);
	СтруктураПараметры.Вставить("НомерДоговора", 			НомерДоговора);
	СтруктураПараметры.Вставить("ДатаДоговора", 			ДатаДоговора);
	СтруктураПараметры.Вставить("Склад",                         Склад);
    СтруктураПараметры.Вставить("ВыгружатьОстаткиВПрайсЛист",    ВыгружатьОстаткиВПрайсЛист);
	
	ТолькоОбновить = ДопПараметры <> Неопределено И ДопПараметры.Свойство("ТолькоОбновить") И ДопПараметры.ТолькоОбновить = Истина;
	
	Если ТолькоОбновить Тогда  		
		ТабТовары = РеквизитФормыВЗначение("Товары");  		
		СтруктураПараметры.Вставить("Номенклатура", ТабТовары.ВыгрузитьКолонку("Номенклатура"));  		
	Иначе      		
		СтруктураПараметры.Вставить("Номенклатура", Неопределено); 		
	КонецЕсли;
	
	Если ТипСообщения = "PRICELIST" Тогда
		
		СтруктураПараметры.Вставить("СтатусТовараПоУмолчанию", 	СтатусТовараПоУмолчанию);
		СтруктураПараметры.Вставить("НомерПрайсЛиста", 			СокрЛП(НомерПрайсЛиста));
		СтруктураПараметры.Вставить("Комментарий", 				Комментарий);
		СтруктураПараметры.Вставить("ТипПрайсЛиста", 			СокрЛП(ТипПрайсЛиста));
		
	ИначеЕсли ТипСообщения = "INVRPT" Тогда 
		СтруктураПараметры.Вставить("ДатаИнвентаризации", 		ДатаИнвентаризации);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПереотправляемоеСообщениеСсылка) Тогда
		СтруктураПараметры.Вставить("ПереотправляемоеСообщениеСсылка", ПереотправляемоеСообщениеСсылка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеСсылка) Тогда
		СтруктураПараметры.Вставить("СообщениеСсылка", СообщениеСсылка);	
	КонецЕсли;
	
	Если ДопПараметры <> Неопределено 
		И ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		Для каждого Эл Из ДопПараметры Цикл
			СтруктураПараметры.Вставить(Эл.Ключ, Эл.Значение);		
		КонецЦикла;
	КонецЕсли;
	
	Если Не РежимНастройкиРасписанияАвтоотправки = Истина Тогда
		СтруктураПараметры.Вставить("Особенности", РеквизитФормыВЗначение("Особенности"));
		СтруктураПараметры.Вставить("ЭтаФорма", ЭтаФорма);
	КонецЕсли;
	
	Возврат СтруктураПараметры;
	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьТоварыКлиент(ТипСообщения, ДопПараметры = Неопределено)

	Результат = ЗаполнитьТоварыСервер(ТипСообщения, ДопПараметры);
	
	Если НЕ Результат.Успешно Тогда		
		ПодготовитьВывестиПредупреждениеПользователю(Результат.ОписаниеОшибки);
	КонецЕсли;
	
	ОбновитьНомераСтрокКлиент();
	
	Обновить_ИнформациюОбОшибках();

КонецПроцедуры

&НаСервере
Функция ЗаполнитьТоварыСервер(ТипСообщения, ДопПараметры = Неопределено)
	
	СохранитьНастройкиЗаполнения();
	
	Результат = Новый Структура("Успешно, ОписаниеОшибки", Ложь, "");
		
	СтруктураПараметры = ПолучитьПараметрыДляПодготовкиСообщения(ТипСообщения, ДопПараметры);
	РезультатПолучения = МодульОбъекта().ПолучитьТоварыДляНезависимогоСообщения(ТипСообщения, СтруктураПараметры);
	
	ДобавлениеНоменклатуры = Ложь;
	ПеревыборНоменклатуры = Ложь;
    
	Если ДопПараметры <> Неопределено Тогда
		
		ДопПараметры.Свойство("ПеревыборНоменклатуры"	, ПеревыборНоменклатуры);
		ДопПараметры.Свойство("ДобавлениеНоменклатуры"	, ДобавлениеНоменклатуры);
		
	КонецЕсли;

	Если НЕ ДобавлениеНоменклатуры И НЕ ПеревыборНоменклатуры Тогда
		Товары.Очистить();
	КонецЕсли;
	
	Если РезультатПолучения.Успешно Тогда
		
		Если ПеревыборНоменклатуры Тогда
			
			ОбновитьДанныеСтрокиТаблицыТоваров(ДопПараметры, РезультатПолучения.Товары);
			
		Иначе
			
			Для каждого Стр Из РезультатПолучения.Товары Цикл
				
				НоваяСтрока = Товары.Добавить();	
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
				
				ПересчитатьСтрокуТоваров(НоваяСтрока);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, РезультатПолучения);
	
	Возврат Результат;

КонецФункции // ЗаполнитьТоварыСервер()

&НаСервере
Функция СписокСвойствСтроки_КонтурEDI(ИсключаяСвойства = Неопределено)

	СписокСвойств = "Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,КодЕдиницыИзмеренияEDI,КоэффициентEDIВ1С";
	
	МассивСвойств = МодульОбъекта().КонтурСтандарт_РазложитьСтрокуВМассивСлов(СписокСвойств, ",");	
	
	Массив = Новый Массив;
	
	Для каждого Элемент Из МассивСвойств Цикл 		
		
		Если Найти(ИсключаяСвойства, Элемент) > 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		Массив.Добавить(Элемент);
		
	КонецЦикла;
	
	Возврат МодульОбъекта().КонтурСтандарт_СтрСоединить_(Массив, ",");
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеСтрокиТаблицыТоваров(ДополнительныеПараметры, ТаблицаТоваров)
	
	ТекСтрокаТаблицы = ДополнительныеПараметры.СтрокаТаблицы;
	ДанныеСоответствия = ДополнительныеПараметры.ДанныеСоответствия;
	
	ПараметрыОтбора = ПараметрыОтбораСтрокПоСоответствию_КонтурEDI(ТекСтрокаТаблицы, ДанныеСоответствия);
	
	МассивСтрок = ТаблицаТоваров.НайтиСтроки(ПараметрыОтбора);
	
	СписокСвойств = СписокСвойствСтроки_КонтурEDI();
	
	Для каждого Стр Из МассивСтрок Цикл
		
		Если Направление = "Входящее" Тогда
			
			ЗаполнитьЗначенияСвойств(ТекСтрокаТаблицы, Стр, СписокСвойств);
			
			ТекСтрокаТаблицы.КодТовараПокупателя = Стр.КодТовараПоставщика;
			
		Иначе
			ЗаполнитьЗначенияСвойств(ТекСтрокаТаблицы, Стр);
		КонецЕсли;                         
		
		Если ТекСтрокаТаблицы.ЕдиницаИзмерения <> ДанныеСоответствия.ЕдиницаИзмерения Тогда
			
			СвойстваСоответствия = СписокСвойствСтроки_КонтурEDI("Номенклатура,ХарактеристикаНоменклатуры");
			
			ЗаполнитьЗначенияСвойств(ТекСтрокаТаблицы, ДанныеСоответствия, СвойстваСоответствия);
			
		КонецЕсли;
		
		ПересчитатьСтрокуТоваров(ТекСтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОтбораСтрокПоСоответствию_КонтурEDI(СтрокаТаблицы, ДанныеСоответствия)
	
	Результат = Новый Структура;
	Результат.Вставить("GTIN"			, СтрокаТаблицы.GTIN);
	Результат.Вставить("Номенклатура"	, ДанныеСоответствия.Номенклатура);
		
	Если Направление = "Входящее" Тогда 
		Результат.Вставить("КодТовараПокупателя", СтрокаТаблицы.КодТовараПоставщика);
	Иначе
		Результат.Вставить("КодТовараПокупателя", СтрокаТаблицы.КодТовараПокупателя);	
	КонецЕсли;
	
	Если ДанныеСоответствия.ХарактеристикаНоменклатуры <> Неопределено Тогда			
		Результат.Вставить("ХарактеристикаНоменклатуры", ДанныеСоответствия.ХарактеристикаНоменклатуры);			
	КонецЕсли;
	
	Если СтрокаТаблицы.ЕдиницаИзмерения = ДанныеСоответствия.ЕдиницаИзмерения Тогда
		Результат.Вставить("ЕдиницаИзмерения", ДанныеСоответствия.ЕдиницаИзмерения);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПересчитатьСтрокуТоваров(Строка = Неопределено, ИдентификаторТекСтроки = Неопределено, ПересчитыватьКоличество = Истина, ОбратныйПересчет = Ложь)
	
	СтрокаДляПересчета = Неопределено;
	
	Если НЕ ИдентификаторТекСтроки = Неопределено Тогда
		СтрокаДляПересчета = Товары.НайтиПоИдентификатору(ИдентификаторТекСтроки);
	ИначеЕсли Не Строка = Неопределено Тогда
		СтрокаДляПересчета = Строка;	
	Иначе
		Возврат;
	КонецЕсли;	
	
	Если Сообщение.Направление = "Входящее" Тогда
		НаправлениеПересчета = "В1С";
	Иначе
		НаправлениеПересчета = "ВEDI";
	КонецЕсли;
	
	Если ОбратныйПересчет Тогда
		Если НаправлениеПересчета = "ВEDI" Тогда
			НаправлениеПересчета = "В1С";
		Иначе
			НаправлениеПересчета = "ВEDI";
		КонецЕсли;
	КонецЕсли;
	
	МодульОбъекта().ПересчитатьСтрокуТоваровНезависимогоСообщения(СтрокаДляПересчета, НаправлениеПересчета, ПересчитыватьКоличество);
			
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиЗаполнения()

	КлючОбъекта  = "КонтурEDI/НастройкиЗаполненияНезависимогоСообщения";
	КлючНастроек = ТипСообщения + "/" + СтрЗаменить(ПредставлениеПолучателя, """", "");
	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, ПолучитьСтруктуруНастроекДляСохранения());

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиЗаполнения()

	КлючОбъекта  = "КонтурEDI/НастройкиЗаполненияНезависимогоСообщения";
	КлючНастроек = ТипСообщения + "/" + СтрЗаменить(ПредставлениеПолучателя, """", "");
	
	НастройкиДляВосстановления = Неопределено;
    НастройкиДляВосстановления = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек);

	Если НЕ НастройкиДляВосстановления = Неопределено Тогда
		Для каждого Эл Из НастройкиДляВосстановления Цикл
			Если ЗначениеЗаполнено(Эл.Значение) И Найти(Строка(Эл.Значение),"Объект не найден") = 0  Тогда
				ЭтаФорма[Эл.Ключ] = Эл.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ТипЦен) Тогда
			ТипЦенОбработкаВыбораСервер(ТипЦен);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруНастроекДляСохранения()
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("Отправитель", 		Отправитель);
	СтруктураНастроек.Вставить("Получатель", 		Получатель);
	СтруктураНастроек.Вставить("Покупатель", 		Покупатель);
	СтруктураНастроек.Вставить("Продавец", 			Продавец);
	СтруктураНастроек.Вставить("ТипЦен", 			ТипЦен);
	СтруктураНастроек.Вставить("НомерДоговора", 	НомерДоговора);
	СтруктураНастроек.Вставить("ДатаДоговора", 		ДатаДоговора);
	
	Если ТипСообщения = "PRICELIST" ИЛИ ТипСообщения = "PRICAT" Тогда
		СтруктураНастроек.Вставить("СтатусТовараПоУмолчанию", 	СтатусТовараПоУмолчанию);
	КонецЕсли;
	
	Возврат СтруктураНастроек;
	
КонецФункции

&НаКлиенте
Процедура ОтправительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЭтаФорма[СторонаЮрФизЛицаОрганизации] = ВыбранноеЗначение;
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПолучателяОчистка(Элемент, СтандартнаяОбработка)
	
	Состояние("Очистка списка юр. лиц партнера");
	ПредставлениеПолучателяОчисткаСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПредставлениеПолучателяОчисткаСервер()

	ПустойСписок = Новый СписокЗначений;
	ЗаполнитьСписокВыбораЭлемента(Элементы[СторонаЮрФизЛицаПартнера], ПустойСписок);	
	ЭтаФорма[СторонаЮрФизЛицаПартнера] = МодульОбъекта().ПолучитьПустуюСсылкуОбъекта("ЮрФизЛицоСтороннее");

КонецПроцедуры 

&НаКлиенте
Процедура ТоварыКаналСбыта1СОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекМестоПродаж = Элементы.Товары.ТекущиеДанные.МестоПродаж1С;
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("МестоПродаж1С", ТекМестоПродаж));
	
	Для каждого Строка Из НайденныеСтроки Цикл
		Строка.КаналСбыта1С = ВыбранноеЗначение;	
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ТипЦенОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерПрайсЛиста) Тогда
		
		ТекстВопроса = "Изменить номер прайс-листа?";
		ОбработчикВопроса = "ОбработкаОтветаОЗаменеНомераПрайсЛиста";
		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("ВыбранныйТипЦен", ВыбранноеЗначение);
				
		МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ОбработчикВопроса, ЭтаФорма, ПараметрыОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ТипЦенОбработкаВыбораСервер(ВыбранноеЗначение, Истина);
		
	КонецЕсли;
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаОЗаменеНомераПрайсЛиста(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ТипЦенОбработкаВыбораСервер(ДополнительныеПараметры.ВыбранныйТипЦен, Истина);
	Иначе
		ТипЦенОбработкаВыбораСервер(ДополнительныеПараметры.ВыбранныйТипЦен, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТипЦенОбработкаВыбораСервер(ВыбранноеЗначение, ИзменитьНомерПрайсЛиста = Ложь)
	
	Если МодульОбъекта().ЕстьРеквизитОбъекта_Контур(ВыбранноеЗначение, "ЦенаВключаетНДС") Тогда
		ЦенаВключаетНДС = ВыбранноеЗначение.ЦенаВключаетНДС;
	КонецЕсли;		
	
	Если Не ЗначениеЗаполнено(НомерПрайсЛиста) ИЛИ ИзменитьНомерПрайсЛиста Тогда  //E1C_in-30790
		Если ЗначениеЗаполнено(ВыбранноеЗначение.Код) Тогда  
			НомерПрайсЛиста = ВыбранноеЗначение.Код;
		Иначе
			НомерПрайсЛиста = ВыбранноеЗначение.Наименование;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенОчистка(Элемент, СтандартнаяОбработка)
	
	ЦенаВключаетНДС = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьОстаткиВПрайсЛистПриИзменении(Элемент)
    
    ПоказатьСкрытьКолонкуСОстаткомИСклад();
    
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьКолонкуСОстаткомИСклад()
	
	ЭтоВходящийПрайслист = Направление = "Входящее" И ТипСообщения = "PRICELIST";
	
    Элементы.Склад.Видимость                            = ВыгружатьОстаткиВПрайсЛист;
    Элементы.ТоварыКоличествоОстаткаНаКонец.Видимость    = ВыгружатьОстаткиВПрайсЛист Или ЭтоВходящийПрайслист;
	Элементы.ТоварыКоличествоОстаткаНаКонец.Доступность    = ВыгружатьОстаткиВПрайсЛист;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроанализироватьСостояниеЮЗ();

	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "ФормаНезависимогоСообщенияУправляемая");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "ФормаНезависимогоСообщенияУправляемая");
		
	КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаОшибокДействие" Тогда
		
		ИмяПоля = Элемент.ТекущиеДанные.ИмяПоля;
		
		НайденнаяСтрока = НайтиСтрокуНастройкиСсылокИсправленияОшибок(Элемент.ТекущиеДанные.ИмяПоля);
		                  
		Если Не НайденнаяСтрока = Неопределено Тогда
			
			НоваяМетрика().НажатаНадпись(Поле).Категория("ДействиеНаФормеОшибокСообщения").Метка(НайденнаяСтрока.ТипСсылки).НаФорме(ЭтаФорма).ПоместитьВОчередь();
			
			ОбработчикИсправленияОшибкиКлиент(
			НайденнаяСтрока, 
			ИмяПоля, 
			Элемент.ТекущиеДанные.НомерСтроки, 
			Элемент.ТекущиеДанные.ТекстОшибки);
			
			ОбработчикПослеИсправленияОшибки(ИмяПоля);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикИсправленияОшибкиКлиент(НайденнаяСтрока, ИмяПоля, НомерСтроки, ТекстОшибки) Экспорт
	
	ВыполнитьДействиеДляИсправлениеОшибкиСообщения(ИмяПоля, НайденнаяСтрока.ТипСсылки, НомерСтроки, ТекстОшибки);
	
КонецПроцедуры  

&НаСервере
Процедура ВыполнитьДействиеДляИсправлениеОшибкиСообщения_Сервер(
	СтандартнаяОбработкаEDI, 
	ИмяПоля, 
	ТипСсылки, 
	НомерСтроки = Неопределено, 
	ТекстОшибки = Неопределено) Экспорт 
	
	СтандартнаяОбработкаEDI = Истина;
	
	ПараметрыПМ = Новый Структура;
	ПараметрыПМ.Вставить("ИмяПоля", ИмяПоля);
	ПараметрыПМ.Вставить("ТипСсылки", ТипСсылки);
	ПараметрыПМ.Вставить("КопияСообщения", Сообщение);
	ПараметрыПМ.Вставить("ОригиналСообщения", Сообщение);
	ПараметрыПМ.Вставить("ФормаСообщения", ЭтаФорма);
	
	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля(
	"ВыполнитьДействиеДляИсправлениеОшибки", СтандартнаяОбработкаEDI, ПараметрыПМ);
	
	Если Не СтандартнаяОбработкаEDI Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте                                             
Функция ВыполнитьДействиеДляИсправлениеОшибкиСообщения(
	ИмяПоля, 
	ТипСсылки, 
	НомерСтроки = Неопределено, 
	ТекстОшибки = Неопределено) Экспорт
	
	СтандартнаяОбработкаEDI = Истина;
	
	ВыполнитьДействиеДляИсправлениеОшибкиСообщения_Сервер(СтандартнаяОбработкаEDI, ИмяПоля, ТипСсылки, НомерСтроки, ТекстОшибки);
	
	Если Не СтандартнаяОбработкаEDI Тогда
		Возврат Неопределено;
	КонецЕсли;
		
//В УФ Неопределено //Для УФ эта клиентская функция определена в ФормаСообщенияУправляемая
	Если ТипСсылки = "НоменклатураСсылка" Тогда
		
		ДанныеСтроки = Товары[НомерСтроки - 1];
		ОткрытьФормуПросмотраСоответствий(ДанныеСтроки);
		
	ИначеЕсли ТипСсылки = "СоответствиеНоменклатуры" Тогда
		
		ДанныеСтроки = Товары[НомерСтроки - 1];
		
		ИдентификаторыТовара = ПолучитьСтруктуруИдентификаторовТовара(ДанныеСтроки, Сообщение.ТипСообщения, КтоМы);
		
		СписокВыбора = СоставитьСписокВыбораПоСтрокеТоваровСервер(
		ИдентификаторыТовара.GTIN,
		ИдентификаторыТовара.КодТовараПартнера,
		ИдентификаторыТовара.КодЕдиницыИзмеренияEDI,
		Партнер);
		
		Если Сообщение.Направление = "Входящее"
			И (СписокВыбора.Количество() = 1 И СписокВыбора.НайтиПоЗначению("Настроить соответствие товаров") <> Неопределено) Тогда
			
			ОткрытьНоменклатура_ЭлементУправляемая();
			
		Иначе 
			
			ОткрытьФормуПросмотраСоответствий(ДанныеСтроки);
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецФункции     

&НаКлиенте
Процедура ОткрытьНоменклатура_ЭлементУправляемая()
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ИдентификаторыТовара = ПолучитьСтруктуруИдентификаторовТовара(ТекСтрока, Сообщение.ТипСообщения, КтоМы);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Партнер", Партнер);
	ПараметрыФормы.Вставить("Наименование", ТекСтрока.Наименование);
	ПараметрыФормы.Вставить("GTIN", ИдентификаторыТовара.GTIN);
	ПараметрыФормы.Вставить("КодТовараПартнера", ИдентификаторыТовара.КодТовараПартнера);
	ПараметрыФормы.Вставить("КодТовараВнутренний", ИдентификаторыТовара.КодТовараВнутренний);
	ПараметрыФормы.Вставить("КодЕдиницыИзмеренияEDI", ТекСтрока.КодЕдиницыИзмеренияEDI);
	ПараметрыФормы.Вставить("ТипЕдиницы", "");
	
	
	ПараметрыОбработчика = Новый Структура("КодТовараПартнера", ИдентификаторыТовара.КодТовараПартнера);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Номенклатура_ЭлементУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослеИнтерактивнойНастройкиСоответствий", ЭтаФорма, ПараметрыОбработчика);

КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьФормуПросмотраСоответствий(ДанныеСтроки)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Сообщение", Сообщение);
	
	Если Сообщение.Направление = "Входящее" Тогда
		ПараметрыФормы.Вставить("НаименованиеПартнера", ДанныеСтроки.Наименование);
		ИдентификаторыТовара = ПолучитьСтруктуруИдентификаторовТовара(ДанныеСтроки, Сообщение.ТипСообщения, КтоМы);
		ПараметрыФормы.Вставить("ИдентификаторыТовара", ИдентификаторыТовара);
	Иначе
		ПараметрыФормы.Вставить("Документ1С", Неопределено);
		ПараметрыФормы.Вставить("Номенклатура", ДанныеСтроки.Номенклатура);
		ПараметрыФормы.Вставить("ХарактеристикаНоменклатуры", ДанныеСтроки.ХарактеристикаНоменклатуры);
		ПараметрыФормы.Вставить("ЕдиницаИзмерения", ДанныеСтроки.ЕдиницаИзмерения);
	КонецЕсли;
	
	Если Сообщение.Направление = "Исходящее" Тогда
		Обработчик = "ОбработчикПослеИсправленияОшибки";
		ПараметрыОбработчика = Неопределено;
	Иначе
		Обработчик = "ОбработчикПослеИнтерактивнойНастройкиСоответствий";
		ПараметрыОбработчика = Новый Структура("КодТовараПартнера", ДанныеСтроки.КодТовараПоставщика);
	КонецЕсли;
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("СопоставлениеНоменклатурыИзКарточкиСообщенияУправляемая",, ПараметрыФормы, ЭтаФорма, Обработчик, ЭтаФорма, ПараметрыОбработчика);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтруктуруИдентификаторовТовара(ВыбраннаяСтрока, ТипСообщения, КтоМы)
	
	Структура = Новый Структура;
	
	Структура.Вставить("GTIN", ВыбраннаяСтрока.GTIN);
	Структура.Вставить("КодЕдиницыИзмеренияEDI", ВыбраннаяСтрока.КодЕдиницыИзмеренияEDI);
	
	// supplier code & buyer code поменяны местами EDI_An-354
	Если ТипСообщения = "RETDES" 
		ИЛИ КтоМы = "Покупатель" Тогда
		
		Структура.Вставить("КодТовараПартнера", ВыбраннаяСтрока.КодТовараПоставщика);
		Структура.Вставить("КодТовараВнутренний", ВыбраннаяСтрока.КодТовараПокупателя);
		
	Иначе
		
		Структура.Вставить("КодТовараПартнера", ВыбраннаяСтрока.КодТовараПокупателя);
		Структура.Вставить("КодТовараВнутренний", ВыбраннаяСтрока.КодТовараПоставщика);
		
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикПослеИсправленияОшибки(ИмяПоля, ДопПараметр = Неопределено) Экспорт
	          	
	ПроверитьЗаполнениеФормы();
	 		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокПриАктивизацииЯчейки(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаОшибок.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		СделатьАктивнымПоле(ТекущаяСтрока.ИмяПоля, ТекущаяСтрока.ИмяТабличнойЧасти, ТекущаяСтрока.НомерСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьАктивнымПоле(ИмяПоля, ИмяТабличнойЧасти, НомерСтроки)
	
	Если ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		
		ТабличнаяЧасть = Элементы[ИмяТабличнойЧасти];
		
		ЭтаФорма.ТекущийЭлемент = ТабличнаяЧасть;
		
		Если НЕ НомерСтроки = 0 Тогда
			
			ТабличнаяЧасть.ТекущийЭлемент = Элементы.Найти(ИмяТабличнойЧасти + ИмяПоля);
			Выполнить("ТабличнаяЧасть.ТекущаяСтрока	= " + ИмяТабличнойЧасти + "[НомерСтроки-1].ПолучитьИдентификатор()");
			
		КонецЕсли;
		
	Иначе	
		
		Если ЗначениеЗаполнено(ИмяПоля) Тогда
			
			НайденноеПоле = Элементы.Найти(ИмяПоля);
			Если НЕ НайденноеПоле = Неопределено Тогда
				ЭтаФорма.ТекущийЭлемент = НайденноеПоле;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция НайтиСтрокуНастройкиСсылокИсправленияОшибок(ИмяПоля)
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();

	НайденнаяСтрока = НастройкаСсылокИсправленияОшибок.Найти(ИмяПоля, "ИмяПоля");
	Если НайденнаяСтрока <> Неопределено Тогда
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ИмяПоля", НайденнаяСтрока.ИмяПоля);
		СтруктураВозврата.Вставить("ТекстСсылки", НайденнаяСтрока.ТекстСсылки);
		СтруктураВозврата.Вставить("ТипСсылки", НайденнаяСтрока.ТипСсылки);
		
	Иначе
		
		СтруктураВозврата = Неопределено;
		
	КонецЕсли;
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	Если ФормаСодержитОшибки Тогда
		
		КоличествоОшибок = ТаблицаОшибок.Количество();
		
		ВыделенныеСтрокиТовары = МодульОбъектаКлиент().ВыделенныеСтрокиТаблицыФормы_КонтурEDI(Элемент);
		
		Для Каждого ИД_Строки Из ВыделенныеСтрокиТовары Цикл 
			
			ТекСтрока = Товары.НайтиПоИдентификатору(ИД_Строки);
			
			НомерСтроки = Товары.Индекс(ТекСтрока) + 1;
			
			УдалитьСтрокиИзТаблицыОшибок(НомерСтроки, "Товары");   			
						
			ФормаСодержитОшибки = ТаблицаОшибок.Количество() <> 0;
			
			Если ФормаСодержитОшибки Тогда
				ОткрытьПанельОшибокСервер();
			Иначе
				ЗакрытьПанельОшибокСервер();
			КонецЕсли;
			
		КонецЦикла;   		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиИзТаблицыОшибок(НомерСтроки, ИмяТабличнойЧасти)
		
	СтрокиТаблицыОшибок = ТаблицаОшибок.НайтиСтроки(Новый Структура("НомерСтроки,ИмяТабличнойЧасти", НомерСтроки, ИмяТабличнойЧасти));
	
	МассивУдаленныхСтрок = Новый Массив;
	
	Для Каждого СтрУдалить Из СтрокиТаблицыОшибок Цикл
		
		МассивУдаленныхСтрок.Добавить(СтрУдалить.НомерСтроки);
		
		ТаблицаОшибок.Удалить(СтрУдалить);
		
	КонецЦикла;
	
	Для Каждого Стр Из ТаблицаОшибок Цикл
		
		Если Стр.ИмяТабличнойЧасти = "Товары"  
			И НомерСтроки < Стр.НомерСтроки Тогда
			
			Стр.НомерСтроки = Стр.НомерСтроки - 1;
			
		КонецЕсли;			
		
	КонецЦикла;

КонецПроцедуры

// ... Особенности
&НаКлиенте
Процедура ОсобенностиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОсобенностиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсобенностиСообщенияНаФорме_ОсновнойМодуль()

	 МодульОбъекта().ЗаполнитьОсобенностиСообщенияНаФорме_УФ(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОсобенностиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПеренестиОсобенностиИПерепроверитьСообщение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобенностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	МодульОбъектаКлиент().ОсобенностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеЗакрытияУниверсальнойФормыРедактирования2(
	
	РезультатРедактирования = Неопределено, 
	ДопПараметрыОбработчика = Неопределено) Экспорт
	
	Если РезультатРедактирования = Неопределено 
		ИЛИ ДопПараметрыОбработчика = Неопределено
		ИЛИ ДопПараметрыОбработчика.НеСохранятьВСообщение = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Состояние("Переносим особенности в сообщение", 10);
	ОбработчикПослеЗакрытияУниверсальнойФормыРедактирования2Сервер(РезультатРедактирования, ДопПараметрыОбработчика);
	
	Если ФормаСодержитОшибки Тогда
		ОткрытьПанельОшибокКлиент();
	Иначе
		ЗакрытьПанельОшибокКлиент();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработчикПослеЗакрытияУниверсальнойФормыРедактирования2Сервер(РезультатРедактирования, ДопПараметрыОбработчика)
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();	
	ЗначениеОсобенности = ПолучитьИзВременногоХранилища(РезультатРедактирования);
	
	ПараметрыПМ = Новый Структура;
	ПараметрыПМ.Вставить("Сообщение", Сообщение);
	ПараметрыПМ.Вставить("Особенности", Особенности);
	ПараметрыПМ.Вставить("Форма", ЭтаФорма);
	ПараметрыПМ.Вставить("ЗначениеОсобенности", ЗначениеОсобенности);
	ПараметрыПМ.Вставить("ИдентификаторОсобенности", ДопПараметрыОбработчика.Идентификатор);
	
	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля(
	"ПеренестиОсобенностиВСообщение",, ПараметрыПМ);
														
																		
	ПолныйПутьОсобенности = МодульОбъекта().ПолучитьПолныйПутьОсобенностиСообщения(ДопПараметрыОбработчика);
	МодульОбъекта().ПеренестиЗначениеВПолеСтруктуры(Сообщение, ПолныйПутьОсобенности, ЗначениеОсобенности);
	
	ФормаСодержитОшибки = НЕ ПроверитьЗаполнениеПолей();
	
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийОсобенностиВыборЗавершение(ВыбранноеЗначение = Неопределено, ДопПараметр = Неопределено) Экспорт

	ОсобенностьВыбранаИзСпискаВыбора = Ложь;
	
	Если Не ВыбранноеЗначение = Неопределено Тогда
		
		ОсобенностьВыбранаИзСпискаВыбора = Истина;

		Если ТипЗнч(Элементы.Особенности.ТекущиеДанные.Значение) = Тип("СписокЗначений") Тогда
			Элементы.Особенности.ТекущиеДанные.Значение.Добавить(ВыбранноеЗначение.Значение, ВыбранноеЗначение.Представление);
		Иначе
			Элементы.Особенности.ТекущиеДанные.Значение = ВыбранноеЗначение.Значение;
		КонецЕсли;
	
		ПеренестиОсобенностиИПерепроверитьСообщение();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОсобенностиПередНачаломИзменения(Элемент, Отказ)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.СписокВыбора) Тогда
		Если ТипЗнч(Элемент.ТекущиеДанные.Значение) = Тип("СписокЗначений") И ЗначениеЗаполнено(Элемент.ТекущиеДанные.СписокВыбора) Тогда
			Отказ = ОсобенностьВыбранаИзСпискаВыбора = Истина; // открыть стандартный диалог редактирования списка значений если не выбрали из списка выбора
		Иначе	
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобенностиЗначениеПриИзменении(Элемент)
	
	ПеренестиОсобенностиИПерепроверитьСообщение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобенностиЗначениеОчистка(Элемент, СтандартнаяОбработка)
	Если ТипЗнч(Элементы.Особенности.ТекущиеДанные.Значение) = Тип("СписокЗначений") Тогда
		СтандартнаяОбработка = Ложь;
		Элементы.Особенности.ТекущиеДанные.Значение.Очистить();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюОбОшибках(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Обновить_ИнформациюОбОшибках();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнструкциюСопоставленияТоваров(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	АдресИнструкции = Объект.ПараметрыКлиентСервер.URLАдреса["ОшибкиПриСопоставленииТоваров"];
	
	МодульОбъектаКлиент().ОткрытьИнструкциюКлиент(Команда, ЭтаФорма, АдресИнструкции);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнструкциюПоРаботеСПрайсЛистом(Команда)
	
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	АдресИнструкции = Объект.ПараметрыКлиентСервер.URLАдреса["ИнструкцияПоРаботеСПрайсЛистом"];
	
	МодульОбъектаКлиент().ОткрытьИнструкциюКлиент(Команда, ЭтаФорма, АдресИнструкции);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить_ИнформациюОбОшибках()
	
	ПроверитьЗаполнениеФормы();
	
	Если ФормаСодержитОшибки Тогда
		ОткрытьПанельОшибокКлиент();
	Иначе
		ЗакрытьПанельОшибокКлиент();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	#Если Не ВебКлиент Тогда
		
		ТекстФайла = ОткрытьФайлВызовСервера();
		
		Если ТекстФайла = Неопределено Тогда
			
			Если ФормаСодержитОшибки Тогда
				ОткрытьПанельОшибокКлиент();
			Иначе
				ЗакрытьПанельОшибокКлиент();
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
		
		ТекДок = Новый ТекстовыйДокумент;
		ТекДок.УстановитьТекст(ТекстФайла);
		ИмяВремФайла = ПолучитьИмяВременногоФайла("xml");
		
		ТекДок.Записать(ИмяВремФайла, КодировкаТекста.UTF8);
		          		
		ЗапуститьПриложение(ИмяВремФайла);
				
	#КонецЕсли
		
КонецПроцедуры

&НаСервере
Функция ОткрытьФайлВызовСервера()
	
	ТекстФайла = Неопределено;
	
	ТаблицаОшибок.Очистить();	
	ФормаСодержитОшибки = НЕ ПроверитьЗаполнениеПолей();
	
	ВывестиВОшибкиСостояниеЮЗДО(СтатусыЮЗДО, ТаблицаОшибок, КлассификаторСтатусовДД);
	
	Если НЕ ФормаСодержитОшибки Тогда
		
		ПараметрыСообщения = ПолучитьПараметрыДляПодготовкиСообщения(ТипСообщения);
		ТоварыКопия = РеквизитФормыВЗначение("Товары");
		
		ТекДок = МодульОбъекта().ФайлНезависимогоСообщения(Сообщение, ПараметрыСообщения, ТоварыКопия);
		
		УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
		
		Если ТекДок <> Неопределено Тогда		
			ТекстФайла = ТекДок.ПолучитьТекст();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекстФайла;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТовары(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ОбработчикСогласияЗаполнения(Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПеренестиОсобенностиИПерепроверитьСообщение(Заглушка = Неопределено) Экспорт
	
	ПеренестиОсобенностиИПерепроверитьСообщениеВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиОсобенностиИПерепроверитьСообщениеВызовСервера()

	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();	

	МодульОбъекта().ПеренестиОсобенностиВСообщение(
	Сообщение, 
	РеквизитФормыВЗначение("Особенности"), 
	РеквизитФормыВЗначение("Товары"), 
	ЭтаФорма);

	Если НужноКонвертироватьОсобенностиВСообщении Тогда
		МодульОбъекта().КонвертироватьОсобенностиСообщения(Сообщение);
		МодульОбъекта().ЗаполнитьОсобенностиСообщенияНаФорме_УФ(ЭтаФорма);
	КонецЕсли;

	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	
	ОшибокБольшеНет = ПроверитьЗаполнениеПолей();	
	Если ОшибокБольшеНет = Истина Тогда
		Сообщение.СодержитОшибки = Ложь;
	КонецЕсли;
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();

КонецПроцедуры 

&НаКлиенте
Процедура ПродавецПриИзменении(Элемент)
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ПокупательПриИзменении(Элемент)
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыGTINПриИзменении(Элемент)
	
	НоваяМетрика().ПолеВводаПриИзменении(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКодТовараПокупателяПриИзменении(Элемент)
	
	НоваяМетрика().ПолеВводаПриИзменении(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКодТовараПоставщикаПриИзменении(Элемент)
	
	НоваяМетрика().ПолеВводаПриИзменении(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры  

&НаКлиенте
Процедура ТоварыКодЕдиницыИзмеренияEDIПриИзменении(Элемент)
	
	НоваяМетрика().ПолеВводаПриИзменении(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ПараметрыФормыВыбора = Новый Структура;
	ДополнительныеПараметры = Новый Структура("ТекущиеДанные, ЭлементТаблицыФормы", ТекущиеДанные, Элемент);
	
	Если ИмяКонфигурации1С = "УФ_УТ" Тогда 
		
		ПараметрыФормыВыбора.Вставить("ТекущийЭлемент"  , ТекущиеДанные.ХарактеристикаНоменклатуры);
		ПараметрыФормыВыбора.Вставить("Номенклатура"    , ТекущиеДанные.Номенклатура);
		
	ИначеЕсли ИмяКонфигурации1С = "УФ_УНФ" Тогда
		
		ОтборХарактеристик = Новый Структура;
		ОтборХарактеристик.Вставить("Владелец",ТекущиеДанные.Номенклатура);
		ПараметрыФормыВыбора.Вставить("Отбор"  , ОтборХарактеристик);
		ПараметрыФормыВыбора.Вставить("ТекущаяСтрока"  , ТекущиеДанные.ХарактеристикаНоменклатуры);
		                               
	Иначе
		Возврат; //на БП30 нет характеристик
	КонецЕсли;
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора", "", ПараметрыФормыВыбора, ЭтаФорма, "ДобавитьХарактеристикуЗавершение", ЭтаФорма, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьХарактеристикуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ТекущиеДанные.ХарактеристикаНоменклатуры = Результат;
	
	НоваяМетрика().ПолеВводаОбработкаВыбора(ДополнительныеПараметры.ЭлементТаблицыФормы).НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДоговораПриИзменении(Элемент)
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПериодаПриИзменении(Элемент)
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИнвентаризацииПриИзменении(Элемент)
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПрайсЛистаПриИзменении(Элемент)
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПрайсЛистаПриИзменении(Элемент)
	
	Обновить_ИнформациюОбОшибках();
	
КонецПроцедуры

// Универсальный Акцептор Нажатия Доавбленной Кнопки
&НаКлиенте
Процедура АкцепторДобавленнойКнопки(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	//действия, которые нужно выполнить на клиенте, например что-то спросить
	КлиентскийКодОбработчика=ПолучитьКлиентскийКодОбработчикаНажатияКнопки(Команда.Имя);
	
	Если КлиентскийКодОбработчика<>неопределено Тогда 
		//в этот моент мы знаем Команда.Имя и можем выполнить нужный код внутри КлиентскийКодОбработчика смотри описание функции ПолучитьКлиентскийКодОбработчикаНажатияКнопки
		//для дальнейшей передачи на сервер для обработки Использовать  ОбработчикИнтерактивногоДействияДобавленнойкнопки(РезультатДействия,ИмяКоманды)
		Выполнить(КлиентскийКодОбработчика); 	
	КонецЕсли;
	
	//Вне зависимости от наличия клиентского обработчика выполняем серверную процедуру	
	АкцепторДобавленнойКнопкиСервер(Команда.Имя);
	
КонецПроцедуры

////// Пример кода события "ПолучениеКодаКлиентскогоОбработчика"
// Если Команда.Имя = "ПроверитьАдекватность" Тогда
//	
//	ТекстВопроса ="Сколько будет 3 + 1000000 ?";
//	КнопкиВопроса=новый СписокЗначений;
//	КнопкиВопроса.Добавить("не знаю");
//	КнопкиВопроса.Добавить("1000003");
//	ДопПараметрДляПередачиВОбработчик=Команда.Имя;
//	РезультатВопроса = Неопределено;
//	Если Параметры.МодальностьЗапрещена Тогда                     
//		Выполнить("ПоказатьВопрос(Новый ОписаниеОповещения(""ОбработчикИнтерактивногоДействияДобавленнойкнопки"", ЭтаФорма, ДопПараметрДляПередачиВОбработчик), ТекстВопроса, КнопкиВопроса,,,""Контур.EDI"")");
//	Иначе
//		РезультатВопроса = Вопрос(ТекстВопроса, КнопкиВопроса,,,"Контур.EDI");
//		ОбработчикИнтерактивногоДействияДобавленнойкнопки(РезультатВопроса,ДопПараметрДляПередачиВОбработчик); 
//	КонецЕсли;
// КонецЕсли;
&НаСервере
Функция ПолучитьКлиентскийКодОбработчикаНажатияКнопки(ИмяКоманды)
	
	СтандартнаяОбработкаEDI = Истина;	
	
	ПараметрыПМ = Новый Структура("ИмяКоманды,Сообщение,Параметры,Форма",
	ИмяКоманды, Сообщение, Параметры, ЭтаФорма);
	
	КлиентскийКодОбработчика = 
	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ПолучениеКодаКлиентскогоОбработчика", СтандартнаяОбработкаEDI, ПараметрыПМ);
	
	Если ЗначениеЗаполнено(СокрЛП(КлиентскийКодОбработчика)) Тогда 
		Возврат КлиентскийКодОбработчика;
	Иначе
		Возврат неопределено;
	КонецЕсли;
	
КонецФункции 

// если мы хотим в режиме запрета модальности спросить что-то у пользователя, то его ответ требуется положить в обработчик
&НаКлиенте
Процедура ОбработчикИнтерактивногоДействияДобавленнойкнопки(РезультатКлиента, ИмяКоманды) Экспорт
	
	АкцепторДобавленнойКнопкиСервер(ИмяКоманды, РезультатКлиента);	
	
КонецПроцедуры 

&НаСервере
Процедура АкцепторДобавленнойКнопкиСервер(ИмяКоманды, РезультатКлиента = Неопределено)
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();   
	
	СтандартнаяОбработкаEDI = Истина;

	ПараметрыПМ = Новый Структура("ИмяКоманды,Сообщение,Параметры,Форма,РезультатКлиента", 
	ИмяКоманды, Сообщение, Параметры, ЭтаФорма, РезультатКлиента);
	
	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("КнопкаФормыСообщенияНажатие", СтандартнаяОбработкаEDI, ПараметрыПМ);
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры

&НаКлиенте                                
Процедура ОбработкаОповещения(ИмяСобытияОповещения, Параметр, Источник)
	
	// ждем  Параметр.ИмяКоманды, Параметр.Результат
	Если ИмяСобытияОповещения = "ОповещениеИзПодключаемогоМодуля" Тогда 
		АкцепторДобавленнойКнопкиСервер(Параметр.ИмяКоманды, Параметр.Результат)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуруПоВиду(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
	Если ПустаяСтрока(ПредставлениеПолучателя) Тогда
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстОбязательностиРеквизита("Партнер"));
		Возврат;
	КонецЕсли;
	
	ВыбратьВидНоменклатуры(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроанализироватьСостояниеЮЗ()
	
	Если (Сообщение.ТипСообщения = "PRICAT" ИЛИ Сообщение.ТипСообщения = "PRICELIST")
		И ЗначениеЗаполнено(Сообщение.СообщениеСсылка) 
		И Сообщение.Направление = "Исходящее" Тогда 
				
		Если ЗначениеЗаполнено(СтруктураИдентификаторовДД.boxId) И 
			ЗначениеЗаполнено(СтруктураИдентификаторовДД.messageId) Тогда
			
			Состояние("Получение статусов из Диадока...");
			
			Если СтатусыЮЗДО = Неопределено Тогда
				
				ОсновнаяФорма().МодульОбменКлиент().СброситьПроверкиДанныхАвторизации();
				
				СтатусыЮЗДО = 
				ОсновнаяФорма().МодульОбменКлиент().
				УзнатьСостояниепоСФ(Сообщение.Отправитель1С,СтруктураИдентификаторовДД.boxId,СтруктураИдентификаторовДД.messageId);
				
				ОсновнаяФорма().МодульОбменКлиент().СброситьПарольКонтейнераДанныхАвторизации();
				
			КонецЕсли;
			
			Если СтатусыЮЗДО.Успешно=Ложь Тогда 
				
				НоваяСтрока = ТаблицаОшибок.Добавить();
				НоваяСтрока.ТекстОшибки = "Не удалось получить статус из Диадок.";
				НоваяСтрока.Действие 	= "Информация";
				НоваяСтрока.ИмяПоля		= "СтатусДиадок";
				
				НоваяСтрока = ТаблицаОшибок.Добавить();
				НоваяСтрока.ТекстОшибки = СтатусыЮЗДО.ОписаниеОшибки;
				НоваяСтрока.Действие 	= "Информация";
				НоваяСтрока.ИмяПоля		= "СтатусДиадок";
				
				СтатусыЮЗДО = Неопределено;
				
			Иначе
				
				КлассификаторСтатусовДД = ОсновнаяФорма().ПолучитьКлассификаторСтатусовДД();
				
				ВывестиВОшибкиСостояниеЮЗДО(СтатусыЮЗДО, ТаблицаОшибок, КлассификаторСтатусовДД);
				
			КонецЕсли; 
			
			Состояние("");
			
		КонецЕсли; 				
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СтруктураИндетификаторовДД_Сервер()
		                                           
	СтруктураИдентификаторовДД = МодульОбъекта().ПолучитьСписокСвойствEDI("boxId,messageId", Сообщение.СообщениеСсылка);
	
	Возврат СтруктураИдентификаторовДД;

КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиВОшибкиСостояниеЮЗДО(СтатусыЮЗДО, ТаблицаОшибок, КлассификаторСтатусовДД) //они не являются ошибками, это уведомления
	
	Если СтатусыЮЗДО <> Неопределено И КлассификаторСтатусовДД <> Неопределено Тогда
				
		МассивСвойств = Новый СписокЗначений;
		МассивСвойств.Добавить("СтатусСФ", "Статус СФ");
		МассивСвойств.Добавить("СтатусТорг12", "Статус Торг12");
		МассивСвойств.Добавить("СтатусУПД", "Статус");
		МассивСвойств.Добавить("КомментарийКЗапросуУточнения", "Комментарий к запросу уточнения");
		МассивСвойств.Добавить("КомментарийКОтказуВПодписи", "Комментарий к отказу");
		МассивСвойств.Добавить("КомментарийКЗапросуАннулированияСФ", "Запрос аннулирования СФ");
		МассивСвойств.Добавить("КомментарийКЗапросуАннулированияТОРГ12", "Запрос аннулирования Торг12");
		МассивСвойств.Добавить("КомментарийКЗапросуАннулированияУПД", "Запрос аннулирования УПД");
		МассивСвойств.Добавить("СтатусАннулированияСФ", "Статус аннулирования СФ");   
		МассивСвойств.Добавить("СтатусАннулированияТорг12", "Статус аннулирования Торг12");
		МассивСвойств.Добавить("СтатусАннулированияУПД", "Статус аннулирования УПД");
		
		Для Каждого СвойствоДокумента Из МассивСвойств Цикл
			
			ЗначениеСвойства = "";
			СтатусыЮЗДО.Свойство(СвойствоДокумента.Значение, ЗначениеСвойства);
			
			Если ЗначениеСвойства <> "" И ЗначениеСвойства <> Неопределено Тогда
				
				ТекстОшибки = "";
				
				Если Лев(СвойствоДокумента.Значение,11) = "Комментарий" Тогда
					
					ТекстОшибки = СвойствоДокумента.Представление+": """ + ЗначениеСвойства + """";
					
				Иначе
					
					ПсевдонимСтатуса = КлассификаторСтатусовДД.НайтиПоЗначению(ЗначениеСвойства);
					Если ПсевдонимСтатуса <> Неопределено Тогда 
						
						ТекстОшибки = СвойствоДокумента.Представление + ": " + ПсевдонимСтатуса.Представление;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ТекстОшибки <> "" 
					И ТаблицаОшибок.НайтиСтроки(Новый Структура("ТекстОшибки", ТекстОшибки)).Количество() = 0 Тогда
					
					НоваяСтрока = ТаблицаОшибок.Добавить();
					НоваяСтрока.ТекстОшибки = ТекстОшибки;
					НоваяСтрока.ИмяПоля		= "СтатусДиадок";
					НоваяСтрока.Действие	= "Информация";
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ВывестиСостояниеЮЗДО()

//{ Центр поддержки

&НаКлиенте
Процедура ПомощьЦентрПоддержкиОшибкиСообщения(Команда)
	
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
	ОбращениеВЦентрПоддержкиПоОшибкам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбращениеВЦентрПоддержкиПоОшибкам() Экспорт
	
	ДопКонтекстДляЦентраПоддержки = Новый Структура;
	ДопКонтекстДляЦентраПоддержки.Вставить("МассивОшибок", МассивОшибокСообщения_КонтурEDI());
	ДопКонтекстДляЦентраПоддержки.Вставить("Сообщение", Сообщение);
			
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПараметрыСессии", МодульОбъектаКлиент().СформироватьПараметрыЦентраПоддержки(ДопКонтекстДляЦентраПоддержки));
	
	МодульОбъектаКлиент().ОткрытьЦентрПоддержки(ДопПараметры);
	
КонецПроцедуры 

&НаКлиенте
Функция МассивОшибокСообщения_КонтурEDI()
	
	МассивОшибок = Новый Массив;
	
	Для Каждого СтрокаОшибки Из ТаблицаОшибок Цикл
		
		Если МассивОшибок.Найти(СтрокаОшибки.ТекстОшибки) = Неопределено Тогда
			
			МассивОшибок.Добавить(СтрокаОшибки.ТекстОшибки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивОшибок;
	
КонецФункции 

//} 

//{ Настройка автоотправки прайс-листов

&НаКлиенте
Процедура ЗаписатьНастройкиАвтоотправки(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если ПроверитьНастройкиАвтоотправки() Тогда
	
		СтруктураНастроек = Новый Структура();
		СтруктураНастроек.Вставить("Наименование", НаименованиеНастройкиАвтоотправки);
		СтруктураНастроек.Вставить("Расписание", РасписаниеНастройкиАвтоотправки);
		СтруктураНастроек.Вставить("ПараметрыПодготовкиСообщения", ПолучитьПараметрыДляАвтоотправкиСообщенияПоРасписанию());
		СтруктураНастроек.Вставить("Партнер", Получатель); 
		
		Закрыть(СтруктураНастроек);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьНастройкиАвтоотправки()
	
	ЕстьОшибки = Не ПроверитьЗаполнениеПолей();
	
	ОшибкиНезаполненныхЗначений = Новый Массив;
	
	Если Не ЗначениеЗаполнено(НаименованиеНастройкиАвтоотправки) Тогда
		ЕстьОшибки = Истина;
		ОшибкиНезаполненныхЗначений.Добавить("- " + ТекстОбязательностиРеквизита("Название настройки"));
	КонецЕсли;
	
	Если РасписаниеНастройкиАвтоотправки = Неопределено Тогда
		ЕстьОшибки = Истина;
		ОшибкиНезаполненныхЗначений.Добавить("- " + ТекстОбязательностиРеквизита("Расписание"));
	КонецЕсли;
	
	Если ОшибкиНезаполненныхЗначений.Количество() > 0 Тогда
		
		ТекстОшибок = "";
		Для каждого Ошибка Из ОшибкиНезаполненныхЗначений Цикл
			ТекстОшибок = ТекстОшибок + Ошибка + Символы.ПС;
		КонецЦикла;
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстОшибок);
		
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура РасписаниеНастройкиАвтоотправкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкаРасписания = РасписаниеНастройкиАвтоотправки;
	
	Если ТипЗнч(НастройкаРасписания) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		НастройкаРасписания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	РедактированиеРасписания = Новый ДиалогРасписанияРегламентногоЗадания(НастройкаРасписания);
	
	Если МодальностьЗапрещена Тогда
		ОбработчикРезультатаРедактирования = Вычислить("Новый ОписаниеОповещения(""ПослеОкончанияРедактированияРасписания"", ЭтаФорма)");
		РедактированиеРасписания.Показать(ОбработчикРезультатаРедактирования);
	ИначеЕсли РедактированиеРасписания.ОткрытьМодально() Тогда
        ПослеОкончанияРедактированияРасписания(РедактированиеРасписания.Расписание);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияРедактированияРасписания(НастройкаРасписания, ДопПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(НастройкаРасписания) = Тип("РасписаниеРегламентногоЗадания") Тогда 
		РасписаниеНастройкиАвтоотправки = НастройкаРасписания;
		ПредставлениеРасписанияНастройкиАвтоотправки = Строка(НастройкаРасписания);
	КонецЕсли;
	
КонецПроцедуры

//}