&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

&НаКлиенте
Перем МодульОбменКлиент;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

&НаКлиенте
Функция МодульОбменКлиент()
	
	Если ТипЗнч(МодульОбменКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбменКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбменКлиент = ОсновнаяФорма.МодульОбменКлиент();
		Возврат МодульОбменКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции


// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	Параметры.Свойство("Организация", 			Организация);
	Параметры.Свойство("Сертификат", 			Сертификат);
	Параметры.Свойство("Доверенность", 			Доверенность);
	Параметры.Свойство("ТребуетсяДоверенность", ТребуетсяДоверенность);
	Параметры.Свойство("ДопПараметры", 			ДопПараметры);
	Параметры.Свойство("ОшибкиДоверенности", 	ОшибкиДоверенности);
	
	Параметры.Свойство("Контекст", Контекст);
	
	ОбновитьПредставлениеСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеСервер() 
	
	ОбновитьПредставлениеОрганизацииСервер();
	ОбновитьПредставлениеСертификатаСервер();
	ОбновитьПредставлениеДоверенностиСервер();
	ОбновитьВидимостьСервер();
	
	ОбновитьИспользоватьПоУмолчаниюСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИспользоватьПоУмолчаниюСервер()
	
	Если Контекст = "Форма_ОбщиеНастройки" Тогда
		ИспользоватьПоУмолчанию = Ложь;
		Элементы.ИспользоватьПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьСервер()
	
	Элементы.КартинкаДоверенностьОшибка.Видимость = ОшибкиДоверенности <> "";
	Элементы.ГруппаОшибкиДоверенности.Видимость = 	ОшибкиДоверенности <> "";
	
	Элементы.ГруппаОтображениеИнформации.Видимость = ТребуетсяДоверенность <> Ложь И Доверенность = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьКлиент() 
	
	Элементы.КартинкаДоверенностьОшибка.Видимость = ОшибкиДоверенности <> "";
	Элементы.ГруппаОшибкиДоверенности.Видимость =   ОшибкиДоверенности <> "";
	
	Элементы.ГруппаОтображениеИнформации.Видимость = ТребуетсяДоверенность <> Ложь И Доверенность = Неопределено;
	
КонецПроцедуры

&НаКлиенте
 Процедура ОбновитьПредставлениеКлиент() 
	
	ОбновитьПредставлениеОрганизацииСервер();
	ОбновитьПредставлениеСертификатаКлиент();
	ОбновитьПредставлениеДоверенностиКлиент();
	ОбновитьВидимостьКлиент();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеОрганизацииСервер()
	
	Если Организация <> Неопределено Тогда
		
		МассивОрганизаций = Новый Массив;
		МассивОрганизаций.Добавить(Организация);
		
		ПредставлениеОрганизации = МодульОбъекта().ПредставлениеОрганизации(МассивОрганизаций)[Организация];
		
	Иначе     
		
		ПредставлениеОрганизации = "Не указана";
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеСертификатаСервер()
	
	Если Сертификат <> Неопределено Тогда
		
		Краткое = Истина;
		ПредставлениеСертификата = МодульОбъекта().ПредставлениеСертификата(Сертификат.СвойстваСертификата, Краткое);
		Элементы.ПредставлениеДоверенности.Доступность = Истина;
		Элементы.Выбрать.Доступность = Истина;
		Элементы.ИспользоватьПоУмолчанию.Доступность = Истина;		
		
	Иначе
		
		ПредставлениеСертификата = "Выбрать...";
		Элементы.ПредставлениеДоверенности.Доступность = Ложь;
		Элементы.Выбрать.Доступность = Ложь;
		Элементы.ИспользоватьПоУмолчанию.Доступность = Ложь;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеДоверенностиСервер()
	
	Если Сертификат = Неопределено Тогда
		
		ПредставлениеДоверенности = "";
		Элементы.ПредставлениеДоверенности.Доступность = Ложь;
		
	ИначеЕсли Доверенность <> Неопределено Тогда
		
		ПредставлениеДоверенности = МодульОбъекта().Представление_МашиночитаемаяДоверенность_Краткое(Доверенность);
		Элементы.ПредставлениеДоверенности.Доступность = Истина;		                          	
		
	ИначеЕсли ТребуетсяДоверенность = Истина Тогда
		
		ПредставлениеДоверенности = "Выбрать...";
		Элементы.ПредставлениеДоверенности.Доступность = Истина;
		
	ИначеЕсли ТребуетсяДоверенность = Ложь Тогда
		
		ПредставлениеДоверенности = "Не требуется";
		Элементы.ПредставлениеДоверенности.Доступность = Ложь;
		
	ИначеЕсли ТребуетсяДоверенность = "Неопределено" Тогда
		
		ПредставлениеДоверенности = "Не удалось определить необходимость доверенности для данного сертификата";
		Элементы.ПредставлениеДоверенности.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСертификатПоУмолчанию(ДанныеСертификата)
	МодульОбъекта().СохранитьСертификатПоУмолчанию(ДанныеСертификата);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеДоверенностиКлиент()
	
	Если Сертификат = Неопределено Тогда
		
		ПредставлениеДоверенности = "";
		Элементы.ПредставлениеДоверенности.Доступность = Ложь;
		
	ИначеЕсли Доверенность <> Неопределено Тогда 
		
		ПредставлениеДоверенности = МодульОбъектаКлиент().Представление_МашиночитаемаяДоверенность_Краткое(Доверенность);	
		Элементы.ПредставлениеДоверенности.Доступность = Истина;
		
	ИначеЕсли ТребуетсяДоверенность = Истина Тогда
		
		ПредставлениеДоверенности = "Выбрать...";
		Элементы.ПредставлениеДоверенности.Доступность = Истина;
		
	ИначеЕсли ТребуетсяДоверенность = Ложь Тогда
		
		ПредставлениеДоверенности = "Не требуется";
		Элементы.ПредставлениеДоверенности.Доступность = Ложь;
		
	ИначеЕсли ТребуетсяДоверенность = "Неопределено" Тогда
		
		ПредставлениеДоверенности = "Не удалось определить необходимость доверенности для данного сертификата";
		Элементы.ПредставлениеДоверенности.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеСертификатаКлиент()
	
	Если Сертификат <> Неопределено Тогда
		
		Краткое = Истина;
		ПредставлениеСертификата = МодульОбъектаКлиент().ПредставлениеСертификата(Сертификат.СвойстваСертификата, Краткое);
		Элементы.ПредставлениеДоверенности.Доступность = Истина;
		Элементы.Выбрать.Доступность = Истина;
		Элементы.ИспользоватьПоУмолчанию.Доступность = Истина;		

	Иначе
		
		ПредставлениеСертификата = "Выбрать...";
		Элементы.ПредставлениеДоверенности.Доступность = Ложь;
		Элементы.Выбрать.Доступность = Ложь;
		Элементы.ИспользоватьПоУмолчанию.Доступность = Ложь;		
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеСертификатаНажатие(Элемент, СтандартнаяОбработка)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектПараметрыКлиентСервер", Объект.ПараметрыКлиентСервер);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Сертификат", Сертификат);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сертификаты_СписокУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикВыбораСертификата", ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСертификата(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		ОшибкиДоверенности = "";
		Доверенность = Неопределено;
		ДопПараметры.Вставить("Доверенность", Неопределено);
		
		ДопПараметры.Вставить("Действие", "ВыборСертификата");
		ДопПараметры.Вставить("Форма_СертификатыДоверенности_Открыта", Истина);
		МодульОбменКлиент().ОбработчикВыбораСертификата(ВыбранноеЗначение, ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПослеПроверкиСертификата" Тогда
		
		ПослеПроверкиСертификата(ИмяСобытия, Параметр, Источник);
		
	ИначеЕсли ИмяСобытия = "ПослеВыбораДоверенности" Тогда
		
		ПослеВыбораДоверенности(ИмяСобытия, Параметр, Источник);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораДоверенности(ИмяСобытия, Параметр, Источник)
	
	Доверенность = Параметр.Доверенность;
	ОшибкиДоверенности = Параметр.ОшибкиДоверенности;
	ДопПараметры = Параметр.ДопПараметры;
	ТребуетсяДоверенность = Истина;

	Если ОшибкиДоверенности <> "" И ОшибкиДоверенности = ДопПараметры.ИгнорируемыеОшибкиДоверенности Тогда
		ИгнорироватьОшибкиДоверенности = Истина;
	Иначе
		ИгнорироватьОшибкиДоверенности = Ложь;
	КонецЕсли;	

	ОбновитьПредставлениеКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиСертификата(ИмяСобытия, Параметр, Источник)
	
	ДопПараметры = Параметр.ДопПараметры;	
	Доверенность = Параметр.Доверенность;
	ТребуетсяДоверенность = Параметр.ТребуетсяДоверенность;
	Сертификат = Параметр.Сертификат;
	
	ОбновитьПредставлениеКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеДоверенностиНажатие(Элемент, СтандартнаяОбработка)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	СтандартнаяОбработка = Ложь;
	
	ДопПараметры.Вставить("Действие", "ВыборМЧД");
	ДопПараметры.Вставить("Форма_СертификатыДоверенности_Открыта", Истина);
	ДопПараметры.Вставить("Организация",   				Организация);
	ДопПараметры.Вставить("СертификатДействуетПо",   	Сертификат.ОкончаниеПериодаДействия);
	ДопПараметры.Вставить("РеквизитыСертификата",		Сертификат);
	ДопПараметры.Вставить("Отпечаток",   				Сертификат.Отпечаток);
	ДопПараметры.Вставить("Расположение",   			Сертификат.Расположение);
	ДопПараметры.Вставить("ТипАвторизации", 			"Сертификат");
	
	МодульОбменКлиент().ИнициализироватьДанныеАвторизации(Организация);
    МодульОбменКлиент().ДанныеАвторизации.ТипАвторизации = "Сертификат";
	МодульОбменКлиент().ОбработчикВыбораСертификата(Неопределено, ДопПараметры);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыСертификатаНаСервере(ДанныеАвторизации)
	
	Возврат МодульОбъекта().ПолучитьРеквизитыСертификата_КонтурEDI(ДанныеАвторизации);
	
КонецФункции	

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Сертификат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяМетрика().Категория("ФормаВыбора_СертификатДоверенность_Управляемая")
					.НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();

	Если ОшибкиДоверенности <> "" И ИгнорироватьОшибкиДоверенности Тогда
		ИгнорируемыеОшибкиДоверенности = ОшибкиДоверенности;
	Иначе
		ИгнорируемыеОшибкиДоверенности = "";
	КонецЕсли;
	
	Если ИспользоватьПоУмолчанию Тогда
		
		ДанныеСертификата = Новый Структура;
		ДанныеСертификата.Вставить("Организация", 			Организация);
		ДанныеСертификата.Вставить("Отпечаток", 			Сертификат.Отпечаток);
		ДанныеСертификата.Вставить("Расположение",          Сертификат.Расположение);
		ДанныеСертификата.Вставить("СертификатДействуетПо", Сертификат.ОкончаниеПериодаДействия);
		ДанныеСертификата.Вставить("Доверенность",			Доверенность);	
		ДанныеСертификата.Вставить("СвойстваСертификата",   Сертификат.СвойстваСертификата);
		ДанныеСертификата.Вставить("ТребуетсяДоверенность",   ТребуетсяДоверенность);
		ДанныеСертификата.Вставить("ИгнорируемыеОшибкиДоверенности", ИгнорируемыеОшибкиДоверенности);
		
		СохранитьСертификатПоУмолчанию(ДанныеСертификата);
		
	КонецЕсли;                                                   
	
	ДопПараметры.Вставить("Действие", "ЗавершениеПроверки");
	ДопПараметры.Вставить("Доверенность", Доверенность);
	
	Если Контекст = "Форма_ОбщиеНастройки" Или ОшибкиДоверенности = "" Или ИгнорироватьОшибкиДоверенности Тогда
		ДопПараметры.Вставить("Успешно", Истина);
	Иначе
		ДопПараметры.Вставить("Успешно", Ложь);
		ДопПараметры.Вставить("ОписаниеОшибки", ОшибкиДоверенности);		
	КонецЕсли;
	
	ДопПараметры.Вставить("Расположение", Сертификат.Расположение);
	ДопПараметры.Вставить("ТребуетсяДоверенность", ТребуетсяДоверенность);
	ДопПараметры.Вставить("ИгнорируемыеОшибкиДоверенности", ИгнорируемыеОшибкиДоверенности);
	
	Если Сертификат.Расположение = "сервер" Тогда
		ДанныеАвторизацииСертификата = МодульОбменКлиент().ПолучитьСтруктуруДанныхАвторизации();
		ДанныеАвторизацииСертификата.Отпечаток = Сертификат.Отпечаток;
		ДанныеАвторизацииСертификата.Расположение = Сертификат.Расположение;
		РеквизитыСертификата = ПолучитьРеквизитыСертификатаНаСервере(ДанныеАвторизацииСертификата);
	Иначе	
		РеквизитыСертификата = МодульОбменКлиент().ПолучитьРеквизитыСертификатаНаКлиенте(Сертификат.Отпечаток);
	КонецЕсли;
	
	ДопПараметры.Вставить("РеквизитыСертификата", РеквизитыСертификата);
	ДопПараметры.Вставить("Форма_СертификатыДоверенности_Открыта", Ложь);

	ЭтаФорма.Закрыть(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЦепочкаСобытий = Новый УникальныйИдентификатор;
	НоваяМетрика().НачатьЦепочкуСобытий(ЦепочкаСобытий)
					.Категория("ФормаВыбора_СертификатДоверенность_Управляемая").ОткрытаФорма(ЭтаФорма)
					.Метка(Контекст).ПоместитьВОчередь();
					
					
	Если Сертификат <> Неопределено И НЕ ДопПараметры.Действие = "ПроверкаНеобходимостиМЧД" Тогда
		
		ДопПараметры.Вставить("Действие", "ВыборСертификата");
		ДопПараметры.Вставить("Форма_СертификатыДоверенности_Открыта", Истина);
		ДопПараметры.Вставить("Доверенность", Доверенность);		
		
		РезультатВыбора = Новый Структура;
		РезультатВыбора.Вставить("Действие",   					"ВыборСертификата");
		РезультатВыбора.Вставить("Организация",   				Организация);
		РезультатВыбора.Вставить("СертификатДействуетПо",   	Сертификат.ОкончаниеПериодаДействия);
		РезультатВыбора.Вставить("РеквизитыСертификата",		Сертификат);
		РезультатВыбора.Вставить("Отпечаток",   				Сертификат.Отпечаток);
		РезультатВыбора.Вставить("Расположение",   				Сертификат.Расположение);
		РезультатВыбора.Вставить("ЗапомнитьВыбор",				ИспользоватьПоУмолчанию);
		
		МодульОбменКлиент().ОбработчикВыбораСертификата(РезультатВыбора, ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	НоваяМетрика().Категория("ФормаВыбора_СертификатДоверенность_Управляемая").ЗакрытаФорма(ЭтаФорма)
					.Метка(Контекст).ЗакончитьЦепочкуСобытий(ЦепочкаСобытий).ПоместитьВОчередь();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПоУмолчаниюПриИзменении(Элемент)
	
	НоваяМетрика().Категория("ФормаВыбора_СертификатДоверенность_Управляемая")
					.ПриСменеФлажка(Элемент, ИспользоватьПоУмолчанию).НаФорме(ЭтаФорма).ПоместитьВОчередь();

КонецПроцедуры
