&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// На входе ожидаем Структуру ПроизвольныеПараметры с ключами:
	// "ТекстСообщения1"
	// "ТекстСообщения2"
	// "ЗаголовокФормы"
	// "ФлагЗаголовок"
	// "ФлагВидимость"
	// "ТекстСообщения1Цвет"
	// "ТекстСообщения2Цвет"
	// "ПолеВводаРежимПароля"
	
	ЗаголовокФормы = "";
	ФлагЗаголовок = "";
	ФлагВидимость = Ложь;
	ТекстСообщения1Цвет = Неопределено;
	ТекстСообщения2Цвет = Неопределено;
	ПолеВводаРежимПароля = Ложь;

	Если ТипЗнч(Параметры.ПроизвольныеПараметры) = Тип("Структура") Тогда
		
		Параметры.ПроизвольныеПараметры.Свойство("ТекстСообщения1", 		ТекстСообщения1);
		Параметры.ПроизвольныеПараметры.Свойство("ТекстСообщения2", 		ТекстСообщения2);
		Параметры.ПроизвольныеПараметры.Свойство("ЗаголовокФормы", 			ЗаголовокФормы);
		Параметры.ПроизвольныеПараметры.Свойство("ФлагЗаголовок",			ФлагЗаголовок);
		Параметры.ПроизвольныеПараметры.Свойство("ФлагВидимость", 			ФлагВидимость);
		Параметры.ПроизвольныеПараметры.Свойство("ТекстСообщения1Цвет",		ТекстСообщения1Цвет);
		Параметры.ПроизвольныеПараметры.Свойство("ТекстСообщения2Цвет", 	ТекстСообщения2Цвет);
		Параметры.ПроизвольныеПараметры.Свойство("ПолеВводаРежимПароля",	ПолеВводаРежимПароля);
		
	КонецЕсли;
	
	Заголовок = ЗаголовокФормы;
	
	Если ПолеВводаРежимПароля = Истина Тогда
		Элементы.ПолеВвода.РежимПароля = ПолеВводаРежимПароля;
		Элементы.ПолеВвода.КнопкаВыбора = Истина;
		Элементы.ПолеВвода.КартинкаКнопкиВыбора = Элементы.КартинкаГлазОткрыт.Картинка;
	КонецЕсли;
	
	Элементы.Флаг.Видимость = ФлагВидимость;
	Элементы.Флаг.Заголовок = ФлагЗаголовок;
	
	Если ТекстСообщения1Цвет <> Неопределено Тогда
		Элементы.ТекстСообщения1.ЦветТекста = ТекстСообщения1Цвет;
	КонецЕсли;
	Если ТекстСообщения2Цвет <> Неопределено Тогда
		Элементы.ТекстСообщения2.ЦветТекста = ТекстСообщения2Цвет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Результат = Новый Структура;
	Результат.Вставить("ПолеВвода", ПолеВвода);
	Результат.Вставить("Флаг", 		Флаг);
	
	Закрыть(Результат);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПарольПользователя = Элемент.ТекстРедактирования;
	
	СменитьРежимОтображенияПароля();
	
	ПолеВвода = ПарольПользователя;
	
	Если Элемент.РежимПароля Тогда
		Элемент.КартинкаКнопкиВыбора = Элементы.КартинкаГлазОткрыт.Картинка;
	Иначе
		Элемент.КартинкаКнопкиВыбора = Элементы.КартинкаГлазЗакрыт.Картинка;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СменитьРежимОтображенияПароля()
	
	Элементы.ПолеВвода.РежимПароля = Не Элементы.ПолеВвода.РежимПароля;
	
КонецПроцедуры


