&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем ПараметрыКлиентСервер;

&НаКлиенте
Перем Кэш_Клиент;

&НаКлиенте
Перем ПеречисленияEDI;

// ИНИЦИАЛИЗАЦИЯ {

&НаКлиенте
Процедура Инициализировать() Экспорт
	
	ПараметрыКлиентСервер = Объект.ПараметрыКлиентСервер;
	ИнициализироватьПрограммныеПеречисленияМодуляНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьПрограммныеПеречисленияМодуляНаКлиенте()
	
	ПеречисленияEDI = ВыполнитьМетодМодуляОбъекта("Функция", "ПеречисленияEDI_ВсеПеречисления");
	
КонецПроцедуры

// } ИНИЦИАЛИЗАЦИЯ

// СЛУЖЕБНЫЕ {

&НаКлиенте
Процедура Кэш_Поместить(ИмяЗначения, Значение)Экспорт
	
	Если Кэш_Клиент = Неопределено Тогда
		Кэш_Клиент = Новый Соответствие;
	КонецЕсли;
	
	Кэш_Клиент.Вставить(ИмяЗначения, Значение);
	
КонецПроцедуры

&НаКлиенте
Функция Кэш_Прочитать(ИмяЗначения)
	
	Если Кэш_Клиент = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Кэш_Клиент.Получить(ИмяЗначения);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Кэш_Очистить(ИмяЗначения = Неопределено) Экспорт
	
	Если Кэш_Клиент = Неопределено Тогда
		Кэш_Клиент = Новый Соответствие;
	КонецЕсли;
	
	Если ИмяЗначения = Неопределено Тогда
		Кэш_Клиент = Новый Соответствие;
	Иначе
		Кэш_Клиент.Вставить(ИмяЗначения, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда

		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули();
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если Не ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
	
	ОсновнаяФорма = Неопределено;
	ИдентификаторОсновнойФормы = ЭтаФорма.Объект.ПараметрыКлиентСервер.IDОсновнойФормы;
	
	Попытка
		ОткрытыеОкнаКлиентскогоПриложения = ПолучитьОкна();
		Для каждого ОкноКлиентскогоПриложения Из ОткрытыеОкнаКлиентскогоПриложения Цикл

			Для каждого ФормаОкна Из ОкноКлиентскогоПриложения.Содержимое Цикл
				Если ФормаОкна.УникальныйИдентификатор = ИдентификаторОсновнойФормы Тогда
					ОсновнаяФорма = ФормаОкна;
					Прервать;
				КонецЕсли;
			КонецЦикла; 

			Если Не ОсновнаяФорма = Неопределено Тогда
				Прервать;
			КонецЕсли;

		КонецЦикла;
	Исключение
		ОсновнаяФорма = Неопределено;
	КонецПопытки;
		
	Возврат ОсновнаяФорма;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

&НаКлиенте
Функция Метрика_ИзвлечьИзВХ(Имя) Экспорт
	
	АдресВХ = Объект.ПараметрыКлиентСерверМетрика.АдресаВХ[Имя];
	
	Если Не ЭтоАдресВременногоХранилища(АдресВХ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПолучитьИзВременногоХранилища(АдресВХ);
			
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоместитьВоВХ(Имя, Значение)
	
	ПоместитьВоВременноеХранилище(Значение, Объект.ПараметрыКлиентСервер.АдресаВХ[Имя]);
				
КонецПроцедуры

&НаКлиенте
Функция ИзвлечьИзВХ(Имя)
	
	АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ[Имя];
	
	Если Не ЭтоАдресВременногоХранилища(АдресВХ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПолучитьИзВременногоХранилища(АдресВХ);
			
КонецФункции

&НаКлиенте
Функция EDI_РазложитьСтрокуВМассивСлов(Знач Строка, РазделителиСлов="") Экспорт
    
    Слова = Новый Массив;
    
    Если СтрДлина(РазделителиСлов) = 1 Тогда
        
        НайденныйСимвол = Найти(Строка,РазделителиСлов);
        Пока НайденныйСимвол>0 Цикл
            Слова.Добавить(Лев(Строка,НайденныйСимвол-1));
            Строка = Сред(Строка,НайденныйСимвол+1);
            НайденныйСимвол = Найти(Строка,РазделителиСлов);
        КонецЦикла;
        
        Если НЕ ПустаяСтрока(Строка) Тогда
            Слова.Добавить(Строка);
        КонецЕсли;
        
    Иначе
        
        Для Сч = 1 По СтрДлина(РазделителиСлов) Цикл
            Строка = СтрЗаменить(Строка,Сред(РазделителиСлов,Сч,1),Символы.ПС);
        КонецЦикла;
        
        Для Сч=1 По СтрЧислоСтрок(Строка) Цикл
            ТекСлово = СокрЛП(СтрПолучитьСтроку(Строка,Сч));
            Если ТекСлово<>"" Тогда
                Слова.Добавить(ТекСлово);
            КонецЕсли;    
        КонецЦикла;    
        
    КонецЕсли;
    
    Возврат Слова;
    
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
		
КонецПроцедуры

// ВСПОМОГАТЕЛЬНЫЕ {

&НаКлиенте
Функция ПредставлениеОрганизации(МассивОрганизаций) Экспорт
	
	Результат = Новый Соответствие;
	
	ЮрФизЛицаСвои = МодульОбъекта().ПолучитьСписокЭлементовСправочника("ЮрФизЛицаСвои");
	
	Для Каждого Организация Из МассивОрганизаций Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЮрФизЛицо", Организация);
		НайденныеСтроки = ЮрФизЛицаСвои.НайтиСтроки(Отбор);	
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Результат.Вставить(Организация, Строка(Организация) + " (" + НайденныеСтроки[0].GLN + ")");			
		Иначе
			Результат.Вставить(Организация, Строка(Организация));	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПредставлениеСертификата(СвойстваСертификата, Краткое = Ложь) Экспорт
	
	ФИО = СокрЛП(Строка(СвойстваСертификата.Субъект.Фамилия) + " " + Строка(СвойстваСертификата.Субъект.Имя) + " " + Строка(СвойстваСертификата.Субъект.Отчество));
	ИНН = СокрЛП(?(ЗначениеЗаполнено(СвойстваСертификата.Субъект.ИННЮЛ), СвойстваСертификата.Субъект.ИННЮЛ, СвойстваСертификата.Субъект.ИНН));
	НаименованиеОрганизацииСубъекта = ?(ЗначениеЗаполнено(СвойстваСертификата.Субъект.Организация), СвойстваСертификата.Субъект.Организация, ФИО); 	
	
	Представление = ?(ЗначениеЗаполнено(НаименованиеОрганизацииСубъекта), НаименованиеОрганизацииСубъекта, "<Неизвестно>");
	ИНН = ?(ЗначениеЗаполнено(ИНН), ИНН, "<Неизвестно>");

	Если Краткое Тогда
		
		Представление = Представление + ", " + ИНН; 
		
	Иначе
		
		Представление = Представление + Символы.ПС;
		
		ДанныеДляЗаполнения = Новый Массив;
		ДанныеДляЗаполнения.Добавить("ИНН: " + ИНН);
		Если ЗначениеЗаполнено(ФИО) Тогда
			ДанныеДляЗаполнения.Добавить(ФИО);
		КонецЕсли;
		
		Для Каждого Строка Из ДанныеДляЗаполнения Цикл
			Представление = Представление + Строка + Символы.ПС;			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции


&НаКлиенте
Процедура УстановитьСвойствоЭлемента(Элемент, НазваниеСвойства, Значение) Экспорт
			
	Если ПеременнаяСодержитСвойство(Элемент, НазваниеСвойства) Тогда 
		
		Элемент[НазваниеСвойства] = Значение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьМетодМодуляОбъекта(ТипМетода, ИмяМетода, ПараметрыМетода = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	МодульОбъекта = МодульОбъекта();
	
	СтрокаПараметров = "";
	Если ЗначениеСоответствуетТипу(ПараметрыМетода, "Структура") Тогда
		Для Каждого Параметр Из ПараметрыМетода Цикл
			СтрокаПараметров = СтрокаПараметров + ?(ПустаяСтрока(СтрокаПараметров),"",",") + "ПараметрыМетода." + Параметр.Ключ;				
		КонецЦикла;
	КонецЕсли;
	
	Если ТипМетода = "Процедура" Тогда
		ТекстКоманды = "МодульОбъекта." + ИмяМетода + "(" + СтрокаПараметров + ");";	
	ИначеЕсли ТипМетода = "Функция" Тогда
		ТекстКоманды = "Результат =  МодульОбъекта." + ИмяМетода + "(" + СтрокаПараметров + ");";
	КонецЕсли;
	
	Выполнить(ТекстКоманды);	
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВыполнитьПакетМетодовМодуляОбъекта(ОписаниеПакетаМетодов)
	
	РезультатВыполненияПакета = Новый Структура;
	
	Для Каждого ОписаниеМетода Из ОписаниеПакетаМетодов Цикл
		РезультатВыполненияМетода = ВыполнитьМетодМодуляОбъекта( ОписаниеМетода.ТипМетода, ОписаниеМетода.ИмяМетода, ?(ОписаниеМетода.Свойство("ПараметрыМетода"),ОписаниеМетода.ПараметрыМетода,Неопределено) );
		РезультатВыполненияПакета.Вставить(ОписаниеМетода.ИмяМетода, РезультатВыполненияМетода);
	КонецЦикла;
	
	Возврат РезультатВыполненияПакета;
		
КонецФункции

&НаСервере
Функция ВыполнитьМетодМодуляОбъектаПМ(ТипМетода, ИмяМетода, ПараметрыМетода = Неопределено) Экспорт
	
	ПараметрыМетодаПодключаемогоМодуля = Новый Структура;
	ПараметрыМетодаПодключаемогоМодуля.Вставить("ТипМетода", ТипМетода);
	ПараметрыМетодаПодключаемогоМодуля.Вставить("ИмяМетода",  ИмяМетода);
	ПараметрыМетодаПодключаемогоМодуля.Вставить("ПараметрыМетода", ПараметрыМетода);
	
	Возврат ВыполнитьМетодМодуляОбъекта("Функция", "ВыполнитьМетодПодключаемогоМодуля", ПараметрыМетодаПодключаемогоМодуля);
			
КонецФункции

// За эту функцию спасибо ребятам, которые пишут библиотеку xUnitFor1C
// https://github.com/xDrivenDevelopment/xUnitFor1C
//
// Универсальная функция для проверки наличия 
// свойств у значения любого типа данных
// Переменные:
// 1. Переменная - переменная любого типа, 
// для которой необходимо проверить наличие свойства
// 2. ИмяСвойства - переменная типа "Строка", 
// содержащая искомое свойства
// 
&НаКлиенте
Функция ПеременнаяСодержитСвойство(Переменная, ИмяСвойства, Свойство = Неопределено, СвойствоЗаполнено = Ложь) Экспорт
	
	GUIDПроверка = Новый УникальныйИдентификатор;
	
	СтруктураПроверка = Новый Структура;
	СтруктураПроверка.Вставить(ИмяСвойства, GUIDПроверка);
	
	ЗаполнитьЗначенияСвойств(СтруктураПроверка, Переменная);
	
	Если СтруктураПроверка[ИмяСвойства] = GUIDПроверка Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Свойство = Переменная[ИмяСвойства];
		
		Если СвойствоЗаполнено = Истина Тогда
			
			Возврат ЗначениеЗаполнено(Свойство);
				
		Иначе
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;		
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеСоответствуетТипу(Значение, СтрокаТип)
	
	//Метод присутствует в клиентском и серверном модулях
	
	Возврат ТипЗнч(Значение) = Тип(СтрокаТип);
	 	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПримитивныйТип_КонтурEDI(Значение) 

	ТипЗначения				= ТипЗнч(Значение);
	МассивПримитивныхТипов	= ПолучитьМассивПримитивныхТипов_КонтурEDI();  
	
	Возврат  МассивПримитивныхТипов.Найти(ТипЗначения) <> Неопределено;

КонецФункции // ПолучитьМассивПримитивныхТипов_КонтурEDI()


&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьМассивПримитивныхТипов_КонтурEDI() 

	МассивПримитивныхТипов = Новый Массив;
	МассивПримитивныхТипов.Добавить(Тип("Число"));
	МассивПримитивныхТипов.Добавить(Тип("Строка"));
    МассивПримитивныхТипов.Добавить(Тип("Булево"));
    МассивПримитивныхТипов.Добавить(Тип("Дата")); 
	
	Возврат МассивПримитивныхТипов;

КонецФункции // ПолучитьМассивПримитивныхТипов_КонтурEDI()

&НаСервереБезКонтекста 
Функция ПолучитьИмяМетаданных_КонтурEDI(Значение)
    Возврат Значение.Метаданные().ПолноеИмя();
КонецФункции

&НаКлиенте
Функция ОбъединитьСпискиЗначений(Знач СписокЗначений1, Знач СписокЗначений2) Экспорт
	
	СписокЗначений = Новый СписокЗначений;
	
	Для каждого Элемент Из СписокЗначений1 Цикл
		СписокЗначений.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Для каждого Элемент Из СписокЗначений2 Цикл
		СписокЗначений.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат СписокЗначений;	
	
КонецФункции

&НаКлиенте
Функция НайтиСтрокиВДеревеФормы(КоллекцияСтрокДереваФормы, Отбор, ВключаяПодчиненные = Ложь, МассивНайденныхСтрок = Неопределено) Экспорт
	
	Если МассивНайденныхСтрок = Неопределено Тогда
		МассивНайденныхСтрок = Новый Массив;
	КонецЕсли;
	
	Для каждого СтрокаДерева Из КоллекцияСтрокДереваФормы Цикл
		
		Если СтрокаДереваСоответствуетОтбору(СтрокаДерева, Отбор) Тогда
			МассивНайденныхСтрок.Добавить(СтрокаДерева);
		КонецЕсли;
		
		Если ВключаяПодчиненные Тогда
			
			НайтиСтрокиВДеревеФормы(СтрокаДерева.ПолучитьЭлементы(), Отбор, Истина, МассивНайденныхСтрок);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивНайденныхСтрок;
	
КонецФункции

&НаКлиенте
Функция СтрокаДереваСоответствуетОтбору(СтрокаДерева, Отбор)
	
	Для каждого ЭлементОтбора Из Отбор Цикл
		
		Если Не СтрокаДерева.Свойство(ЭлементОтбора.Ключ) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если Не СтрокаДерева[ЭлементОтбора.Ключ] = ЭлементОтбора.Значение Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// } ВСПОМОГАТЕЛЬНЫЕ

// Красивое представление даты {

&НаКлиенте
Функция ПолучитьНаименованиеДняНедели(Дата)
	
	НомерДняНедели = ДеньНедели(Дата);
	
	Если НомерДняНедели = 1 Тогда
		Возврат "понедельник";
	ИначеЕсли НомерДняНедели = 2 Тогда
		Возврат "вторник";
	ИначеЕсли НомерДняНедели = 3 Тогда
		Возврат "среда";
	ИначеЕсли НомерДняНедели = 4 Тогда
		Возврат "четверг";
	ИначеЕсли НомерДняНедели = 5 Тогда
		Возврат "пятница";
	ИначеЕсли НомерДняНедели = 6 Тогда
		Возврат "суббота";
	ИначеЕсли НомерДняНедели = 7 Тогда
		Возврат "воскресенье";
	КонецЕсли;
	
	Возврат "";
		
КонецФункции

&НаКлиенте
Функция ПолучитьТекстРазностиЧасовМинут(КоличествоСекунд)
	
	Часов = Цел(КоличествоСекунд/3600);
	Минут = Цел((КоличествоСекунд-Часов*3600)/60);
	
	Если Часов = 0 Тогда
		Если Минут = 0 Тогда
			Минут = 1;
		КонецЕсли;
		Возврат СокрЛП(Минут)+" мин.";
	Иначе
		Если Минут = 0 Тогда
			Возврат СокрЛП(Часов)+" час.";
		Иначе
			Возврат СокрЛП(Часов)+" час. "+СокрЛП(Минут)+" мин.";
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТекстРазностиДней(КоличествоДней)
	
	Стр = ЧислоПрописью(КоличествоДней,"НД = Ложь","день,дня,дней,м");
	
	Если Найти(Стр,"день") Тогда
		Стр = "день";
	ИначеЕсли Найти(Стр,"дней") Тогда	
		Стр = "дней";
	ИначеЕсли Найти(Стр,"дня") Тогда
		Стр = "дня";
	Иначе
		Стр = "дней";
	КонецЕсли;
	
	Возврат СокрЛП(КоличествоДней)+" "+Стр;
	
КонецФункции

&НаКлиенте
Функция ПолучитьПредставлениеДатыПоставки_КонтурEDI(ДатаПоставки) Экспорт

	Если НЕ ЗначениеЗаполнено(ДатаПоставки) Тогда
		Возврат "не указана";
	КонецЕсли;
	
	Если ДатаПоставки = НачалоДня(ДатаПоставки) Тогда
		ТекстДаты = Формат(ДатаПоставки,"ДФ=dd.MM.yyyy")+" г.";
	Иначе
		ТекстДаты = Формат(ДатаПоставки,"ДФ=dd.MM.yyyy") + " г. в " + Формат(ДатаПоставки,"ДФ=HH:mm");
	КонецЕсли;
	
	ИмяДняНедели = ПолучитьНаименованиеДняНедели(ДатаПоставки);
	
	ТекДата = ТекущаяДата();
	
	НачалоДатыПоставки	= НачалоДня(ДатаПоставки);
	НачалоТекущейДаты	= НачалоДня(ТекДата);
	
	ИмяРазности = "";
	
	Если НачалоДатыПоставки = НачалоТекущейДаты Тогда
		Если ДатаПоставки = НачалоДатыПоставки Тогда
			ИмяРазности = "сегодня";
		ИначеЕсли ДатаПоставки<ТекДата Тогда	
			ТекстРазности = ПолучитьТекстРазностиЧасовМинут(ТекДата-ДатаПоставки);
			ИмяРазности = "сегодня "+ТекстРазности + " назад";
		ИначеЕсли ДатаПоставки>ТекДата Тогда	
			ТекстРазности = ПолучитьТекстРазностиЧасовМинут(ДатаПоставки-ТекДата);
			ИмяРазности = "сегодня через "+ТекстРазности;
		Иначе
			ИмяРазности = "сейчас";
		КонецЕсли;
	ИначеЕсли НачалоДатыПоставки > НачалоТекущейДаты Тогда
		
		РазностьДат = Цел((НачалоДатыПоставки-НачалоТекущейДаты)/(3600*24));
		
		Если РазностьДат = 1 Тогда
			ИмяРазности = "завтра";
		ИначеЕсли РазностьДат = 2 Тогда
			ИмяРазности = "послезавтра";
		Иначе
			ИмяРазности = "через "+ПолучитьТекстРазностиДней(РазностьДат-1);
		КонецЕсли;                      
		
	Иначе
		
		РазностьДат = Цел((НачалоТекущейДаты-НачалоДатыПоставки)/(3600*24));
		
		Если РазностьДат = 1 Тогда
			ИмяРазности = "вчера";
		ИначеЕсли РазностьДат = 2 Тогда
			ИмяРазности = "позавчера";
		Иначе
			ИмяРазности = ПолучитьТекстРазностиДней(РазностьДат-1) + " назад";
		КонецЕсли;                      
		
	КонецЕсли;

	Возврат ТекстДаты+" ("+ИмяДняНедели+", "+ИмяРазности+")";
	
КонецФункции

// } Красивое представление даты

// РАБОТА С ФОРМАМИ И ССЫЛКАМИ {

&НаКлиенте
Функция ОткрытьФорму_КонтурEDI(ИмяФормы, 
								ПолныйПутьКФорме = Неопределено, 
								ПараметрыФормы = Неопределено, 
								ВладелецФормы = Неопределено, 
								ИмяОбработчика = Неопределено, 
								КонтекстОбработчика = Неопределено, 
								ПараметрыОбработчика = Неопределено, 
								РежимОткрытияОкна = Неопределено,
								Уникальность = Ложь, 
								Окно = Неопределено, 
								НавигационнаяСсылка = Неопределено) Экспорт
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	Если ТипЗнч(ПараметрыФормы) = Тип("Структура") Тогда
		ПараметрыФормы.Вставить("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
		ПараметрыФормы.Вставить("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	КонецЕсли;
	
	Если ПолныйПутьКФорме = Неопределено Тогда
		ПолныйПутьКФорме = ПараметрыКлиентСервер.ПутьКФормам;
	КонецЕсли;
	ПолноеИмяФормы = ПолныйПутьКФорме + ИмяФормы;
		
	Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда
		Результат = ОткрытьФормуАсинхронно(ПолноеИмяФормы, 
										ПараметрыФормы, 
										ВладелецФормы, 
										Уникальность, 
										Окно, 
										РежимОткрытияОкна, 
										НавигационнаяСсылка, 
										ИмяОбработчика, 
										КонтекстОбработчика, 
										ПараметрыОбработчика);
	Иначе
		Результат = Неопределено;								
		ОткрытьФормуСинхронно(ПолноеИмяФормы, 
							ПараметрыФормы,
							ВладелецФормы, 
							Уникальность, 
							Окно, 
							РежимОткрытияОкна,
							Результат);
		Если (ИмяОбработчика <> Неопределено) 
			И (КонтекстОбработчика <> Неопределено) Тогда 
			Выполнить("КонтекстОбработчика." + ИмяОбработчика + "(Результат, ПараметрыОбработчика);");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

&НаСервере
Функция ПолучитьАдресВХ_СкладыОстатков(Значение)
	
	ТЗСкладыОстатков = Новый ТаблицаЗначений;
	МодульОбъекта().ДобавитьКолонкиВТаблицуЗначений(ТЗСкладыОстатков, "СкладыОстатков"); 
	
	Если ЗначениеЗаполнено(Значение)
		И ТипЗнч(Значение) = Тип("СправочникСсылка.КонтурEDI_ДополнительныеСправочники") Тогда
		
		МассивСкладовОстатков = МодульОбъекта().ПолучитьСкладыОстатковПоСсылке(Значение);
		
		Для каждого СкладОстатков ИЗ МассивСкладовОстатков Цикл 
			
			НоваяСтрока = ТЗСкладыОстатков.Добавить();
			НоваяСтрока.СкладыОстатков = СкладОстатков;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТЗСкладыОстатков, Объект.ПараметрыКлиентСервер.IDОсновнойФормы);

КонецФункции

&НаКлиенте
Процедура РедактированиеСкладыОстатков(Значение, НаименованиеПартнера = "", ИмяОбработчика , Владелец) Экспорт
	
	АдресВХ = ПолучитьАдресВХ_СкладыОстатков(Значение);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначениеАдресВоВХ", АдресВХ);
	
	НастройкиФормы = Новый Структура;
	НастройкиФормы.Вставить("НадписьИнформация", "Укажите склады остатков");
	НастройкиФормы.Вставить("ТолькоПросмотр"   , Ложь);
	ПараметрыФормы.Вставить("НастройкиФормы",			НастройкиФормы);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Значение", Значение);
	ДополнительныеПараметры.Вставить("НаименованиеПартнера", НаименованиеПартнера);

	Состояние("Открываю форму просмотра");
	ОткрытьФорму_КонтурEDI("УниверсальнаяФормаРедактированияУправляемая2", , ПараметрыФормы, Владелец, ИмяОбработчика, Владелец, ДополнительныеПараметры);
	
КонецПроцедуры


&НаКлиенте
Функция ОткрытьФормуАсинхронно(ПолноеИмяФормы, 
								ПараметрыФормы, 
								ВладелецФормы, 
								Уникальность, 
								Окно, 
								РежимОткрытияОкна, 
								НавигационнаяСсылка, 
								ИмяОбработчика, 
								КонтекстОбработчика, 
								ПараметрыОбработчика)
	
	Если РежимОткрытияОкна = Неопределено Тогда
		РежимОткрытияОкна =	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
		
	ОписаниеОбработчика = Неопределено;
	Если (ИмяОбработчика <> Неопределено) 
		И (КонтекстОбработчика <> Неопределено) Тогда
		Выполнить("ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика)");
	КонецЕсли;
	
	Результат = Неопределено;
	Выполнить("Результат = ОткрытьФорму(ПолноеИмяФормы, ПараметрыФормы, ВладелецФормы, Уникальность, Окно, НавигационнаяСсылка, ОписаниеОбработчика, РежимОткрытияОкна)");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОткрытьФормуСинхронно(ПолноеИмяФормы, 
								ПараметрыФормы, 
								ВладелецФормы, 
								Уникальность, 
								Окно, 
								РежимОткрытияОкна,
								Результат = Неопределено)
	
	Форма = ПолучитьФорму(ПолноеИмяФормы, ПараметрыФормы, ВладелецФормы, Уникальность, Окно);
	Если РежимОткрытияОкна = РежимОткрытияОкнаФормы.Независимый Тогда
		Результат  = Форма;
		Форма.Открыть();
	Иначе
		Результат = Форма.ОткрытьМодально();
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

&НаКлиенте
Функция ПолучитьФорму_КонтурEDI(ИмяФормы,
								ПолныйПутьКФорме = Неопределено,
								ПараметрыФормы = Неопределено, 
								ВладелецФормы  = Неопределено, 
								Уникальность = Неопределено) Экспорт
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	Если ТипЗнч(ПараметрыФормы) = Тип("Структура") Тогда
		ПараметрыФормы.Вставить("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
		ПараметрыФормы.Вставить("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	КонецЕсли;
	
	Если ПолныйПутьКФорме = Неопределено Тогда
		ПолныйПутьКФорме = ПараметрыКлиентСервер.ПутьКФормам;
	КонецЕсли;
	ПолноеИмяФормы = ПолныйПутьКФорме + ИмяФормы;
	
	Возврат ПолучитьФорму(ПолноеИмяФормы,
							ПараметрыФормы,
							ВладелецФормы,
							Уникальность);
	
КонецФункции
						
&НаКлиенте
Процедура ОткрытьФормуЗначения_КонтурEDI(Значение, ИмяОбработчика = "", КонтекстОбработчика = Неопределено, ПараметрыОбработчика = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЭтоПримитивныйТип_КонтурEDI(Значение) Тогда
		Алгоритм = "";
		Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда
			Если  НЕ ИмяОбработчика = "" Тогда
				Алгоритм = Алгоритм + "ОписаниеОповещения = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика,ПараметрыОбработчика);" + Символы.ПС;
			Иначе
				Алгоритм = Алгоритм + "ОписаниеОповещения = Неопределено;" + Символы.ПС;
			КонецЕсли; 			
			Алгоритм = Алгоритм + "ПоказатьЗначение(ОписаниеОповещения,Значение);"; 
		Иначе
			Алгоритм = "ОткрытьЗначение(Значение);" + Символы.ПС;
			Если  НЕ ИмяОбработчика = ""  Тогда 			
				Алгоритм = Алгоритм + "КонтекстОбработчика." + ИмяОбработчика + "(ПараметрыОбработчика);";
			КонецЕсли; 			
		КонецЕсли;
		Выполнить(Алгоритм);
	Иначе
		ИмяФормыДляОткрытия = "" +ПолучитьИмяМетаданных_КонтурEDI(Значение);
		ПараметрыФормы = Новый Структура("Ключ", Значение); 
		ОткрытьФорму_КонтурEDI(".ФормаОбъекта", ИмяФормыДляОткрытия,ПараметрыФормы,,ИмяОбработчика ,КонтекстОбработчика, ПараметрыОбработчика);  		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПроверкиПароляУчетнойЗаписи(УчетнаяЗапись = Неопределено,
												ИспользоватьУниверсальныйПароль = Ложь, 
												ИмяОбработчика = "", 
												КонтекстОбработчика = Неопределено, 
												ПараметрыОбработчика = Неопределено) Экспорт
												
	ЛогинПарольУчетнойЗаписи = ЛогинПарольУчетнойЗаписи(УчетнаяЗапись);
												
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Логин", ЛогинПарольУчетнойЗаписи.Логин);
	ПараметрыФормы.Вставить("ТекущийПароль", ЛогинПарольУчетнойЗаписи.Пароль);
	ПараметрыФормы.Вставить("ИспользоватьУниверсальныйПароль", ИспользоватьУниверсальныйПароль);
	
	ОткрытьФорму_КонтурEDI("ПроверкаПароляУчетнойЗаписиУправляемая",,ПараметрыФормы,ЭтаФорма,ИмяОбработчика,КонтекстОбработчика,ПараметрыОбработчика);
	
КонецПроцедуры

&НаСервере
Функция ЛогинПарольУчетнойЗаписи(УчетнаяЗапись)
	
	ЛогинПароль = Новый Структура("Логин,Пароль");
	
	Если УчетнаяЗапись = Неопределено Тогда
		УчетнаяЗапись =  МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Неопределено, "УчетнаяЗаписьПоУмолчанию");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат ЛогинПароль;
	КонецЕсли;
	
	СвойстваУчетнойЗаписи = МодульОбъекта().ПолучитьЭлементСправочника("УчетныеЗаписи",УчетнаяЗапись);
	
	ЛогинПароль.Логин = СвойстваУчетнойЗаписи.Логин;
	ЛогинПароль.Пароль = СвойстваУчетнойЗаписи.Пароль;
	
	Возврат ЛогинПароль;
	
КонецФункции

&НаКлиенте
Функция ИмяФормыСообщенияКонтурEDI(ТипСообщения) Экспорт
	
	СоответствиеФормСообщениям = Кэш_Прочитать("СоответствиеФормСообщениям");
	
	Если СоответствиеФормСообщениям = Неопределено Тогда
		
		СоответствиеФормСообщениям = Новый Соответствие;
		
		СоответствиеФормСообщениям.Вставить("PRICELIST", "ФормаНезависимогоСообщенияУправляемая");
		СоответствиеФормСообщениям.Вставить("PRICAT",	 "ФормаНезависимогоСообщенияУправляемая");
		СоответствиеФормСообщениям.Вставить("SLSRPT",	 "ФормаНезависимогоСообщенияУправляемая");
		СоответствиеФормСообщениям.Вставить("IFTMBF",	 "ФормаСообщенияПеревозкиУправляемая");
		СоответствиеФормСообщениям.Вставить("IFTMBC",	 "ФормаСообщенияПеревозкиУправляемая");
		СоответствиеФормСообщениям.Вставить("DELFOR",	 "ФормаСообщенияDELFORУправляемая");
		СоответствиеФормСообщениям.Вставить("INVRPT",	 "ФормаСообщенияINVRPTУправляемая");
		
		Кэш_Поместить("СоответствиеФормСообщениям", СоответствиеФормСообщениям);
		
	КонецЕсли;
	
	ИмяФормыСообщения = СоответствиеФормСообщениям.Получить(ВРег(ТипСообщения));
	
	Если ИмяФормыСообщения = Неопределено Тогда
		ИмяФормыСообщения = "ФормаСообщенияУправляемая";      
	КонецЕсли;

	Возврат ИмяФормыСообщения;
	
КонецФункции

&НаКлиенте
Функция ВыделенныеСтрокиТаблицыФормы_КонтурEDI(ТаблицаФормы) Экспорт
	
	Если Объект.ПараметрыКлиентСервер.ТекущийВариантИнтерфейса = "Версия8_5" Тогда
		ВыделенныеСтрокиТаблицыФормыКонтурEDI = Вычислить("ТаблицаФормы.ПолучитьСтрокиДляОбработки()");			
	Иначе
		ВыделенныеСтрокиТаблицыФормыКонтурEDI = ТаблицаФормы.ВыделенныеСтроки;
	КонецЕсли;
	
	Возврат ВыделенныеСтрокиТаблицыФормыКонтурEDI;
	
КонецФункции

// } РАБОТА С ФОРМАМИ И ССЫЛКАМИ 

&НаКлиенте
Процедура Метрика_ОбновлениеМодуля(КонтекстОбновленияМодуля, ТекстОшибки = "", ТипОбновления = "Полуавтоматически") Экспорт
	
	// Метод присутствует в клиентском и серверном модулях
	
	НоваяМетрика = НоваяМетрика();
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		НоваяМетрика = НоваяМетрика.Ошибка("АвтообновлениеМодуля", ТекстОшибки);
	Иначе
		НоваяМетрика = НоваяМетрика.Информация("АвтообновлениеМодуля", "");
	КонецЕсли;
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("НоваяВерсия"	, КонтекстОбновленияМодуля.НоваяВерсия);
	Переменные.Вставить("СтараяВерсия"	, КонтекстОбновленияМодуля.Версия);
	Переменные.Вставить("ТипОбновления" , ТипОбновления);
	
	Для Каждого КлючЗначение Из КонтекстОбновленияМодуля Цикл
		
		Переменные.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		
	КонецЦикла;
	
	НоваяМетрика.ДобавитьПеременные(Метрика_ИзвлечьИзВХ("КонтекстМодуля"));
	
	Для Каждого Переменная Из Переменные Цикл
		НоваяМетрика = НоваяМетрика.ДобавитьПеременную(Переменная.Ключ, Переменная.Значение);
	КонецЦикла;                      
	
	НоваяМетрика.Отправить();
	
КонецПроцедуры

// РАБОТА С ФАЙЛАМИ {

&НаКлиенте
Процедура ОткрытьДиалогВыбораФайла_КонтурEDI(ИмяОбработчика,
												КонтекстОбработчика,
												ПараметрыОбработчика = Неопределено,
												МножественныйВыбор = Ложь,
												Фильтр = Неопределено, 
												Заголовок = Неопределено, 
												РежимДиалога = Неопределено, 
												ПолучаемыеФайлы = Неопределено)  Экспорт
	
	Если РежимДиалога = Неопределено Тогда
		РежимДиалога = РежимДиалогаВыбораФайла.Открытие;
	КонецЕсли;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	
	ДиалогОткрытияФайла.МножественныйВыбор    = МножественныйВыбор;
	ДиалогОткрытияФайла.Фильтр                = Фильтр; 
	ДиалогОткрытияФайла.Заголовок             = Заголовок;
	
	Если ТипЗнч(ПараметрыОбработчика) = Тип("Структура") Тогда
		ПараметрыОбработчика.Вставить("ДиалогВыбораФайла", ДиалогОткрытияФайла);
	Иначе
		ПараметрыОбработчика = Новый Структура("ДиалогВыбораФайла", ДиалогОткрытияФайла);
	КонецЕсли;
	
	ЭтоРежимПолученияФайлов = ПолучаемыеФайлы <> Неопределено И РежимДиалога <> РежимДиалогаВыбораФайла.Открытие;
	
	ИсполняемыеОператоры = Новый Структура;
	ИсполняемыеОператоры.Вставить("НачатьПолучениеФайлов"	, "НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, ДиалогОткрытияФайла, Истина);");
	ИсполняемыеОператоры.Вставить("НачатьПомещениеФайлов"	, "НачатьПомещениеФайлов(ОписаниеОповещения, ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);");
	
	Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда
		
		Алгоритм = "ОписаниеОповещения = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика);" + Символы.ПС;
		Алгоритм = Алгоритм + ?(ЭтоРежимПолученияФайлов, ИсполняемыеОператоры.НачатьПолучениеФайлов, ИсполняемыеОператоры.НачатьПомещениеФайлов);
		
	Иначе
		
		Если ЭтоРежимПолученияФайлов Тогда
			ПолучитьФайлы(ПолучаемыеФайлы,, ДиалогОткрытияФайла, Истина);
		Иначе
			
			ПолучаемыеФайлы = Новый Массив;
			
			Если ДиалогОткрытияФайла.Выбрать() Тогда
				ОбработатьРезультатВыбораФайла(ПолучаемыеФайлы, ДиалогОткрытияФайла.ВыбранныеФайлы);
			КонецЕсли;
			
		КонецЕсли;
		
		Алгоритм = "КонтекстОбработчика." + ИмяОбработчика + "(ПолучаемыеФайлы, ПараметрыОбработчика);";
		
	КонецЕсли;
	
	Выполнить(Алгоритм);

КонецПроцедуры // ОткрытьДиалогВыбораФайла_КонтурEDI()

&НаКлиенте
Процедура ОбработатьРезультатВыбораФайла(ПолучаемыеФайлы, РезультатВыбораФайла)
	
	Для каждого ПутьКВыбранномуФайлу Из РезультатВыбораФайла Цикл
		
		ДвоичныеДанные				= Новый ДвоичныеДанные(ПутьКВыбранномуФайлу);
		АдресВоВременномХранилище	= ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(ПутьКВыбранномуФайлу, АдресВоВременномХранилище);
		
		ПолучаемыеФайлы.Добавить(ОписаниеФайла);
		
	КонецЦикла;
	
КонецПроцедуры

//Для получения пути выбранного файла без помещения во временное хранилище
&НаКлиенте
Процедура ВыбратьФайл_КонтурEDI(ИмяОбработчика,
								КонтекстОбработчика,
								РежимДиалога,
								Заголовок = "",
								НачальноеИмя = "",
								Фильтр = Неопределено,
								МножественныйВыбор = Ложь,
								Расширение = "",
								ДопПараметры = Неопределено) Экспорт
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.ПолноеИмяФайла = НачальноеИмя;
	ДиалогВыбораФайла.Заголовок = Заголовок;
	ДиалогВыбораФайла.Фильтр = Фильтр;
	ДиалогВыбораФайла.МножественныйВыбор = МножественныйВыбор;
	ДиалогВыбораФайла.Расширение = Расширение;
	
	Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда
		Алгоритм = "ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения(""" + ИмяОбработчика + """, КонтекстОбработчика, ДопПараметры))";
		Выполнить(Алгоритм);
	Иначе
		Если ДиалогВыбораФайла.Выбрать() Тогда	
			Алгоритм = "КонтекстОбработчика." + ИмяОбработчика + "(ДиалогВыбораФайла.ПолноеИмяФайла, ДопПараметры)";
			Выполнить(Алгоритм);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ВернутьКаталогВыбранногоФайл_КонтурEDI(Знач ИмяФайла)  Экспорт

    Каталог = "";
    
    ПутьКФайлуРазложенныйВМассив = EDI_РазложитьСтрокуВМассивСлов(ИмяФайла, "\");
    
    КоличествоЧастейПути = ПутьКФайлуРазложенныйВМассив.Количество();
    
    Если КоличествоЧастейПути > 0 Тогда 
        
        ИндексПоследнейЧасти = КоличествоЧастейПути-1;
        
        ПутьКФайлуРазложенныйВМассив.Удалить(ИндексПоследнейЧасти); 
        
        Для каждого ЧастьПути Из ПутьКФайлуРазложенныйВМассив Цикл
            Каталог = Каталог + ЧастьПути+"\";
        КонецЦикла;
    КонецЕсли;
    
    Возврат Каталог ;
     
КонецФункции // ВернутьКаталогВыбранногоФайл_КонтурEDI()

&НаКлиенте
Процедура ФайлСуществует_КонтурEDI(ИмяОбработчика,КонтекстОбработчика,Знач ПутьКФайлу,ПараметрыОбработчика = Неопределено) Экспорт
    
    Файл = Новый Файл(ПутьКФайлу);
    Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда
        Алгоритм =                 "ОписаниеОповещения = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика,ПараметрыОбработчика);" + Символы.ПС;
        Алгоритм = Алгоритм +     "Файл.НачатьПроверкуСуществования(ОписаниеОповещения);"; 
    Иначе         
        Алгоритм = "КонтекстОбработчика." + ИмяОбработчика + "(Файл.Существует(), ПараметрыОбработчика);";
    КонецЕсли;
    
    Выполнить(Алгоритм);
    
КонецПроцедуры  

 // } РАБОТА С ФАЙЛАМИ

// ВЗАИМОДЕЙСТВИЕ С ПОЛЬЗОВАТЕЛЕМ {

&НаКлиенте
Процедура ОткрытьИнструкциюКлиент(Команда, Форма, АдресСтраницы) Экспорт
	
	КонтекстКлиентМетрика = НоваяМетрика().НажатаКнопка(Команда).НаФорме(Форма);	
	                                                        
	РезультатОткрытия = Новый Структура();
	РезультатОткрытия.Вставить("БраузерОткрылся" , Ложь);
	РезультатОткрытия.Вставить("ТекстОшибки"	 , "");
	
	ПерейтиНаСтраницуСайта(АдресСтраницы, РезультатОткрытия);
	
	КонтекстКлиентМетрика.ДобавитьПеременную("ИнструкцияОткрытаВБраузере"	, РезультатОткрытия.БраузерОткрылся);
	
	Если Не РезультатОткрытия.БраузерОткрылся Тогда
		КонтекстКлиентМетрика.ДобавитьПеременную("ОшибкаОткрытияБраузера"	, РезультатОткрытия.ТекстОшибки);
	КонецЕсли;
	
	КонтекстКлиентМетрика.ПоместитьВОчередь();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуСайта(АдресСтраницы, РезультатОткрытия) Экспорт
	
	Попытка
		
		ПерейтиПоНавигационнойСсылке(АдресСтраницы);
		РезультатОткрытия.БраузерОткрылся = Истина;
		
	Исключение
		
		Попытка
			
			КодВозврата = Неопределено;
			ЗапуститьПриложение(АдресСтраницы,, Истина, КодВозврата);
			РезультатОткрытия.БраузерОткрылся = КодВозврата <> Неопределено;
			
		Исключение
			
			РезультатОткрытия.БраузерОткрылся = Ложь;
			РезультатОткрытия.ТекстОшибки = ОписаниеОшибки();
			
		КонецПопытки;		
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПриложение_КонтурEDI(СтрокаЗапускаПриложения, 
									ИмяОбработчика = "",
									КонтекстОбработчика = Неопределено,
									ТекущийКаталог = "",
									ДождатьсяЗавершения = Ложь,
									КодВозврата = Неопределено,
									ДопПараметры  = Неопределено) Экспорт
	
	#Если ВебКлиент Тогда
		
		ОписаниеОповещенияОЗавершении = Вычислить("Новый ОписаниеОповещения(""" + ИмяОбработчика + """, КонтекстОбработчика, ДопПараметры)");
		НачатьЗапускПриложения(ОписаниеОповещенияОЗавершении, СтрокаЗапускаПриложения, ТекущийКаталог, ДождатьсяЗавершения);
		
	#Иначе
		
		Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда
			
			ОписаниеОповещенияОЗавершении = Вычислить("Новый ОписаниеОповещения(""" + ИмяОбработчика + """, КонтекстОбработчика, ДопПараметры)");
			Выполнить("НачатьЗапускПриложения(ОписаниеОповещенияОЗавершении, СтрокаЗапускаПриложения, ТекущийКаталог, ДождатьсяЗавершения)");
			
		Иначе
			
			ЗапуститьПриложение(СтрокаЗапускаПриложения, ТекущийКаталог, ДождатьсяЗавершения, КодВозврата);
			
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопрос_КонтурEDI(ИмяОбработчика,
									КонтекстОбработчика,
									ПараметрыОбработчика = Неопределено,
									ТекстВопроса,
									Кнопки,
									Таймаут = 0,
									КнопкаПоУмолчанию = Неопределено,
									Заголовок = "Контур.EDI",
									КнопкаТаймаута = Неопределено) Экспорт
	
	Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда
		
		ОписаниеОбработчика = Неопределено;
		Выполнить("ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика)");
		Выполнить("ПоказатьВопрос(ОписаниеОбработчика, ТекстВопроса, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок, КнопкаТаймаута)");
		
	Иначе
		РезультатВопроса = Вопрос(ТекстВопроса, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок, КнопкаТаймаута);
		Выполнить("КонтекстОбработчика." + ИмяОбработчика + "(РезультатВопроса, ПараметрыОбработчика);");
	КонецЕсли; 	

КонецПроцедуры

&НаКлиенте
Процедура СообщениеПользователю_КонтурEDI(Текст, ИдентификаторНазначения = Неопределено) Экспорт

	СП = Новый СообщениеПользователю;
	
	Если ИдентификаторНазначения = Неопределено Тогда
		ИдентификаторНазначения = Новый УникальныйИдентификатор(ПараметрыКлиентСервер.IDОсновнойФормы);
	КонецЕсли;
	
	СП.ИдентификаторНазначения = ИдентификаторНазначения;
	СП.Текст = Текст;
	СП.Сообщить();
		
КонецПроцедуры

&НаКлиенте
Процедура Предупреждение_КонтурEDI(ТекстПредупреждения,
									Таймаут = 0, 
									Заголовок = "Контур.EDI",
									ИмяОбработчика = Неопределено, 
									КонтекстОбработчика = Неопределено, 
									ПараметрыОбработчика = Неопределено) Экспорт

	Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда 
		
		ОписаниеОбработчика = Неопределено;
		Если НЕ ИмяОбработчика = Неопределено 
			И НЕ КонтекстОбработчика = Неопределено Тогда
			Выполнить("ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика)");
		КонецЕсли;
		Выполнить("ПоказатьПредупреждение(ОписаниеОбработчика, ТекстПредупреждения, Таймаут, Заголовок)");
		
	Иначе
		Предупреждение(ТекстПредупреждения, Таймаут, Заголовок);
		Если НЕ ИмяОбработчика = Неопределено 
			И НЕ КонтекстОбработчика = Неопределено Тогда
			Выполнить("КонтекстОбработчика." + ИмяОбработчика + "(ПараметрыОбработчика);");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // Предупреждение_КонтурEDI()

&НаКлиенте
Процедура ВыбратьИзСписка_КонтурEDI(ИмяОбработчика, 
									КонтекстОбработчика, 
									ПараметрыОбработчика = Неопределено, 
									СписокЗначений, 
									Элемент = Неопределено, 
									НачальноеЗначение = Неопределено) Экспорт
									
	Если ПараметрыОбработчика = Неопределено Тогда
		ПараметрыОбработчика = Новый Структура;
	КонецЕсли;
	Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда 
		ОписаниеОбработчика = Неопределено;
		Если (ИмяОбработчика <> Неопределено) 
			И (КонтекстОбработчика <> Неопределено) Тогда
			Выполнить("ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика)");
		КонецЕсли;
		Выполнить("КонтекстОбработчика.ПоказатьВыборИзСписка(ОписаниеОбработчика, СписокЗначений, Элемент, НачальноеЗначение)");
	Иначе
		Результат = КонтекстОбработчика.ВыбратьИзСписка(СписокЗначений, Элемент, НачальноеЗначение);
		Выполнить("КонтекстОбработчика." + ИмяОбработчика + "(Результат, ПараметрыОбработчика);");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВыборЭлемента_КонтурEDI(ИмяОбработчика, 
									КонтекстОбработчика, 
									ПараметрыОбработчика = Неопределено, 
									СписокЗначений, 
									Элемент = Неопределено, 
									Заголовок = Неопределено) Экспорт
									
	Если ПараметрыОбработчика = Неопределено Тогда
		ПараметрыОбработчика = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда 
		
		ОписаниеОбработчика = Неопределено;
		
		Если (ИмяОбработчика <> Неопределено) 
			И (КонтекстОбработчика <> Неопределено) Тогда
			
			Выполнить("ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика)");
			
		КонецЕсли;
		
		Выполнить("СписокЗначений.ПоказатьВыборЭлемента(ОписаниеОбработчика, Заголовок, Элемент)");
		
	Иначе
		
		Результат = СписокЗначений.ВыбратьЭлемент(Заголовок, Элемент);
		Выполнить("КонтекстОбработчика." + ИмяОбработчика + "(Результат, ПараметрыОбработчика);");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзМеню_КонтурEDI(ИмяОбработчика, 
									КонтекстОбработчика,
									ПараметрыОбработчика = Неопределено, 
									СписокЗначений, 
									Элемент = Неопределено) Экспорт
	
	Если ПараметрыОбработчика = Неопределено Тогда
		ПараметрыОбработчика = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда 
		ОписаниеОбработчика = Неопределено;
		Если (ИмяОбработчика <> Неопределено) 
			И (КонтекстОбработчика <> Неопределено) Тогда
			Выполнить("ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика)");
		КонецЕсли;
		Выполнить("КонтекстОбработчика.ПоказатьВыборИзМеню(ОписаниеОбработчика, СписокЗначений, Элемент)"); 
	Иначе
		Результат = КонтекстОбработчика.ВыбратьИзМеню(СписокЗначений, Элемент);
		Выполнить("КонтекстОбработчика." + ИмяОбработчика + "(Результат, ПараметрыОбработчика);");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВводДаты_КонтурEDI(ИмяОбработчика, 
										КонтекстОбработчика,
										ПараметрыОбработчика = Неопределено, 
										Дата = Неопределено, 
										Подсказка = "",
										ЧастьДаты = Неопределено) Экспорт
									
	Если ПараметрыОбработчика = Неопределено Тогда
		ПараметрыОбработчика = Новый Структура;
	КонецЕсли;
	
	Если ЧастьДаты = Неопределено Тогда
		ЧастьДаты = ЧастиДаты.ДатаВремя;
	КонецЕсли;
	
	Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда 
		ОписаниеОбработчика = Неопределено;
		Если (ИмяОбработчика <> Неопределено) 
			И (КонтекстОбработчика <> Неопределено) Тогда
			Выполнить("ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика)");
		КонецЕсли;
		Выполнить("ПоказатьВводДаты(ОписаниеОбработчика, Дата, Подсказка, ЧастьДаты)"); 
	Иначе
		ВвестиДату(Дата, Подсказка, ЧастьДаты);
		Выполнить("КонтекстОбработчика." + ИмяОбработчика + "(Дата, ПараметрыОбработчика);");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВводЧисла_КонтурEDI(ИмяОбработчика, 
										КонтекстОбработчика,
										ПараметрыОбработчика = Неопределено, 
										Число = 0, 
										Подсказка = "",
										Длина = 0,
										Точность = 0) Экспорт
									
	Если ПараметрыОбработчика = Неопределено Тогда
		ПараметрыОбработчика = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда 
		ОписаниеОбработчика = Неопределено;
		Если (ИмяОбработчика <> Неопределено) 
			И (КонтекстОбработчика <> Неопределено) Тогда
			Выполнить("ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика)");
		КонецЕсли;
		Выполнить("ПоказатьВводЧисла(ОписаниеОбработчика, Число, Подсказка, Длина, Точность)"); 
	Иначе
		ВвестиЧисло(Число, Подсказка, Длина, Точность);
		Выполнить("КонтекстОбработчика." + ИмяОбработчика + "(Число, ПараметрыОбработчика);");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВводСтроки_КонтурEDI(ИмяОбработчика, 
										КонтекстОбработчика,
										ПараметрыОбработчика = Неопределено, 
										Строка = "", 
										Подсказка = "",
										Длина = 0,
										Многострочность = Ложь) Экспорт
									
	Если ПараметрыОбработчика = Неопределено Тогда
		ПараметрыОбработчика = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда 
		ОписаниеОбработчика = Неопределено;
		Если (ИмяОбработчика <> Неопределено) 
			И (КонтекстОбработчика <> Неопределено) Тогда
			Выполнить("ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика)");
		КонецЕсли;
		Выполнить("ПоказатьВводСтроки (ОписаниеОбработчика, Строка, Подсказка, Длина, Многострочность)"); 
	Иначе
		ВвестиСтроку(Строка,Подсказка,Длина,Многострочность);		
		Выполнить("КонтекстОбработчика." + ИмяОбработчика + "(Строка, ПараметрыОбработчика);");
	КонецЕсли;
	
КонецПроцедуры

// } ВЗАИМОДЕЙСТВИЕ С ПОЛЬЗОВАТЕЛЕМ

// РАБОТА СО СПРАВОЧНИКАМИ KONTUR.EDI {

&НаКлиенте
Процедура ВыбратьЭлементСправочника_КонтурEDI(ИмяСправочника, 
												Владелец = Неопределено, 
												ВладелецФормы, 
												ИмяОбработчика, 
												КонтекстОбработчика) Экспорт
	
	Если ИмяСправочника = "ТочкаДоставкиСторонняя" Тогда
		
		АдресТаблицыВХранилище = ПоместитьТаблицуТочекДоставкиПартнераВВХСервер(Владелец);
		ПараметрыФормы = Новый Структура("АдресТаблицыВХранилище", АдресТаблицыВХранилище);
		ДополнительныеПараметры = Новый Структура("ИмяСправочника,ИмяОбработчика,КонтекстОбработчика", 
			ИмяСправочника, ИмяОбработчика, КонтекстОбработчика);
			
		ОткрытьФорму_КонтурEDI("УниверсальнаяФормаВыбораУправляемая", , 
			ПараметрыФормы, ВладелецФормы, "ОбработчикВыбораЭлементаСправочника", ЭтаФорма, ДополнительныеПараметры);
		
	Иначе
		
		ВызватьИсключение "Не реализовано.";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуТочекДоставкиПартнераВВХСервер(Партнер)
	
	ТаблицаТД = МодульОбъекта().ПолучитьСписокЭлементовСправочника("ТочкиДоставкиСторонние", Партнер);
	
	СписокКолонокДляКопирования = "Ссылка, GLN, АдресДоставки, ЮрФизЛицо, ТочкаДоставкиСвойСправочник, ТипЛокализации";
	ФильтрОбменаПоТочкамДоставки = МодульОбъекта().ПараметрыПользователяEDI.ФильтрОбменаПоТочкамДоставки;
	
	Если ФильтрОбменаПоТочкамДоставки = Истина Тогда
		СписокКолонокДляКопирования = СписокКолонокДляКопирования + ", ЗагружатьСообщения";
	КонецЕсли;
	
	ТаблицаТДКопия = ТаблицаТД.Скопировать(, СписокКолонокДляКопирования);
	АдресВоВХ = ПоместитьВоВременноеХранилище(ТаблицаТДКопия, Объект.ПараметрыКлиентСервер.IDОсновнойФормы);
	
	Возврат АдресВоВХ; 
	
КонецФункции

&НаКлиенте
Процедура ОбработчикВыбораЭлементаСправочника(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		
		ВыбранноеЗначениеСсылка = Неопределено;
		
	Иначе
		
		Если ДополнительныеПараметры.ИмяСправочника = "ТочкаДоставкиСторонняя" Тогда
			ВыбранноеЗначениеСсылка = ОбработчикВыбораТочкиТоставкиСтороннейСервер(ВыбранноеЗначение);
		КонецЕсли;
		
	КонецЕсли;
	
	КонтекстОбработчика = ДополнительныеПараметры.КонтекстОбработчика;
	ИмяОбработчика = ДополнительныеПараметры.ИмяОбработчика;
	ПараметрыОбработчика = Неопределено;
	
	Если ПараметрыКлиентСервер.МодальностьЗапрещена Тогда
		
		ОписаниеОбработчика = Неопределено;
		Выполнить("ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика);");
		Выполнить("ВыполнитьОбработкуОповещения(ОписаниеОбработчика, ВыбранноеЗначениеСсылка);");
		
	Иначе
		
		Выполнить("КонтекстОбработчика." + ИмяОбработчика + "(ВыбранноеЗначениеСсылка, ПараметрыОбработчика);");
	
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбработчикВыбораТочкиТоставкиСтороннейСервер(АдресВоВХ)
	
	ТабРезультат = ПолучитьИзВременногоХранилища(АдресВоВХ);
	НайденнаяСтрока = ТабРезультат.Найти(Истина, "Выбор");
	
	Возврат НайденнаяСтрока.Ссылка;
	
КонецФункции

// } РАБОТА СО СПРАВОЧНИКАМИ KONTUR.EDI

// ОБРАБОТКА СЕРВЕРНЫХ ВЫЗОВОВ {

&НаКлиенте
Процедура ЗаписьЖурналаРегистрацииНаКлиенте_КонтурEDI(УровеньСобытияКлиент, Комментарий, Данные = Неопределено) Экспорт
	
	Если НЕ Объект.ПараметрыКлиентСервер.ЗаписыватьОшибкиВЖурналРегистрации Тогда 
		
		Возврат;
		
	КонецЕсли;

	ЗаписьЖурналаРегистрацииНаСервере(УровеньСобытияКлиент, Комментарий, Данные); 

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписьЖурналаРегистрацииНаСервере(УровеньСобытияКлиент, Комментарий, Данные = Неопределено)
	
	Если УровеньСобытияКлиент = "Информация" Тогда
		УровеньСобытия = УровеньЖурналаРегистрации.Информация;
	ИначеЕсли УровеньСобытияКлиент = "Ошибка" Тогда
		УровеньСобытия = УровеньЖурналаРегистрации.Ошибка;
	ИначеЕсли УровеньСобытияКлиент = "Предупреждение" Тогда
		УровеньСобытия = УровеньЖурналаРегистрации.Предупреждение;
	Иначе
		УровеньСобытия = УровеньЖурналаРегистрации.Примечание;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Контур.EDI", УровеньСобытия, , Данные, Комментарий); 

КонецПроцедуры

&НаКлиенте
Процедура xmlОбработатьЭкранируемыеСимволы(СтрокаXML) Экспорт
	
	xmlОбработатьЭкранируемыеСимволыНаСервере(СтрокаXML);
	
КонецПроцедуры

&НаСервере
Процедура xmlОбработатьЭкранируемыеСимволыНаСервере(СтрокаXML)
	
	МодульОбъекта().xmlОбработатьЭкранируемыеСимволы(СтрокаXML);
	
КонецПроцедуры	

// } ОБРАБОТКА СЕРВЕРНЫХ ВЫЗОВОВ

// ОБРАБОТКА ОСОБЕННОСТЕй {

&НаКлиенте
Функция МассивИменТиповСложныхОбъектовКлиент() Экспорт

	МассивТипов = Новый Массив;
	МассивТипов.Добавить("Структура");	
	МассивТипов.Добавить("Соответствие");	
	МассивТипов.Добавить("Массив");	
	МассивТипов.Добавить("СписокЗначений");	
	МассивТипов.Добавить("ТаблицаЗначений");	
	МассивТипов.Добавить("ДеревоЗначений");	
	
	Возврат МассивТипов;
	
КонецФункции

&НаКлиенте
Процедура ОсобенностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, Форма) Экспорт
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	Если ЭтоОсобенностьСложногоТипаКлиент(ТекущаяСтрока.ТипЗначения) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыОсобенности = Новый Структура;
		ПараметрыОсобенности.Вставить("Идентификатор",			ТекущаяСтрока.Идентификатор);
		ПараметрыОсобенности.Вставить("ИмяТаблицы",				ТекущаяСтрока.ИмяТаблицы);
		ПараметрыОсобенности.Вставить("ИмяСтруктуры",			ТекущаяСтрока.ИмяСтруктуры);
		ПараметрыОсобенности.Вставить("ЭтоСтруктура",			ТекущаяСтрока.ЭтоСтруктура);
		ПараметрыОсобенности.Вставить("ТипЗначения",			ТекущаяСтрока.ТипЗначения);
		ПараметрыОсобенности.Вставить("НеСохранятьВСообщение" , ТекущаяСтрока.НеСохранятьВСообщение);
		
		СтруктураАдресаВоВХ = ПоместитьКонтекстДляУниверсальнойФормыВоВХ(
		ПараметрыОсобенности, 
		Форма.Сообщение, 
		Форма.АдресВХПроизвольныеРеквизиты);
		
		Если СтруктураАдресаВоВХ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НастройкиФормы = Новый Структура;
		НастройкиФормы.Вставить("НадписьИнформация", ТекущаяСтрока.Наименование);
		НастройкиФормы.Вставить("ТолькоПросмотр"   , Форма.ТолькоПросмотрСообщения);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НастройкиФормы",			НастройкиФормы);
		ПараметрыФормы.Вставить("ИмяСтруктуры",				ТекущаяСтрока.ИмяСтруктуры);
		ПараметрыФормы.Вставить("ТаблицаМаппингаАдресВоВХ",	СтруктураАдресаВоВХ.ТаблицаМаппингаАдресВоВХ); 
		ПараметрыФормы.Вставить("СообщениеАдресВоВХ",		СтруктураАдресаВоВХ.СообщениеАдресВоВХ);
		ПараметрыФормы.Вставить("ЗначениеАдресВоВХ",		СтруктураАдресаВоВХ.ЗначениеАдресВоВХ);
		
		ОткрытьФорму_КонтурEDI(
		"УниверсальнаяФормаРедактированияУправляемая2",
		, 
		ПараметрыФормы, 
		Форма, 
		"ОбработчикПослеЗакрытияУниверсальнойФормыРедактирования2", 
		Форма, 
		ПараметрыОсобенности);
			
	ИначеЕсли НЕ Форма.ТолькоПросмотрСообщения
		И Поле.Имя = "ОсобенностиЗначение"
		И ЗначениеЗаполнено(ТекущаяСтрока.СписокВыбора) Тогда
		
		СписокДляВыбора = ТекущаяСтрока.СписокВыбора;
 		ВыбратьИзСписка_КонтурEDI("СписокЗначенийОсобенностиВыборЗавершение", Форма, , СписокДляВыбора, Элемент);
		
	Иначе
		СтандартнаяОбработка = Истина;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоОсобенностьСложногоТипаКлиент(ИмяТипа) Экспорт
	
	МассивИменТипов = МассивИменТиповСложныхОбъектовКлиент();
	ЭтоСложныйТип = НЕ МассивИменТипов.Найти(ИмяТипа) = Неопределено;
	
	Возврат ЭтоСложныйТип;	
	
КонецФункции 

&НаСервере
Функция ПоместитьКонтекстДляУниверсальнойФормыВоВХ(ПараметрыОсобенности, Сообщение, АдресВХПроизвольныеРеквизиты)
	
	МетаданныеСообщения = 
	МодульОбъекта().ПолучитьМетаданныеСообщения(Сообщение.ТипСообщения, Сообщение.Направление);

	
	СтруктураАдресаВоВХ = Неопределено;
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища(Сообщение, АдресВХПроизвольныеРеквизиты);
	

	ЗначениеОсобенности = Неопределено;
	ПолныйПутьОсобенности = МодульОбъекта().ПолучитьПолныйПутьОсобенностиСообщения(ПараметрыОсобенности);
	
	Если МодульОбъекта().ПроверитьСвойствоПоляВСтруктуре(Сообщение, ПолныйПутьОсобенности, ЗначениеОсобенности) Тогда
		
		ТаблицаМаппингаСтруктуры = МодульОбъекта().ПолучитьОписаниеРеквизитовДопСправочника_КонтурEDI(ПараметрыОсобенности.ИмяСтруктуры);
		
		Если НЕ ЗначениеЗаполнено(ТаблицаМаппингаСтруктуры) Тогда
 			ТаблицаМаппингаСтруктуры = МодульОбъекта().ПолучитьМетаданныеОсобенностиСообщения(ПараметрыОсобенности, МетаданныеСообщения);
		КонецЕсли;
			
		КопияСообщения = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(Сообщение));
		КопияОсобенности = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ЗначениеОсобенности));
		КопияТаблицыМаппинга = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ТаблицаМаппингаСтруктуры));
		
		СтруктураАдресаВоВХ = Новый Структура;
		СтруктураАдресаВоВХ.Вставить("ЗначениеАдресВоВХ", ПоместитьВоВременноеХранилище(КопияОсобенности, ЭтаФорма.УникальныйИдентификатор));
		СтруктураАдресаВоВХ.Вставить("СообщениеАдресВоВХ", ПоместитьВоВременноеХранилище(КопияСообщения, ЭтаФорма.УникальныйИдентификатор));
		СтруктураАдресаВоВХ.Вставить("ТаблицаМаппингаАдресВоВХ", ПоместитьВоВременноеХранилище(КопияТаблицыМаппинга, ЭтаФорма.УникальныйИдентификатор));
		
	КонецЕсли;
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов(Сообщение);

	Возврат СтруктураАдресаВоВХ;
	
КонецФункции 

&НаСервере
Процедура ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища(Сообщение, АдресВХПроизвольныеРеквизиты)

	СтруктураВременногоХранилища = ПолучитьИзВременногоХранилища(АдресВХПроизвольныеРеквизиты);
	Если СтруктураВременногоХранилища = Неопределено Тогда 
		ВызватьИсключение "Не удалось получить значение из временного хранилища. Откройте форму заново.";
	КонецЕсли;
	
	Если СтруктураВременногоХранилища.Свойство("Сообщение") И ТипЗнч(СтруктураВременногоХранилища.Сообщение) = Тип("Структура") Тогда
		Для Каждого ЭлементСтруктуры Из СтруктураВременногоХранилища.Сообщение Цикл
			Сообщение[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;									
		КонецЦикла;
	КонецЕсли;
			
КонецПроцедуры 

&НаСервере
Процедура УничтожитьТаблицыЗначенийПроизвольныхРеквизитов(Сообщение)

	Для Каждого ЭлементСтруктуры Из Сообщение Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Или ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ДеревоЗначений") Тогда
			Сообщение[ЭлементСтруктуры.Ключ] = Неопределено;	
		КонецЕсли;
	КонецЦикла;
	
	Если Сообщение.Свойство("Транспортировка") Тогда
		Сообщение.Транспортировка.ДатаВремяПрибытия = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// } ОБРАБОТКА ОСОБЕННОСТЕЙ

// ПРОВЕРКА СООБЩЕНИЙ {

Функция ЭтоТипПодписываемогоДДСообщения_Клиент(ТипСообщения) Экспорт
	
	ТипыСообщенийДД = Новый Массив;
	ТипыСообщенийДД.Добавить("INVOIC");
	ТипыСообщенийДД.Добавить("COINVOIC");
	ТипыСообщенийДД.Добавить("PRICAT");
	ТипыСообщенийДД.Добавить("PRICELIST");
	
	ТипСообщенияНайденВТипыСообщенийДД = (ТипыСообщенийДД.Найти(ТипСообщения) <> Неопределено);
	
	Возврат ТипСообщенияНайденВТипыСообщенийДД;	
	
КонецФункции  

// } ПРОВЕРКА СООБЩЕНИЙ  

//{{ Дополнительные модули

&НаКлиенте
Функция КонтурПлагин() Экспорт
	
	Возврат ДополнительныйМодуль("КонтурПлагин");

КонецФункции

&НаКлиенте
Функция ЦентрПоддержки() Экспорт
	
	ФормаКлиент = Кэш_Прочитать("Модуль_ЦентрПоддержки");
	
	Если ФормаКлиент <> Неопределено Тогда 
		
		Возврат ФормаКлиент;
		
	КонецЕсли;
	
	Модуль_ЦентрПоддержки = ДополнительныйМодуль("ЦентрПоддержки"); 
	Модуль_ЦентрПоддержки.Инит("edi-1C", ЭтаФорма, ЭтаФорма, ЭтоТестовыйAPI());
	
	Кэш_Поместить("Модуль_ЦентрПоддержки", ФормаКлиент);
	
	Возврат Модуль_ЦентрПоддержки;
	
КонецФункции

&НаСервере
Функция ЭтоТестовыйAPI()
	Возврат МодульОбъекта().ЭтоТестовыйAPI();
КонецФункции

&НаКлиенте
Функция ЦП_ЗаписатьJson(Значение) Экспорт 
	Возврат ЗаписатьJson_Сервер(Значение);	
КонецФункции

&НаКлиенте
Функция ЦП_ПрочитатьJson(Значение) Экспорт  
	Возврат ПрочитатьJson_Сервер(Значение);
КонецФункции

&НаСервере
Функция ЗаписатьJson_Сервер(Значение)
	Возврат МодульОбъекта().ЗаписатьJson_(Значение);
КонецФункции

&НаСервере
Функция ПрочитатьJson_Сервер(Значение)
	Возврат МодульОбъекта().DoParse(Значение);
КонецФункции

&НаКлиенте
Функция ЦП_ОтправитьЗапрос(Запрос) Экспорт
	Возврат ОтправитьЗапрос_Сервер(Запрос);
КонецФункции

&НаСервере
Функция ОтправитьЗапрос_Сервер(Запрос)
	Возврат МодульОбъекта().ЦП_ОтправитьЗапрос(Запрос);
КонецФункции  

// Скачивает новую версию файла модуля из сервиса обновлений
// и записывает его на диск или в справочник внешних обработок
//
// Параметры:
//  КонтекстОбновленияМодуля - Структура - см. функцию КонтекстОбновленияМодуля_КонтурEDI();
//
&НаКлиенте
Процедура ВыполнитьОбновлениеМодуля(КонтекстОбновленияМодуля, ТипОбновления = "Полуавтоматически") Экспорт
	
	// Метод присутствует в клиентском и серверном модулях
	
	РасположенияМодуля = ПеречисленияEDI_ВариантыРасположенияМодуля();
	ПутьКМодулю = КонтекстОбновленияМодуля.ПутьКМодулю;
	НоваяВерсия = КонтекстОбновленияМодуля.НоваяВерсия;	
	ТипКонтента = КонтекстОбновленияМодуля.ТипКонтента;	
	Расположение = КонтекстОбновленияМодуля.Расположение;
	
	Если Расположение = РасположенияМодуля.Файл Тогда
		
		ВыполнитьОбновлениеМодуляВФайлНаДиске(ПутьКМодулю, НоваяВерсия);
		
	ИначеЕсли Расположение = РасположенияМодуля.Справочник Тогда
		
		ВыполнитьОбновлениеМодуляВСправочнике(ПутьКМодулю, НоваяВерсия);
		
	ИначеЕсли Расположение = РасположенияМодуля.Расширение Тогда
		
		ВыполнитьОбновлениеМодуляВРасширении(НоваяВерсия, ТипКонтента);
		
	Иначе
		
		ТекстОшибки = ШаблонСтр(НСтр(
		"ru = 'Не удалось обновить модуль!
		|Некорректное расположение модуля: %1'"), Расположение);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	УстановитьПризнакМодульБылОбновленАвтоматически();	
	
	Метрика_ОбновлениеМодуля(КонтекстОбновленияМодуля,, ТипОбновления);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакМодульБылОбновленАвтоматически()
	МодульОбъекта().УстановитьПризнакМодульБылОбновленАвтоматически();
КонецПроцедуры

&НаСервере
Процедура СнятьПризнакМодульБылОбновленАвтоматически()
	МодульОбъекта().СнятьПризнакМодульБылОбновленАвтоматически();
КонецПроцедуры

// Получает новую версию модуля из сервиса обновлений
// и записывает его файл на диске
//
// Параметры:
//  ПутьКФайлу - Строка - путь к файлу на диске,
//               в который нужно записать новую версию модуля;
//  ОписаниеОбновления - Структура - см. функцию НовоеОписаниеОбновленияМодуля();
//
&НаКлиенте
Процедура ВыполнитьОбновлениеМодуляВФайлНаДиске(ПутьКФайлу, НоваяВерсия)
		
	ПараметрыМетода = Новый Структура("Версия", НоваяВерсия);
	
	ФайлНовойВерсии = ВыполнитьМетодМодуляОбъекта("Функция", "СкачатьКонтентВерсии_КонтурEDI", ПараметрыМетода).ДвоичныеДанные;
	
	ФайлНовойВерсии.Записать(ПутьКФайлу);
	
КонецПроцедуры

// Проверяет наличие файла модуля и возможность записи в его каталог
//
// Параметры:
//  ПутьКФайлу - Строка - путь к файлу модуля
// 
// Возвращаемое значение:
//  Строка - описание ошибки
//
&НаКлиенте
Функция ПроверитьВозможностьОбновленияФайлаМодуля(ПутьКФайлу) Экспорт
	
	// Метод присутствует в клиентском и серверном модулях
	
	ТекстОшибки = "";
	
	Файл = Новый Файл(ПутьКФайлу);
	Каталог	 = Файл.Путь;
	ИмяФайла = Файл.Имя;
	
	Если Файл.Существует() Тогда
		
		Попытка
			ПутьКТестовомуФайлу = Каталог + Новый УникальныйИдентификатор;
			СоздатьКаталог(ПутьКТестовомуФайлу);
			УдалитьФайлы(ПутьКТестовомуФайлу);
		Исключение
			Ошибка		 = ИнформацияОбОшибке();
			ТекстОшибки	 = НСтр("ru = 'Ошибка! Не удалось записать файл в каталог, где находится модуль. Возможно нет прав.'");
		КонецПопытки;
		
	Иначе
		ТекстОшибки = НСтр("ru = 'Ошибка! Не найден файл модуля.'");
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

// Проверяет возможность записи элемента справочника внешних обработок
// с правами текущего пользователя
//
// Параметры:
//  ВнешняяОбработка - СправочникСсылка - элемент в справочнике внешних обработок,
//                                        в котором хранится модуль;
// 
// Возвращаемое значение:
//  Строка - описание ошибки
//
&НаКлиенте
Функция ПроверитьВозможностьОбновленияЭлементаСправочникаМодуля(ВнешняяОбработка) Экспорт
	
	ПараметрыМетода = Новый Структура("ВнешняяОбработка", ВнешняяОбработка);
	ТекстОшибки = ВыполнитьМетодМодуляОбъекта("Функция", "ПроверитьВозможностьОбновленияЭлементаСправочникаМодуля", ПараметрыМетода);
	
	Возврат ТекстОшибки;
	
КонецФункции

&НаКлиенте
Функция ПроверитьВозможностьОбновленияРасширенияEDI(НоваяВерсия, ТипКонтента) Экспорт

	ПараметрыМетода = Новый Структура("Версия, ТипКонтента", НоваяВерсия, ТипКонтента);
	
	ТекстОшибки = ВыполнитьМетодМодуляОбъекта("Функция", "ПроверитьВозможностьОбновленияРасширенияEDI_КонтурEDI", ПараметрыМетода);
	
	Возврат ТекстОшибки;
	
КонецФункции

&НаКлиенте
Функция НовыйМассив(Знач1, Знач2 = "4bd67c947236e", Знач3 = "4bd67c947236e", Знач4 = "4bd67c947236e", Знач5 = "4bd67c947236e") Экспорт
	
	//Метод присутствует в клиентском и серверном модулях
	
	Результат = Новый Массив;
	
	Результат.Добавить(Знач1);
	
	ЗначениеПоУмолчанию = "4bd67c947236e";
	
	Если Знач2 <> ЗначениеПоУмолчанию Тогда
		Результат.Добавить(Знач2);		
	КонецЕсли;
	Если Знач3 <> ЗначениеПоУмолчанию Тогда
		Результат.Добавить(Знач3);		
	КонецЕсли;
	Если Знач4 <> ЗначениеПоУмолчанию Тогда
		Результат.Добавить(Знач4);		
	КонецЕсли;
	Если Знач5 <> ЗначениеПоУмолчанию Тогда
		Результат.Добавить(Знач5);		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВерсияПрограмногоПродуктаРавнаИлиВыше(СтрокаВерсии1, СтрокаВерсии2) Экспорт
	
	//Метод присутствует в клиентском и серверном модулях
	
	//СтрокаВерсии1 - версия программного продукта, СтрокаВерсии2 - эталонная версия
	
	Массив1 = EDI_РазложитьСтрокуВМассивСлов(СтрокаВерсии1, ".");
	Массив2 = EDI_РазложитьСтрокуВМассивСлов(СтрокаВерсии2, ".");
	
	МаксИндекс1 = Массив1.ВГраница();
	МаксИндекс2 = Массив2.ВГраница();
	МаксИндекс = Макс(МаксИндекс1, МаксИндекс2);
		
	Для К = 0 По МаксИндекс Цикл
		
		Строка1 = ?(К <= МаксИндекс1, Массив1[К], "0");
		Строка2 = ?(К <= МаксИндекс2, Массив2[К], "0");
		
		Длина1 = СтрДлина(Строка1);
		Длина2 = СтрДлина(Строка2);
				
		МодульРазницы = Макс(Длина1 - Длина2, Длина2 - Длина1);
		Для КК = 1 По МодульРазницы Цикл			
			Если Длина1 > Длина2 Тогда
				Строка2 = "0" + Строка2;
			Иначе
				Строка1 = "0" + Строка1;
			КонецЕсли;			
		КонецЦикла;
		
		Если Строка1 > Строка2 Тогда
			Возврат Истина;
		ИначеЕсли Строка1 < Строка2 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
		
КонецФункции

// Возвращает разделитель пути, используемого в операционной системе
// 
// Возвращаемое значение:
//  Строка
//
&НаКлиенте
Функция РазделительПути()
	
	// Метод присутствует в клиентском и серверном модулях
	
	СистемнаяИнформация	 = Новый СистемнаяИнформация;
	ВерсияПриложения	 = СистемнаяИнформация.ВерсияПриложения;
	ТипОС				 = СистемнаяИнформация.ТипПлатформы;
	
	Если ВерсияПрограмногоПродуктаРавнаИлиВыше(ВерсияПриложения, "8.3.3") Тогда
		
		Результат = Вычислить("ПолучитьРазделительПути()");
		
	Иначе
		
		ЭтоLinux = Найти(НРег(ТипОС), НРег("Linux")) > 0;
		
		Если ЭтоLinux Тогда
			Результат = "/";
		Иначе
			Результат = "\";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Объединяет части пути через разделитель
//
&НаКлиенте
Функция ОбъединитьПути(П1, П2, П3 = Неопределено, П4 = Неопределено)
	
	// Метод присутствует в клиентском и серверном модулях
	
	Результат = П1;
	
	РазделительПути = РазделительПути();
	
	ЧастиПути = НовыйМассив(П2, П3, П4);
	
	Для Каждого Элемент Из ЧастиПути Цикл
		
		Если Не ЗначениеЗаполнено(Элемент) Тогда
			Прервать;
		КонецЕсли;
		
		Если Прав(Результат, 1) <> РазделительПути Тогда
			Результат = Результат + РазделительПути;
		КонецЕсли;
		
		Результат = Результат + Элемент;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает уникальное имя файла
//
// Параметры:
//  Расширение - Строка - расширение файла
// 
// Возвращаемое значение:
//  Строка - уникальное имя файла
//
&НаКлиенте
Функция УникальноеИмяФайла(Расширение = Неопределено)
	
	// Метод присутствует в клиентском и серверном модулях
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	
	Файл = Новый Файл(ИмяВременногоФайла);
	
	Результат = Файл.Имя;
	
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5.
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон содержащий маркеры подстановки вида: "%1..%N"
//                        . Нумерация маркеров начинается с 1.
//                          N не может быть более 5.
//  Параметр<n>  - Строка - подставляемые параметры.
//
// Возвращаемое значение:
//   Строка - строка шаблона с подставленными параметрами.
//
&НаКлиенте
Функция ШаблонСтр(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено) Экспорт
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции

// Возвращает двоичные данные модуля
//
// Параметры:
//  РасположениеМодуля - Структура - см. функцию НовоеОписаниеРасположенияМодуля()
//
&НаКлиенте
Функция ДвоичныеДанныеТекущейОбработки(РасположениеМодуля) Экспорт
	
	ВнешняяОбработка = РасположениеМодуля.Ссылка;
	ПутьКФайлу		 = РасположениеМодуля.ПутьКФайлу;
	Местоположение	 = РасположениеМодуля.Местоположение;
	
	РасположенияМодуля = ПеречисленияEDI_ВариантыРасположенияМодуля();
	
	ДвоичныеДанные = Неопределено;
	
	Если Местоположение = РасположенияМодуля.Файл Тогда
		
		ДвоичныеДанные	 = Новый ДвоичныеДанные(ПутьКФайлу);
		
	ИначеЕсли Местоположение = РасположенияМодуля.Справочник
		И Не ВнешняяОбработка = Неопределено Тогда
		
		ДвоичныеДанные	 = ДвоичныеДанныеОбработкиИзСправочникаВнешнихОбработок(ВнешняяОбработка);
		
	Иначе
		
		ДвоичныеДанные = Неопределено;
		
	КонецЕсли;
	
	Возврат ДвоичныеДанные;
	
КонецФункции
	
&НаСервере
Функция ДвоичныеДанныеОбработкиИзФайла(ПутьКФайлу)
	
	ДвоичныеДанные	 = Новый ДвоичныеДанные(ПутьКФайлу);
	Возврат ДвоичныеДанные;
	
КонецФункции
	
&НаСервере
Функция ДвоичныеДанныеОбработкиИзСправочникаВнешнихОбработок(ВнешняяОбработка)
	
	ДвоичныеДанные	 = МодульОбъекта().ФайлОбработкиИзСправочникаВнешнихОбработок(ВнешняяОбработка);
	Возврат ДвоичныеДанные;
	
КонецФункции

// Подключает новую версию модуля в метаданные сеанса
//
// Параметры:
//  РасположениеМодуля - Структура - см. функцию НовоеОписаниеРасположенияМодуля()
//
&НаКлиенте
Процедура ПодключитьНовуюВерсиюМодуля(РасположениеМодуля, ПутьКМодулю) Экспорт
	
	РасположенияМодуля = ПеречисленияEDI_ВариантыРасположенияМодуля();
	
	Если РасположениеМодуля = РасположенияМодуля.Файл Тогда
		
		ПодключитьОбработкуМодуляИзФайла(ПутьКМодулю);
		
	ИначеЕсли РасположениеМодуля = РасположенияМодуля.Справочник Тогда
		
		ПодключитьОбработкуМодуляИзСправочника(ПутьКМодулю);
		
	Иначе
		
		ТекстОшибки = ШаблонСтр(НСтр(
		"ru = 'Не удалось подключить внешнюю обработку модуля!
		|Некорректное расположение модуля: %1'"), РасположениеМодуля);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработкуМодуляИзФайла(ПутьКФайлу)
	
	ДвоичныеДанные	 = Новый ДвоичныеДанные(ПутьКФайлу);
	АдресВХ			 = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	ПодключитьОбработкуМодуляИзФайлаНаСервере(ПутьКФайлу, АдресВХ);
	
КонецПроцедуры

&НаСервере
Процедура ПодключитьОбработкуМодуляИзФайлаНаСервере(ПутьКФайлу, АдресВХ)
	
	Файл = Новый Файл(ПутьКФайлу);
	
	Если Файл.Существует() Тогда
		// Если у сервера есть доступ к файлу
		МодульОбъекта().ВнешниеОбработки_СоздатьБезПредупреждений(ПутьКФайлу);
	Иначе
		МодульОбъекта().ВнешниеОбработки_ПодключитьБезПредупреждений(АдресВХ);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПодключитьОбработкуМодуляИзСправочника(ВнешняяОбработка)
	
	ДвоичныеДанные	 = МодульОбъекта().ФайлОбработкиИзСправочникаВнешнихОбработок(ВнешняяОбработка);
	АдресВХ			 = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	МодульОбъекта().ВнешниеОбработки_ПодключитьБезПредупреждений(АдресВХ);
	
КонецПроцедуры



// Получает новую версию модуля из сервиса обновлений
// и обновляет его в справочнике внешних обработок
//
// Параметры:
//  ВнешняяОбработка - СправочникСсылка - элемент в справочнике внешних обработок,
//                                        в который нужно записать файл модуля;
//  НоваяВерсия 	 - Строка           - номер версии контента;
//
&НаСервере
Процедура ВыполнитьОбновлениеМодуляВСправочнике(ВнешняяОбработка, НоваяВерсия)
	
	МодульОбъекта().ВыполнитьОбновлениеМодуляВСправочнике(ВнешняяОбработка, НоваяВерсия);
	
КонецПроцедуры  

&НаСервере
Процедура ВыполнитьОбновлениеМодуляВРасширении(НоваяВерсия, ТипКонтента)
	
    МодульОбъекта().ВыполнитьОбновлениеМодуляВРасширении(НоваяВерсия, ТипКонтента);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЦентрПоддержки(ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") 
		И ДополнительныеПараметры.Свойство("ПараметрыСессии") Тогда
		
		ПараметрыСессии = ДополнительныеПараметры.ПараметрыСессии;
		
	Иначе
		
		ПараметрыСессии = СформироватьПараметрыЦентраПоддержки(ДополнительныеПараметры);
		
	КонецЕсли;
	
	РезультатОткрытия = Новый Структура();
	РезультатОткрытия.Вставить("БраузерОткрылся", Ложь);
	РезультатОткрытия.Вставить("ТекстОшибки", "");
	
	ЦентрПоддержки().ОткрытьЦентрПоддержки(ПараметрыСессии, "чат", РезультатОткрытия);
    Метрика_ОбработатьРезультатОткрытияПоддержки("ОткрытьЦентрПоддержки", РезультатОткрытия);		
	
КонецПроцедуры

&НаСервере
Процедура Метрика_ОбработатьРезультатОткрытияПоддержки(Место,РезультатОткрытия);
	
	КонтурEDI = МодульОбъекта();
	Если РезультатОткрытия.БраузерОткрылся Тогда
		КонтурEDI.Метрика_Информация(Место, "Браузер открылся", РезультатОткрытия, Истина);
	Иначе         
		КонтурEDI.Метрика_Ошибка(Место, РезультатОткрытия.ТекстОшибки, , РезультатОткрытия, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьПараметрыЦентраПоддержки(ДопКонтекстДляЦентраПоддержки = Неопределено) Экспорт
	
	Возврат СформироватьПараметрыЦентраПоддержкиНаСервере(ДопКонтекстДляЦентраПоддержки);
	
КонецФункции  

&НаСервере
Функция СформироватьПараметрыЦентраПоддержкиНаСервере(ДопКонтекстДляЦентраПоддержки = Неопределено)
	
	Возврат МодульОбъекта().СформироватьПараметрыЦентраПоддержки(ДопКонтекстДляЦентраПоддержки);
	
КонецФункции

&НаКлиенте
Функция ДополнительныйМодуль(ИмяМодуля) Экспорт
	
	ФормаКлиент = Кэш_Прочитать("Модуль_" + ИмяМодуля);
	
	Если ФормаКлиент <> Неопределено Тогда 
		
		Возврат ФормаКлиент;
		
	КонецЕсли;

	ИмяФормаКлиент = ПолучитьКлиентскийМодульДополнительногоМодуля(ИмяМодуля);
	ПараметрыФормы = Новый Структура("АдресВременногоХранилищаОсновногоМодуля", Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект);
	ФормаКлиент = ПолучитьФорму(ИмяФормаКлиент, ПараметрыФормы, ЭтаФорма);
	
	Кэш_Поместить("Модуль_" + ИмяМодуля, ФормаКлиент);
	
	Возврат ФормаКлиент;
	
КонецФункции

&НаСервере
Функция ПолучитьКлиентскийМодульДополнительногоМодуля(НазваниеМодуля) 
	
	 ДополнительныйМодуль_КонтурEDI = МодульОбъекта().ДополнительныйМодуль(НазваниеМодуля);
	 Возврат ДополнительныйМодуль_КонтурEDI.Метаданные().ПолноеИмя() + ".Форма.МодульОбъектаКлиент";
	
КонецФункции

&НаКлиенте
Функция ПолучитьЗначениеПеременнойСреды(Имя)
	
	Результат = Неопределено;
	
	Попытка
		
		Информация = Новый СистемнаяИнформация;	
		Если Найти(НРег(Информация.ТипПлатформы), "windows") Тогда
			WshShell	= Новый COMobject("wscript.shell");
	    	Результат	= WshShell.ExpandEnvironmentStrings("%"+Имя+"%");
		Иначе	
			Результат = ПолучитьЗначениеПеременнойLinux(Имя);	
		КонецЕсли;		
		
	Исключение
		
		_ОписаниеОшибки = ОписаниеОшибки();
		ТекстСообщения = 	"Не удалось получить значение переменной окружения <%1> по причине:
							|	" + _ОписаниеОшибки;
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", Имя);
		
	КонецПопытки;
		
	Если Результат = Неопределено Тогда
		
		ТекстСообщения = "Переменная окружения <%1> не найдена";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", Имя);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьЗначениеПеременнойLinux(ИмяПеременнойСреды)
	
	ЗначениеВыражения = "";	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	КомандаСистемы("sh -c 'env | grep ^" + ИмяПеременнойСреды + "= > " + ИмяВременногоФайла + "'");
	
	Попытка 
		Чтение = Новый ЧтениеТекста(ИмяВременногоФайла);
		Стр = Чтение.ПрочитатьСтроку();
		Пока Стр <> Неопределено Цикл 
			//Найдем ключ и значение
			Индекс = Найти(Стр, "=");
			Если Индекс > 0 Тогда 
				Ключ = Нрег(Лев(Стр, Индекс - 1));
				Если ВРег(Ключ) = ВРег(ИмяПеременнойСреды) Тогда 
					ЗначениеВыражения = Сред(Стр, Индекс + 1);
					Прервать;					
				КонецЕсли;
			КонецЕсли;
			Стр = Чтение.ПрочитатьСтроку();
		КонецЦикла;
	Исключение 
	КонецПопытки;
	
	Возврат ЗначениеВыражения;
	
КонецФункции

//}} Дополнительные модули


&НаКлиенте
Функция Представление_ФИО(Фамилия, Имя, Отчество) Экспорт
	
	Возврат "" + Фамилия + " " + Имя + ?(ЗначениеЗаполнено(Отчество), " " + Отчество, "");
	
КонецФункции

&НаКлиенте
Функция Представление_ИННКПП(ИНН, КПП = "", Разделитель = "/") Экспорт
	
	Результат = "";
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		Если ЗначениеЗаполнено(КПП) Тогда
			Результат = Результат + "ИНН" + Разделитель + "КПП: " + ИНН + Разделитель + КПП;
		Иначе
			Результат = Результат + "ИНН: " + ИНН;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Представление_МашиночитаемаяДоверенность_Представитель(МашиночитаемаяДоверенность) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ФИО");
	Результат.Вставить("ИНН");
	Результат.Вставить("Организация", Новый Структура("Наименование,ИННКПП"));
	
	Представитель = МашиночитаемаяДоверенность.Представитель;
	Организация = Представитель.Организация;
	
	ФИО = Представитель.ФИО;
	
	Фамилия = ФИО.Фамилия;
	Имя = ФИО.Имя;
	Отчество = ФИО.Отчество;
	
	Результат.ФИО = Представление_ФИО(Фамилия, Имя, Отчество);
	Результат.ИНН = Представление_ИННКПП(Представитель.ИНН);
	Результат.Организация.Наименование = Организация.Наименование;
	Результат.Организация.ИННКПП = Представление_ИННКПП(Организация.ИНН, Организация.КПП, "-");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Представление_МашиночитаемаяДоверенность_Доверитель(МашиночитаемаяДоверенность) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование");
	Результат.Вставить("Тип");
	Результат.Вставить("ИННКПП");
	
	Доверитель = МашиночитаемаяДоверенность.Доверитель;
	ТипДоверителя = МашиночитаемаяДоверенность.Доверитель.Тип;
	
	Если Врег(ТипДоверителя) = Врег("UnknownIssuerType") ИЛИ Врег(ТипДоверителя) = Врег("Неизвестно") Тогда
		
		Результат.Наименование = "<< Неизвестно >>";
		Результат.Тип = "Неизвестно";
		Результат.ИННКПП = "";
		
		Возврат Результат;
		
	ИначеЕсли Врег(ТипДоверителя) = Врег("IndividualEntity") ИЛИ Врег(ТипДоверителя) = Врег("ИндивидуальныйПредприниматель") Тогда 
		
		ИндивидуальныйПредприниматель = Доверитель.ИндивидуальныйПредприниматель;
		
		Результат.Наименование = ИндивидуальныйПредприниматель.Наименование;
		Результат.Тип = "Индивидуальный предприниматель";
		Результат.ИННКПП = Представление_ИННКПП(ИндивидуальныйПредприниматель.ИНН, "", "-");
		
		Возврат Результат;
		
	ИначеЕсли Врег(ТипДоверителя) = Врег("ForeignEntity") ИЛИ Врег(ТипДоверителя) = Врег("ИностраннаяОрганизация") Тогда
		
		ИностраннаяОрганизация = Доверитель.ИностраннаяОрганизация;
		
		Результат.Наименование = ИностраннаяОрганизация.Наименование;
		Результат.Тип = "Иностранная организация";
		Результат.ИННКПП = Представление_ИННКПП(ИностраннаяОрганизация.ИНН, ИностраннаяОрганизация.КПП, "-");
		
		Возврат Результат;
		
	ИначеЕсли Врег(ТипДоверителя) = Врег("PhysicalEntity") ИЛИ Врег(ТипДоверителя) = Врег("ФизическоеЛицо") Тогда
		
		ФизическоеЛицо = Доверитель.ФизическоеЛицо;
		
		ФИО = ФизическоеЛицо.ФИО;
		
		Фамилия = ФИО.Фамилия;
		Имя = ФИО.Имя;
		Отчество = ФИО.Отчество;
		
		Результат.Наименование = Представление_ФИО(Фамилия, Имя, Отчество);
		Результат.Тип = "Физическое лицо";
		Результат.ИННКПП = Представление_ИННКПП(ФизическоеЛицо.ИНН, "", "-");
		
		Возврат Результат;
		
	ИначеЕсли Врег(ТипДоверителя) = Врег("LegalEntity") ИЛИ Врег(ТипДоверителя) = Врег("ЮридическоеЛицо") Тогда 
		
		ЮридическоеЛицо = Доверитель.ЮридическоеЛицо; 
		
		Результат.Наименование = ЮридическоеЛицо.Наименование;
		Результат.Тип = "Юридическое лицо";
		Результат.ИННКПП = Представление_ИННКПП(ЮридическоеЛицо.ИНН, ЮридическоеЛицо.КПП, "-");
		
		Возврат Результат;

		
	Иначе
		
		Результат.Наименование = "<< Неизвестно >>";
		Результат.Тип = "Неизвестно";
		Результат.ИННКПП = "";
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция Представление_МашиночитаемаяДоверенность_ФормаСписка(МашиночитаемаяДоверенность) Экспорт
	
	Доверитель = Представление_МашиночитаемаяДоверенность_Доверитель(МашиночитаемаяДоверенность);
	Представитель = Представление_МашиночитаемаяДоверенность_Представитель(МашиночитаемаяДоверенность);
	
	Представление = "" + Доверитель.Наименование + "
	|" + Доверитель.ИННКПП + "
	|" + Представитель.ФИО;
	
	Возврат Представление;
	
КонецФункции

&НаКлиенте
Функция Представление_МашиночитаемаяДоверенность_Краткое(МашиночитаемаяДоверенность) Экспорт
	
	Доверитель = Представление_МашиночитаемаяДоверенность_Доверитель(МашиночитаемаяДоверенность);
	Представитель = Представление_МашиночитаемаяДоверенность_Представитель(МашиночитаемаяДоверенность);
	
	Представление = "" + Доверитель.Наименование + ", " + Представитель.ФИО;
	
	Возврат Представление;
	
КонецФункции



&НаКлиенте
Функция НовыйКодыМаркировки() Экспорт
	
	НовыйКодыМаркировки = Новый Структура;
	НовыйКодыМаркировки.Вставить("Неопределен"		, Новый Массив);
	НовыйКодыМаркировки.Вставить("Индивидуальные"	, Новый Массив);
	НовыйКодыМаркировки.Вставить("Наборы"			, Новый Массив);
	НовыйКодыМаркировки.Вставить("Групповые"		, Новый Массив);
	НовыйКодыМаркировки.Вставить("Транспортные"		, Новый Массив);
	
	Возврат НовыйКодыМаркировки;
	
КонецФункции

&НаКлиенте
Функция ПеречисленияEDI_ВариантыРасположенияМодуля() Экспорт

	Возврат ПеречисленияEDI["ВариантыРасположенияМодуля"]; 

КонецФункции

&НаКлиенте
Функция ПеречисленияEDI_ВариантыРасположенияСистемыХранения() Экспорт

	Возврат ПеречисленияEDI["ВариантыРасположенияСистемыХранения"]; 

КонецФункции

&НаКлиенте
Функция ПеречисленияEDI_ПризнакиМодифицированностиКонтента() Экспорт

	Возврат ПеречисленияEDI["ПризнакиМодифицированностиКонтента"];
	
КонецФункции

&НаКлиенте
Функция ПеречисленияEDI_ТипыКонтентаСервисаОбновлений() Экспорт

	Возврат ПеречисленияEDI["ТипыКонтентаСервисаОбновлений"];
	
КонецФункции 

&НаКлиенте
Функция ПеречисленияEDI_СпособыАутентификацииПрокси() Экспорт
	
	Возврат ПеречисленияEDI["СпособыАутентификацииПрокси"];
	
КонецФункции

&НаКлиенте
Функция ПеречисленияEDI_РежимыОпределенияТиповПродукции() Экспорт
	
	Возврат ПеречисленияEDI["РежимыОпределенияТиповПродукции"];
	
КонецФункции

&НаКлиенте
Функция ПолучитьФункциональнуюОпциюEDI(ИмяОпции, ЗначениеПоУмолчанию) Экспорт
	
	ЗначениеОпции = Кэш_Прочитать("ОпцияEDI_" + ИмяОпции);
	
	Если ЗначениеОпции = Неопределено Тогда
	
		ПараметрыМетода = Новый Структура("ИмяОпции, ЗначениеПоУмолчанию", ИмяОпции, ЗначениеПоУмолчанию);
		ЗначениеОпции   = ВыполнитьМетодМодуляОбъекта("Функция", "ПолучитьФункциональнуюОпциюEDI", ПараметрыМетода);
		Кэш_Поместить("ОпцияEDI_" + ИмяОпции, ЗначениеОпции);

	КонецЕсли;

	Возврат ЗначениеОпции;
	
КонецФункции

&НаКлиенте
Функция ОбщийМодуль1С_КонтурEDI(Имя) Экспорт
	
	КлючКЭШ = "ОбщийМодуль1С_" + Имя;
	
	Модуль = Кэш_Прочитать(КлючКЭШ);
	
	Если Модуль = Неопределено Тогда
		
		Попытка
			
			Модуль = Вычислить(Имя);
			
		Исключение
			
			Модуль = Неопределено;
			
		КонецПопытки;
		
		Кэш_Поместить(КлючКЭШ, Модуль);
		
	КонецЕсли;
		
	Возврат Модуль;
	
КонецФункции

&НаСервере
Функция МенеджерНастроекКонтурДиадокAPIНаСервере()

	МенеджерНастроек = МодульОбъекта().КонтурДиадокAPI_МенеджерНастроек();
	МенеджерНастроекКопия = МодульОбъекта(). КонтурСтандарт_СкопироватьРекурсивно(МенеджерНастроек);
	МенеджерНастроекКопия.Сессия = Неопределено;
	
	Возврат МенеджерНастроекКопия;

КонецФункции

&НаКлиенте
Функция ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизацииВнешние) Экспорт
	
	ТипыАвторизации = КонтурДиадокAPI_ТипыАвторизации();
	ДанныеАвторизацииДиадок = Неопределено;
	
	Если ДанныеАвторизацииВнешние.ТипАвторизации = "Сертификат" Тогда
		
		ТипАвторизацииСертификат = ТипыАвторизации.Сертификат;
		
		ДанныеАвторизацииДиадок = КонтурДиадокAPI_НовыйДанныеАвторизации(ТипАвторизацииСертификат);
		
		ДанныеАвторизацииДиадок.Отпечаток 			= ДанныеАвторизацииВнешние.Отпечаток;
		ДанныеАвторизацииДиадок.Расположение 		= ДанныеАвторизацииВнешние.Расположение;
		ДанныеАвторизацииДиадок.ПарольЗакрытогоКлюча = ДанныеАвторизацииВнешние.ПарольКонтейнера;
		
		Если ДанныеАвторизацииВнешние.Расположение = "клиент" Тогда
			ДанныеСертификата = Криптография_НайтиПоОтпечатку(ДанныеАвторизацииВнешние.Отпечаток);
			ДанныеАвторизацииДиадок.ДвоичныеДанные = ДанныеСертификата.ДвоичныеДанные;
		КонецЕсли;
		
	ИначеЕсли ДанныеАвторизацииВнешние.ТипАвторизации = "ЛогинПароль" Тогда
		
		ТипАвторизацииЛогин = ТипыАвторизации.ЛогинПароль;
		
		ДанныеАвторизацииДиадок = КонтурДиадокAPI_НовыйДанныеАвторизации(ТипАвторизацииЛогин);
		
		ДанныеАвторизацииДиадок.Логин  = ДанныеАвторизацииВнешние.Логин;
		ДанныеАвторизацииДиадок.Пароль = ДанныеАвторизацииВнешние.Пароль;
			
	Иначе
		ВызватьИсключение КонтурСтандарт_СтрШаблон_("КонтурДиадокAPI: Недопустимый тип авторизации ""%1"" ", ДанныеАвторизацииВнешние.ТипАвторизации);
	КонецЕсли;
		
	Возврат ДанныеАвторизацииДиадок;
	
КонецФункции


// #Область МодульКонтурСтандарт

////////////////////////////////////////////////////////////////////////
//				Дополнительный модуль "КонтурСтандарт"                //        
////////////////////////////////////////////////////////////////////////

// #Область Программный_интерфейс


// Структура для хранения настроек и кэша функционально блока
// Возвращаемое значение:
//	 Структура - настройки функционального блока
&НаКлиенте
Функция КонтурСтандарт_МенеджерНастроек() Экспорт
	
	МенеджерНастроек = Кэш_Прочитать("КонтурСтандарт_МенеджерНастроек");
	
	Если МенеджерНастроек = Неопределено Тогда

		МенеджерНастроек = КонтурСтандарт_НовыйМенеджерНастроек();
		
		МенеджерНастроек.РезультатФункции_ВерсияПлатформыНеНижеУказанной = Новый Соответствие;
		МенеджерНастроек.РезультатФункции_ВерсияРежимСовместимостиНеНижеУказанной = Новый Соответствие;
 		
		Кэш_Поместить("КонтурСтандарт_МенеджерНастроек", МенеджерНастроек); 
		
	КонецЕсли;
	
	Возврат МенеджерНастроек;
	
КонецФункции

// Находит первое вхождение искомой строки как подстроки в исходной строке. Сравнение выполняется с учетом регистра.
//
// Параметры:
//   Строка - Строка - исходная строка
//	 ПодстрокаПоиска - Строка - искомая подстрока
//	 НаправлениеПоиска - Строка - см. КонтурСтандарт_НаправлениеПоискаСКонца, КонтурСтандарт_НаправлениеПоискаСНачала
//	 НачальнаяПозиция - Число - указывает позицию в строке, с которой начинается поиск.
//	 НомерВхождения - Число - указывает номер вхождения искомой подстроки в исходной строке.
//
// Возвращаемое значение:
//   Число, Неопределено - Позиция первого знака найденной подстроки. Нумерация символов в строке начинается с 1. 
//   Если строка не содержит указанной подстроки, то возвращается 0.
&НаКлиенте
Функция КонтурСтандарт_СтрНайти_(Знач Строка, Знач ПодстрокаПоиска, Направление = "СНачала", НачальнаяПозиция = 1, НомерВхождения = 1) Экспорт
	
	Если НЕ Направление = КонтурСтандарт_НаправлениеПоискаСКонца() Тогда
		
		Направление = КонтурСтандарт_НаправлениеПоискаСНачала();
		
	КонецЕсли;
	
	Если НачальнаяПозиция = Неопределено Тогда 
		
		Если Направление = КонтурСтандарт_НаправлениеПоискаСКонца() Тогда 
			
			НачальнаяПозиция = СтрДлина(Строка);
			
		Иначе                               

			НачальнаяПозиция = 1;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если КонтурСтандарт_ДоступныБазовыеСтроковыеФункции() Тогда
				
		Возврат Вычислить("СтрНайти(Строка, ПодстрокаПоиска, НаправлениеПоиска[Направление], НачальнаяПозиция, НомерВхождения)");	
		 
	Иначе

		Если Строка = "" и ПодстрокаПоиска = "" Тогда
			// чтобы отрабатывало как в платформе
			Если Направление = КонтурСтандарт_НаправлениеПоискаСКонца() Тогда
				Если НомерВхождения = 1 Тогда
					Возврат 1;
				Иначе
					Возврат 0;
				КонецЕсли;
			Иначе
				Возврат Мин(НомерВхождения, ?(НачальнаяПозиция = Неопределено, 1, НачальнаяПозиция));
			КонецЕсли;
		КонецЕсли;
		
		Позиция = НачальнаяПозиция;
		Если Направление = КонтурСтандарт_НаправлениеПоискаСКонца() Тогда
			Строка = КонтурСтандарт_СтрРазвернуть_(Строка);
			ПодстрокаПоиска = КонтурСтандарт_СтрРазвернуть_(ПодстрокаПоиска); 
			Позиция = Макс(1, СтрДлина(Строка)-Позиция-СтрДлина(ПодстрокаПоиска)+2);
		КонецЕсли;
		
		Результат = 0;
		Вхождение = 0;
		ДлинаСтроки = СтрДлина(Строка);
		ДлинаПодстроки = СтрДлина(ПодстрокаПоиска);
		
		Пока Позиция <> ДлинаСтроки + 1 Цикл	
			Если Сред(Строка, Позиция, ДлинаПодстроки) = ПодстрокаПоиска Тогда
				Результат = Позиция;
				Вхождение = Вхождение + 1;
				Если Вхождение = НомерВхождения Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;	
			Позиция = Позиция + 1;	
		КонецЦикла;
		
		Если Направление = КонтурСтандарт_НаправлениеПоискаСКонца() И Результат <> 0 Тогда
			Сдвиг = 2;
			Результат = ДлинаСтроки - ДлинаПодстроки - Результат + Сдвиг;	
		КонецЕсли;
		
		Возврат Результат; 
		
	КонецЕсли;

КонецФункции

// Определяет направление поиска подстроки в строке.
// Возвращаемое значение:
//	 Строка - "СКонца"
&НаКлиенте
Функция КонтурСтандарт_НаправлениеПоискаСКонца() Экспорт 
	
	Возврат "СКонца";	 
	
КонецФункции

// Определяет направление поиска подстроки в строке.
// Возвращаемое значение:
//	 Строка - "СНачала"
&НаКлиенте
Функция КонтурСтандарт_НаправлениеПоискаСНачала() Экспорт   
	
	Возврат "СНачала";	 
	
КонецФункции

// Подставляет параметры в строку по номеру.
//
// Параметры:
//   Шаблон - Строка - строка, содержащая маркеры подстановки вида: "%1..%N".
//	 <Значение1-Значение10> - Произвольный - Параметры, содержащие произвольные значения, строковые представления которых должны быть подставлены в шаблон.  
//
// Возвращаемое значение:
//   Строка - Строка шаблона с подставленными параметрами.
&НаКлиенте
Функция КонтурСтандарт_СтрШаблон_(Знач СтрокаПодстановки, Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	   							Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	   							Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено,
								Знач Параметр10 = Неопределено) Экспорт
								
	Если КонтурСтандарт_ДоступныБазовыеСтроковыеФункции() Тогда
		
		Результат = Вычислить("СтрШаблон(СтрокаПодстановки,Параметр1,Параметр2,Параметр3,Параметр4,Параметр5,Параметр6,Параметр7,Параметр8,Параметр9,Параметр10)");
		
	Иначе
		
		Результат = КонтурСтандарт_ПодставитьПараметрыВСтроку(СтрокаПодстановки, Параметр1, Параметр2, Параметр3, 
															Параметр4, Параметр5, Параметр6, 
															Параметр7, Параметр8, Параметр9,
															Параметр10);
															
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Разделяет строку на части по указанным символам-разделителям.
//
// Параметры:
//   Строка - Строка - разделяемая строка
//	 Разделитель - Строка - Строка символов, каждый из которых является индивидуальным разделителем.
//	 ВключатьПустые - Булево - Указывает необходимость включать в результат пустые строки, которые могут образоваться в результате разделения исходной строки. 
//
// Возвращаемое значение:
//   Массив - Массив со строками, которые получились в результате разделения исходной строки. 
&НаКлиенте
Функция КонтурСтандарт_СтрРазделить_(Строка, Разделитель, ВключатьПустые = Истина) Экспорт
	
	Если КонтурСтандарт_ДоступныБазовыеСтроковыеФункции() Тогда
		
		Возврат Вычислить("СтрРазделить(Строка, Разделитель, ВключатьПустые)");	
		
	Иначе
			
		Возврат КонтурСтандарт_СтрРазделить_Совместимость(Строка, Разделитель, ВключатьПустые);
		
	КонецЕсли;
	
КонецФункции

// Соединяет массив переданных строк в одну строку с указанным разделителем.
//
// Параметры:
//   Строка - ФиксированныйМассив, Массив - массив, содержащий объединяемые строки.
//	 Разделитель - Строка - Строка, которая будет вставлена между объединяемыми строками.
//
// Возвращаемое значение:
//   Строка - Строка, содержащая соединенные исходные строки с разделителем между ними.
&НаКлиенте
Функция КонтурСтандарт_СтрСоединить_(Строки, Разделитель) Экспорт
	
	Если КонтурСтандарт_ДоступныБазовыеСтроковыеФункции() Тогда
		
		Возврат Вычислить("СтрСоединить(Строки, Разделитель)");	
		
	Иначе
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		
		ЭтоПерваяСтрока = Истина;
		
		Для Каждого ТекСтрока Из Строки Цикл
			
			Если НЕ ЭтоПерваяСтрока Тогда
				
				ЗаписьXML.ЗаписатьБезОбработки(Разделитель);
				
			Иначе                                
				
				ЭтоПерваяСтрока =  Ложь;        
				
			КонецЕсли;
		
			ЗаписьXML.ЗаписатьБезОбработки(Строка(ТекСтрока));
			
		КонецЦикла;
		
		Возврат ЗаписьXML.Закрыть();
		
	КонецЕсли;
	
КонецФункции

// Определяет, что строка начинается с указанной подстроки.
//
// Параметры:
//   Строка - Строка - Строка, начало которой проверяется на совпадение с подстрокой поиска.
//	 СтрокаПоиска - Строка - Строка, содержащая предполагаемое начало строки.
//
// Возвращаемое значение:
//   Булево - Истина - строка начинается с указанной подстроки, Ложь - в противном случае.
&НаКлиенте
Функция КонтурСтандарт_СтрНачинаетсяС_(Строка, СтрокаПоиска) Экспорт
	
	Если КонтурСтандарт_ДоступныБазовыеСтроковыеФункции() Тогда
		
		Возврат Вычислить("СтрНачинаетсяС(Строка, СтрокаПоиска)");
		
	Иначе                        
		
		Возврат Найти(Строка, СтрокаПоиска) = 1;	    
		
	КонецЕсли;
	
КонецФункции

// Определяет, заканчивается ли строка указанной подстрокой. 
//
// Параметры:
//   Строка - Строка - Строка, окончание которой проверяется на совпадение с подстрокой поиска.
//	 СтрокаПоиска - Строка - трока, содержащая предполагаемое окончание строки.
//
// Возвращаемое значение:
//   Булево - Истина - строка заканчивается указанной подстрокой; Ложь - в противном случае.
&НаКлиенте
Функция КонтурСтандарт_СтрЗаканчиваетсяНа_(Строка, СтрокаПоиска) Экспорт
	
	Если КонтурСтандарт_ДоступныБазовыеСтроковыеФункции() Тогда                 
		
		Возврат Вычислить("СтрЗаканчиваетсяНа(Строка, СтрокаПоиска)");
		
	Иначе                                                          
		
		Возврат Прав(Строка, СтрДлина(СтрокаПоиска)) = СтрокаПоиска; 
		
	КонецЕсли;
	
КонецФункции 

// Выполняет сравнение строк без учета регистра, аналогичное сравнению строк с помощью объекта СравнениеЗначений. 
//
// Параметры:
//   Строка1 - Строка - Строка для сравнения.
//	 Строка2 - Строка - Строка для сравнения.
//
// Возвращаемое значение:
//   Число - озвращает:
//   	-1 - первая строка меньше второй.
//   	 1 - первая строка больше второй.
//   	 0 - первая строка равна второй.
&НаКлиенте
Функция КонтурСтандарт_СтрСравнить_(Строка1, Строка2) Экспорт 
	
	Если КонтурСтандарт_ДоступныБазовыеСтроковыеФункции() Тогда                 
		
		Возврат Вычислить("СтрСравнить(Строка1, Строка2)");
		
	Иначе                                                          
		
		Возврат КонтурСтандарт_СтрСравнить_Совместимость(Строка1, Строка2); 
		
	КонецЕсли;
	
КонецФункции

// Выполняет разворот строки "абв" ->"вба". 
//
// Параметры:
//   Строка - Строка - Строка для разворота.
//
// Возвращаемое значение:
//   Строка - возвращает развернутую строку:
&НаКлиенте
Функция КонтурСтандарт_СтрРазвернуть_(Знач Строка) 
		
	Результат = "";
	Для Сч = 1 По СтрДлина(Строка) Цикл 
		Результат = Лев(Строка, 1) + Результат;
		Строка = Сред(Строка, 2);
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

// Преобразует строку в значение типа ДвоичныеДанные с учетом кодировки текста.
//
// Параметры:
//   Строка - Строка - Строка, которую требуется преобразовать в ДвоичныеДанные.
//	 КодировкаТекста - КодировкаТекста, Строка - Кодировка текста может быть задана как в виде значения перечисления КодировкаТекста, так и в виде строки с указанием названия кодировки.
//   ЗаписатьBOM - Булево - Определяет, будет ли добавлена метка порядка байт (BOM) кодировки текста в начало данных.
//
// Возвращаемое значение:
//   Булево - Истина - строка начинается с указанной подстроки, Ложь - в противном случае.
&НаКлиенте
Функция КонтурСтандарт_ПолучитьДвоичныеДанныеИзСтроки_(Строка, Кодировка = Неопределено, ЗаписатьBOM = Ложь) Экспорт 
	
	Если КонтурСтандарт_ДоступныМетодыДвоичныхДанных() Тогда
		
		ДвоичныеДанные = Вычислить("ПолучитьДвоичныеДанныеИзСтроки(Строка, Кодировка, ЗаписатьBOM)");

	Иначе
		
		Если Кодировка = Неопределено Тогда 
			
			Кодировка = "utf-8";          
			
		КонецЕсли;
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		
		Если ЗаписатьBOM Тогда
			ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, Кодировка);	
		Иначе	
			ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста.ANSI);	
		КонецЕсли;       
		
		ЗаписьТекста.Закрыть();
		
		ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, Кодировка,, Истина, Символы.ПС);
		ЗаписьТекста.Записать(Строка);
		ЗаписьТекста.Закрыть();
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		
		УдалитьФайлы(ИмяВременногоФайла);
		
			
	КонецЕсли; 
	
	Возврат ДвоичныеДанные;
	
КонецФункции 

// Преобразует двоичные данные в строку с заданной кодировкой текста.
//
// Параметры:
//   ДвоичныеДанные - ДвоичныеДанные - Двоичные данные, которые требуется преобразовать в строку.
//	 КодировкаТекста - КодировкаТекста, Строка - Кодировка текста может быть задана как в виде значения перечисления КодировкаТекста, так и в виде строки с указанием названия кодировки.
//
// Возвращаемое значение:
//   Строка - преобразованая строка.
&НаКлиенте
Функция КонтурСтандарт_ПолучитьСтрокуИзДвоичныхДанных_(ДвоичныеДанные, Кодировка = "utf-8") Экспорт
	
	Если КонтурСтандарт_ДоступныМетодыДвоичныхДанных() Тогда
		
		СтрокаТекста = Вычислить("ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные, Кодировка)");

	Иначе
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		ЧтениеТекста = Новый ЧтениеТекста(ИмяВременногоФайла, Кодировка);
		СтрокаТекста = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();	
		
		УдалитьФайлы(ИмяВременногоФайла); 
		
			
	КонецЕсли;  
	
	Возврат СтрокаТекста;    
	
КонецФункции

// Преобразует двоичные данные в строку формата Base 16 (Hex).
//
// Параметры:
//   ДвоичныеДанные - ДвоичныеДанные - Двоичные данные.
//
// Возвращаемое значение:
//   Строка - преобразованая строка.
&НаКлиенте
Функция КонтурСтандарт_ПолучитьHexСтрокуИзДвоичныхДанных_(ДвоичныеДанные) Экспорт
	
	Если КонтурСтандарт_ДоступныМетодыДвоичныхДанных() Тогда
		
		HexСтрока = Вычислить("ПолучитьHexСтрокуИзДвоичныхДанных(ДвоичныеДанные)");

	Иначе

		ТипhexBinary = ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "hexBinary");
		
		ЗначениеXDTO = ФабрикаXDTO.Создать(ТипhexBinary, ДвоичныеДанные);
		
		HexСтрока = ЗначениеXDTO.ЛексическоеЗначение;  
		
	КонецЕсли;
	
	Возврат HexСтрока;
	
КонецФункции

// Преобразует строку в формате Base 16 (Hex) в двоичные данные.
//
// Параметры:
//   Строка - Строка - Строка в формате Base 16 (Hex)..
//
// Возвращаемое значение:
//   ДвоичныеДанные - двоичные данные.
&НаКлиенте
Функция КонтурСтандарт_ПолучитьДвоичныеДанныеИзHexСтроки_(Строка) Экспорт
	
	Если КонтурСтандарт_ДоступныМетодыДвоичныхДанных() Тогда
		
		ДвоичныеДанные = Вычислить("ПолучитьДвоичныеДанныеИзHexСтроки(Строка)");

	Иначе
		
		ЧтениеXML = Новый ЧтениеXML;
		
		ЧтениеXML.УстановитьСтроку("<foo xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" 
		|xmlns:xsd=""http://www.w3.org/2001/XMLSchema"" xsi:type=""xsd:hexBinary"">" + Строка + "</foo>");  
		
		ДвоичныеДанные = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);

	КонецЕсли;  
	
	Возврат ДвоичныеДанные;  
	
КонецФункции

// Получает строку, закодированную по алгоритму base64.
//
// Параметры:
//   ДвоичныеДанные - ДвоичныеДанные - Двоичные данные, которые необходимо закодировать по алгоритму base64.
//   БезПереносов - Булево - Флаг отвечающий за удаление переносов в результирующией строке
//
// Возвращаемое значение:
//   Строка - преобразованная строка в формате base64.
Функция КонтурСтандарт_Base64Строка(ДвоичныеДанные, БезПереносов = Истина) Экспорт 
	
	ДанныеСтроки = Base64Строка(ДвоичныеДанные);
	
	Если БезПереносов Тогда
		ДанныеСтроки = СтрЗаменить(ДанныеСтроки, Символы.ПС, "");
		ДанныеСтроки = СтрЗаменить(ДанныеСтроки, Символы.ВК, "");
	КонецЕсли;

	Возврат ДанныеСтроки;
	
КонецФункции

// Преобразует исходную строку в число без вызова исключений.
//
// Параметры:
//   Значение - Строка - строка, которую необходимо привести к числу.
//                       Например, "10", "+10", "010", вернет 10;
//                                 "(10)", "-10",вернет -10;
//                                 "10,2", "10.2",вернет 10.2;
//                                 "000", " ", "",вернет 0;
//                                 "10текст", вернет Неопределено.
//
// Возвращаемое значение:
//   Число, Неопределено - полученное число, либо Неопределено, если строка не является числом.
//
&НаКлиенте
Функция КонтурСтандарт_СтрокаВЧисло(Знач Значение) Экспорт
	
	Значение  = СтрЗаменить(Значение, " ", "");
	Если КонтурСтандарт_СтрНачинаетсяС_(Значение, "(") Тогда
		Значение = СтрЗаменить(Значение, "(", "-");
		Значение = СтрЗаменить(Значение, ")", "");
	КонецЕсли;
	
	СтрокаБезНулей = СтрЗаменить(Значение, "0", "");
	Если ПустаяСтрока(СтрокаБезНулей) Или СтрокаБезНулей = "-" Тогда
		Возврат 0;
	КонецЕсли;
	
	ТипЧисло  = Новый ОписаниеТипов("Число");
	Результат = ТипЧисло.ПривестиЗначение(Значение);
	
	Возврат ?(Результат <> 0 И Не ПустаяСтрока(СтрокаБезНулей), Результат, Неопределено);
	
КонецФункции

// Удаляет двойные кавычки с начала и конца строки, если они есть.
//
// Параметры:
//  Значение - Строка - входная строка.
//
// Возвращаемое значение:
//  Строка - строка без двойных кавычек.
//      
&НаКлиенте
Функция КонтурСтандарт_СократитьДвойныеКавычки(Знач Значение) Экспорт
	
	Пока КонтурСтандарт_СтрНачинаетсяС_(Значение, """") Цикл
		Значение = Сред(Значение, 2); 
	КонецЦикла; 
	
	Пока КонтурСтандарт_СтрЗаканчиваетсяНа_(Значение, """") Цикл
		Значение = Лев(Значение, СтрДлина(Значение) - 1);
	КонецЦикла;
	
	Возврат Значение;
	
КонецФункции 

// Получает значения параметров из строки.
//
// Параметры:
//  СтрокаПараметров - Строка - строка, содержащая параметры, каждый из которых представляет собой
//                              фрагмент вида <Имя параметра>=<Значение>, где:
//                                Имя параметра - имя параметра; 
//                                Значение - его значение. 
//                              Фрагменты отделяются друг от друга символами ';'.
//                              Если значение содержит пробельные символы, то оно должно быть заключено в двойные
//                              кавычки (").
//                              Например:
//                               "File=""c:\InfoBases\Trade""; Usr=""Director"";"
//  Разделитель - Строка - символ, которым фрагменты отделяются друг от друга.
//
// Возвращаемое значение:
//  Структура - значения параметров, где ключ - имя параметра, значение - значение параметра.
//
// Пример:
//  Результат = СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки("File=""c:\InfoBases\Trade""; Usr=""Director"";""", ";");
//  - вернет структуру:
//     ключ "File" и значение "c:\InfoBases\Trade"
//     ключ "Usr"  и значение "Director".
//
&НаКлиенте
Функция КонтурСтандарт_ПараметрыИзСтроки(Знач СтрокаПараметров, Знач Разделитель = ";") Экспорт
	Результат = Новый Структура;
	
	ОписаниеПараметра = "";
	НайденоНачалоСтроки = Ложь;
	НомерПоследнегоСимвола = СтрДлина(СтрокаПараметров);
	Для НомерСимвола = 1 По НомерПоследнегоСимвола Цикл
		Символ =Сред(СтрокаПараметров, НомерСимвола, 1);
		Если Символ = """" Тогда
			НайденоНачалоСтроки = Не НайденоНачалоСтроки;
		КонецЕсли;
		Если Символ <> Разделитель Или НайденоНачалоСтроки Тогда
			ОписаниеПараметра = ОписаниеПараметра + Символ;
		КонецЕсли;
		Если Символ = Разделитель И Не НайденоНачалоСтроки Или НомерСимвола = НомерПоследнегоСимвола Тогда
			Позиция = КонтурСтандарт_СтрНайти_(ОписаниеПараметра, "=");
			Если Позиция > 0 Тогда
				ИмяПараметра = СокрЛП(Лев(ОписаниеПараметра, Позиция - 1));
				ЗначениеПараметра = СокрЛП(Сред(ОписаниеПараметра, Позиция + 1));
				ЗначениеПараметра = КонтурСтандарт_СократитьДвойныеКавычки(ЗначениеПараметра);
				Результат.Вставить(ИмяПараметра, ЗначениеПараметра);
			КонецЕсли;
			ОписаниеПараметра = "";
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции  

// Проверяет, содержит ли строка только цифры.
//
// Параметры:
//  Значение         - Строка - проверяемая строка.
//  Устаревший       - Булево - устаревший параметр, не используется.
//  ПробелыЗапрещены - Булево - если Ложь, то в строке допустимо наличие пробелов.
//
// Возвращаемое значение:
//   Булево - Истина - строка содержит только цифры или пустая, Ложь - строка содержит иные символы.
//
// Пример:
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("0123"); // Истина
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("0123abc"); // Ложь
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("01 2 3",, Ложь); // Истина
//
&НаКлиенте
Функция КонтурСтандарт_ТолькоЦифрыВСтроке(Знач Значение, Знач Устаревший = Истина, Знач ПробелыЗапрещены = Истина) Экспорт
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПробелыЗапрещены Тогда
		Значение = СтрЗаменить(Значение, " ", "");
	КонецЕсли;
		
	Если СтрДлина(Значение) = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если содержит только цифры, то в результате замен должна быть получена пустая строка.
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы.
	Возврат СтрДлина(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
			Значение, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", "")) = 0;
	
КонецФункции

// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров начинается с единицы.
//
// Параметры:
//  ШаблонСтроки  - Строка - шаблон строки с параметрами (вхождениями вида "%<номер параметра>", 
//                           например "%1 пошел в %2");
//  Параметр1   - Строка - значение подставляемого параметра.
//  Параметр2   - Строка
//  Параметр3   - Строка
//  Параметр4   - Строка
//  Параметр5   - Строка
//  Параметр6   - Строка
//  Параметр7   - Строка
//  Параметр8   - Строка
//  Параметр9   - Строка
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
// Пример:
//  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк") = "Вася пошел
//  в Зоопарк".
//
&НаКлиенте
Функция КонтурСтандарт_ПодставитьПараметрыВСтроку(Знач ШаблонСтроки, Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,	
												Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
												Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено,
												Знач Параметр10 = Неопределено) Экспорт
	
	ЕстьПараметрыСПроцентом = КонтурСтандарт_СтрНайти_(Параметр1, "%")
		Или КонтурСтандарт_СтрНайти_(Параметр2, "%")
		Или КонтурСтандарт_СтрНайти_(Параметр3, "%")
		Или КонтурСтандарт_СтрНайти_(Параметр4, "%")
		Или КонтурСтандарт_СтрНайти_(Параметр5, "%")
		Или КонтурСтандарт_СтрНайти_(Параметр6, "%")
		Или КонтурСтандарт_СтрНайти_(Параметр7, "%")
		Или КонтурСтандарт_СтрНайти_(Параметр8, "%")
		Или КонтурСтандарт_СтрНайти_(Параметр9, "%")
		Или КонтурСтандарт_СтрНайти_(Параметр10, "%");
		
	Если ЕстьПараметрыСПроцентом Тогда
		Возврат КонтурСтандарт_ПодставитьПараметрыСПроцентом(ШаблонСтроки, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9, Параметр10);
	КонецЕсли;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Параметр1);
	МассивПараметров.Добавить(Параметр2);
	МассивПараметров.Добавить(Параметр3);
	МассивПараметров.Добавить(Параметр4);
	МассивПараметров.Добавить(Параметр5);
	МассивПараметров.Добавить(Параметр6);
	МассивПараметров.Добавить(Параметр7);
	МассивПараметров.Добавить(Параметр8);
	МассивПараметров.Добавить(Параметр9);
	МассивПараметров.Добавить(Параметр10);
	
	ВсегоПараметров = 11;
	Для М = 1 По 10 Цикл
		
		НомерПараметра = Строка(ВсегоПараметров - М);
		
		ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%" + НомерПараметра, МассивПараметров.Получить(НомерПараметра - 1));
		ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%(" + НомерПараметра + ")", МассивПараметров.Получить(НомерПараметра - 1));
		
	КонецЦикла;
	
	Возврат ШаблонСтроки;
	
КонецФункции

// Получает номер версии конфигурации без номера сборки.
//
// Параметры:
//  Версия - Строка - версия конфигурации в формате РР.ПП.ЗЗ.СС,
//                    где СС - номер сборки, который будет удален.
// 
// Возвращаемое значение:
//  Строка - номер версии конфигурации без номера сборки в формате РР.ПП.ЗЗ.
//
&НаКлиенте
Функция КонтурСтандарт_ВерсияКонфигурацииБезНомераСборки(Версия) Экспорт
	
	Массив = КонтурСтандарт_СтрРазделить_(Версия, ".");
	
	Если Массив.Количество() < 3 Тогда
		Возврат Версия;
	КонецЕсли;
	
	Результат = "[Редакция].[Подредакция].[Релиз]";
	Результат = СтрЗаменить(Результат, "[Редакция]",    Массив[0]);
	Результат = СтрЗаменить(Результат, "[Подредакция]", Массив[1]);
	Результат = СтрЗаменить(Результат, "[Релиз]",       Массив[2]);
	
	Возврат Результат;
	
КонецФункции

// Сравнивает два значения.
//
// Параметры:
//   Значение1 - Строка - Первое значение сравнения
//   Значение2 - Строка - Второе значение сравнения
//
// Возвращаемое значение:
//   Число - Результат < 0 - первое значение меньше второго. 
//   		 Результат > 0 - первое значение больше второго. 
//   		 Результат = 0 - первое значение равно второму.
&НаКлиенте
Функция КонтурСтандарт_СравнитьВерсии(СтрокаВерсии1, СтрокаВерсии2) Экспорт
	КоличествоТочек1 = СтрЧислоВхождений(СтрокаВерсии1, ".");
	КоличествоТочек2 = СтрЧислоВхождений(СтрокаВерсии2, ".");
	
	МаксТочек = Макс(КоличествоТочек1, КоличествоТочек2);
	
	ВерсияПоУмолчанию = "0";
	
	Для Индекс = 1 По МаксТочек Цикл
		ВерсияПоУмолчанию = ВерсияПоУмолчанию + ".0"; 	
	КонецЦикла;
	
	Если ПустаяСтрока(СтрокаВерсии1) Тогда
		Строка1 = ВерсияПоУмолчанию;
	Иначе    
		Строка1 = СтрокаВерсии1;
		Для Индекс = 1 По МаксТочек - КоличествоТочек1 Цикл 
			Строка1 = Строка1 + ".0";	
		КонецЦикла;
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаВерсии2) Тогда
		Строка2 = ВерсияПоУмолчанию;
	Иначе    
		Строка2 = СтрокаВерсии2;
		Для Индекс = 1 По МаксТочек - КоличествоТочек2 Цикл 
			Строка2 = Строка2 + ".0";	
		КонецЦикла;
	КонецЕсли;
	
	Версия1 = КонтурСтандарт_СтрРазделить_Совместимость(Строка1, ".");
	Версия2 = КонтурСтандарт_СтрРазделить_Совместимость(Строка2, ".");
	
	Результат = 0;
	Для Разряд = 0 По МаксТочек Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции  

// Разбирает строку URI на составные части и возвращает в виде структуры.
// На основе RFC 3986.
//
// Параметры:
//  СтрокаURI - Строка - ссылка на ресурс в формате:
//                       <схема>://<логин>:<пароль>@<хост>:<порт>/<путь>?<параметры>#<якорь>.
//
// Возвращаемое значение:
//  Структура - составные части URI согласно формату:
//   * Схема         - Строка - схема из URI.
//   * Логин         - Строка - логин из URI.
//   * Пароль        - Строка - пароль из URI.
//   * ИмяСервера    - Строка - часть <хост>:<порт> из URI.
//   * Хост          - Строка - хост из URI.
//   * Порт          - Строка - порт из URI.
//   * ПутьНаСервере - Строка - часть <путь>?<параметры>#<якорь> из URI.
//
&НаКлиенте
Функция КонтурСтандарт_СтруктураURI(Знач СтрокаURI) Экспорт
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = КонтурСтандарт_СтрНайти_(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;
	
	// Строка соединения и путь на сервере.
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = КонтурСтандарт_СтрНайти_(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
	
	// Информация пользователя и имя сервера.
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = КонтурСтандарт_СтрНайти_(СтрокаСоединения, "@", КонтурСтандарт_НаправлениеПоискаСКонца());
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	Пароль = "";
	Позиция = КонтурСтандарт_СтрНайти_(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = КонтурСтандарт_СтрНайти_(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
		Если Не КонтурСтандарт_ТолькоЦифрыВСтроке(Порт) Тогда
			Порт = "";
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(ПустаяСтрока(Порт), Неопределено, Число(Порт)));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции

// Создает полную копию структуры, соответствия, массива, списка или таблицы значений, рекурсивно,
// с учетом типов дочерних элементов. При этом содержимое значений объектных типов
// (СправочникОбъект, ДокументОбъект и т.п.) не копируются, а возвращаются ссылки на исходный объект.
//
// См. ОбщегоНазначения.СкопироватьРекурсивно
//
// Параметры:
//  Источник - Структура
//           - ФиксированнаяСтруктура
//           - Соответствие
//           - ФиксированноеСоответствие
//           - Массив
//           - ФиксированныйМассив
//           - СписокЗначений - объект, который необходимо скопировать.
//  ФиксироватьДанные - Булево
//                    - Неопределено - если Истина - фиксировать,
//                          если Ложь - снять фиксацию, если Неопределено - не изменять.
//
// Возвращаемое значение:
//  Структура
//  ФиксированнаяСтруктура
//  Соответствие
//  ФиксированноеСоответствие
//  Массив
//  ФиксированныйМассив
//  СписокЗначений - копия объекта, переданного в параметре Источник.
&НаКлиенте
Функция КонтурСтандарт_СкопироватьРекурсивно(Источник, ФиксироватьДанные = Неопределено) Экспорт
	
	Перем Приемник;
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("Структура")
		Или ТипИсточника = Тип("ФиксированнаяСтруктура") Тогда
		Приемник = КонтурСтандарт_СкопироватьСтруктуру(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("Соответствие")
		Или ТипИсточника = Тип("ФиксированноеСоответствие") Тогда
		Приемник = КонтурСтандарт_СкопироватьСоответствие(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("Массив")
		Или ТипИсточника = Тип("ФиксированныйМассив") Тогда
		Приемник = КонтурСтандарт_СкопироватьМассив(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("СписокЗначений") Тогда
		Приемник = КонтурСтандарт_СкопироватьСписокЗначений(Источник, ФиксироватьДанные);
	Иначе
		Приемник = Источник;
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции

// Дополняет структуру из источника в приемник.
//
// Параметры:
//   Приемник - Структура - структура приемника
//   Источник - Структура - структура источника
//	 Заменять - Булево - заменять значения в примнике 
//
&НаКлиенте
Процедура КонтурСтандарт_ДополнитьСтруктуру(Приемник, Источник, Заменять = Неопределено) Экспорт
	
	Для Каждого Элемент Из Источник Цикл
		Если Заменять <> Истина И Приемник.Свойство(Элемент.Ключ) Тогда
			Если Заменять = Ложь Тогда
				Продолжить;
			Иначе
				ВызватьИсключение КонтурСтандарт_ПодставитьПараметрыВСтроку("Пересечение ключей источника и приемника: ""%1"".", Элемент.Ключ);
			КонецЕсли
		КонецЕсли;
		Приемник.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
КонецПроцедуры

// Создает массив и помещает в него переданные значения.
//
// Параметры:
//  Значение1 - Произвольный - любое значение.
//  Значение2 - Произвольный
//  Значение3 - Произвольный
//  Значение4 - Произвольный
//
// Возвращаемое значение:
//  Массив
//  
// Пример:
//   Результат = ОбщегоНазначенияКлиентСервер.МассивЗначений(1, 2, 3);
&НаКлиенте
Функция КонтурСтандарт_МассивЗначений(Знач Значение1, 
	Знач Значение2 = "4bd67c947236e"
	, Знач Значение3 = "4bd67c947236e"
	, Знач Значение4 = "4bd67c947236e"
	, Знач Значение5 = "4bd67c947236e"
	, Знач Значение6 = "4bd67c947236e"
	, Знач Значение7 = "4bd67c947236e"
	, Знач Значение8 = "4bd67c947236e"
	, Знач Значение9 = "4bd67c947236e"
	, Знач Значение10 = "4bd67c947236e"
	) Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Значение1);
	
	ЗначениеПоУмолчанию = "4bd67c947236e";
	
	Если Значение2 <> ЗначениеПоУмолчанию Тогда
		Результат.Добавить(Значение2);
	КонецЕсли;
	Если Значение3 <> ЗначениеПоУмолчанию Тогда
		Результат.Добавить(Значение3);
	КонецЕсли;
	Если Значение4 <> ЗначениеПоУмолчанию Тогда
		Результат.Добавить(Значение4);
	КонецЕсли;   
	Если Значение5 <> ЗначениеПоУмолчанию Тогда
		Результат.Добавить(Значение5);
	КонецЕсли;
	Если Значение6 <> ЗначениеПоУмолчанию Тогда
		Результат.Добавить(Значение6);
	КонецЕсли;
	Если Значение7 <> ЗначениеПоУмолчанию Тогда
		Результат.Добавить(Значение7);
	КонецЕсли;
	Если Значение8 <> ЗначениеПоУмолчанию Тогда
		Результат.Добавить(Значение8);
	КонецЕсли;
	Если Значение9 <> ЗначениеПоУмолчанию Тогда
		Результат.Добавить(Значение9);
	КонецЕсли;
	Если Значение10 <> ЗначениеПоУмолчанию Тогда
		Результат.Добавить(Значение10);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Возвращает признак того, что переданное значение является, либо не является, числом.
//
// Параметры:
//  ПроверяемоеЗначение - Строка - значение, которое проверяется на соответствие числу.
//
// Возвращаемое значение:
//   Булево - признак того, что переданное значение является, либо не является, числом.
//  
&НаКлиенте
Функция КонтурСтандарт_ЭтоЧисло(Знач ПроверяемоеЗначение) Экспорт 
	
	Если ПроверяемоеЗначение = "0" Тогда
		Возврат Истина;
	КонецЕсли;
	
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	
	Возврат ОписаниеЧисла.ПривестиЗначение(ПроверяемоеЗначение) <> 0;
	
КонецФункции

// Возвращает общий модуль по имени
//
// Возвращаемое значение:
//   Модуль - общий модуль.
//
&НаКлиенте
Функция КонтурСтандарт_ОбщийМодуль(Имя) 
	
	Попытка
		
		Модуль = Вычислить(Имя);
		
	Исключение
		
		Модуль = Неопределено;
		
	КонецПопытки;
	
	Возврат Модуль;
	
КонецФункции

//// Возвращает системную информацию
//
// Возвращаемое значение:
//   СистемнаяИнформация - системная информация.
//
&НаКлиенте
Функция КонтурСтандарт_НовыйСистемнаяИнформация() Экспорт
	
	// BSLLS:UseSystemInformation-off
	Возврат Новый СистемнаяИнформация;
	// BSLLS:UseSystemInformation-on

КонецФункции

// Определяет доступны ли функции работы со строками (Платформа >= 8.3.6.1977)
//
// Возвращаемое значение:
//	Булево - функции доступны
//
&НаКлиенте
Функция КонтурСтандарт_ДоступныБазовыеСтроковыеФункции() Экспорт

	Возврат	КонтурСтандарт_ВерсияПлатформыНеНижеУказанной("8.3.6.1977") И КонтурСтандарт_ВерсияРежимСовместимостиНеНижеУказанной("8.3.6");	

КонецФункции

// Определяет доступны ли функции работы с JSON (Платформа >= 8.3.6.1977)
//
// Возвращаемое значение:
//	Булево - функции доступны
//
&НаКлиенте
Функция КонтурСтандарт_ДоступныЗаписьЧтениеJSON() Экспорт
	
	Возврат	КонтурСтандарт_ВерсияПлатформыНеНижеУказанной("8.3.6.1977");
	
КонецФункции

// Определяет доступны ли функции работы с потоками (Платформа >= 8.3.10)
//
// Возвращаемое значение:
//	Булево - функции доступны
//
&НаКлиенте
Функция КонтурСтандарт_ДоступнаРаботаСПотоками() Экспорт

	Возврат	КонтурСтандарт_ВерсияПлатформыНеНижеУказанной("8.3.10");	
	
КонецФункции

// Определяет доступны ли функции работы с двоичными данными (Платформа >= 8.3.10)
//
// Возвращаемое значение:
//	Булево - функции доступны
//
&НаКлиенте
Функция КонтурСтандарт_ДоступныМетодыДвоичныхДанных() Экспорт

	Возврат	КонтурСтандарт_ВерсияПлатформыНеНижеУказанной("8.3.10");		
	
КонецФункции

// Определяет доступны ли функции работы с расширениями конфигурациями (Платформа >= 8.3.9)
//
// Возвращаемое значение:
//	Булево - функции доступны
&НаКлиенте
Функция КонтурСтандарт_ДоступныРасширенияКонфигурации() Экспорт
	
	// полноценная работа расширений с версии 8.3.9
	Возврат КонтурСтандарт_ВерсияРежимСовместимостиНеНижеУказанной("8.3.9"); 
	
КонецФункции

// Определяет доступны ли функции работы с наборами типов расширения (Платформа >= 8.3.20)
//
// Возвращаемое значение:
//	Булево - функции доступны
//
&НаКлиенте
Функция КонтурСтандарт_ДоступныНаборыТиповРасширения() Экспорт
	
	Возврат КонтурСтандарт_ВерсияРежимСовместимостиНеНижеУказанной("8.3.20");	
	
КонецФункции

// Определяет, является ли переданное значение структурой или фиксированной структурой.
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить.
// 
// Возвращаемое значение:
//   Булево - Истина, если переданое значение является структрой или фиксированной структурой.
//
&НаКлиенте
Функция КонтурСтандарт_ЭтоСтруктура(Значение) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если Значение = Неопределено Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ТипЗначения = Тип("Структура") Тогда
		
		Результат = Истина;
		
	ИначеЕсли ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверят наличие и получает значение по указанному имени свойства из структуры или соответствия.
// 
// Параметры:
//  Структура - Структура, Соответствие - коллекция для поиска.
//	Ключ - Строка - имя свойства искомого значения
//  ЗначениеПоУмолчанию - значение по умолчанию возвращаемое, если нет свойства в коллекции 
// 
// Возвращаемое значение:
//   Произвольный - значение полученное из коллекции либо значение по умолчанию.
//
&НаКлиенте
Функция КонтурСтандарт_ЗначениеПоКлючу(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство(Ключ) Тогда
		Значение = Структура[Ключ];
	ИначеЕсли ТипЗнч(Структура) = Тип("Соответствие") И Структура.Получить(Ключ) <> Неопределено Тогда
		Значение = Структура.Получить(Ключ);
	Иначе
		Значение = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Преобразует дату по формату "yyyy-MM-ddTHH:mm:ss+00:00" в строку.
// 
// Параметры:
//  ДатаВремя - Дата - значение, которое нужно преобразовать в строку.
// 
// Возвращаемое значение:
//   Строка - Преобразованная дата по формату.
//
&НаКлиенте
Функция КонтурСтандарт_ДатаВФормате_ISO8601(ДатаВремя) Экспорт
	
	ФорматнаяСтрока = "ДФ=yyyy-MM-ddTHH:mm:ss+00:00; ДП=1970-01-01T00:00:00+00:00";
	Возврат Формат(ДатаВремя, ФорматнаяСтрока);
	
КонецФункции // ДатаВФормате_ISO8601()

// Проверят что текущая версия платформы не ниже указнной.
// 
// Параметры:
//  Версия - Строка - строка версии платформы в формате "X.X.XX.XXXX"/"Х.Х.ХХ".
// 
// Возвращаемое значение:
//   Булево - результат сравнения версий.
//
&НаКлиенте
Функция КонтурСтандарт_ВерсияПлатформыНеНижеУказанной(Версия) Экспорт
	
	МенеджерНастроек = КонтурСтандарт_МенеджерНастроек();
	
	РезультатСравнения = МенеджерНастроек.РезультатФункции_ВерсияПлатформыНеНижеУказанной.Получить(Версия);
	
	Если РезультатСравнения = Неопределено Тогда
		
		СистемнаяИнформация = КонтурСтандарт_НовыйСистемнаяИнформация();
		
	  	РезультатСравнения = (КонтурСтандарт_СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, Версия) >= 0);
		
		МенеджерНастроек.РезультатФункции_ВерсияПлатформыНеНижеУказанной.Вставить(Версия, РезультатСравнения);
		
	КонецЕсли;
	
	Возврат РезультатСравнения; 
	
КонецФункции

// Проверят что текущая версия совместимости конфигурации не ниже указнной.
// 
// Параметры:
//  Версия - Строка - строка версии платформы в формате "X.X.XX.XXXX"/"Х.Х.ХХ".
//
// Возвращаемое значение:
//   Булево - результат сравнения версий.
//
&НаКлиенте
Функция КонтурСтандарт_ВерсияРежимСовместимостиНеНижеУказанной(Версия) Экспорт 
	
	ВерсияРежимаСовместимости = КонтурСтандарт_РежимСовместимостиСтрокой_Сервер();	
	                                         
	Если ВерсияРежимаСовместимости = "НеИспользовать"
		ИЛИ ВерсияРежимаСовместимости = "DontUse" Тогда 
		                                
		Возврат КонтурСтандарт_ВерсияПлатформыНеНижеУказанной(Версия); 
		
	КонецЕсли;
	
	МенеджерНастроек = КонтурСтандарт_МенеджерНастроек();
	
	РезультатСравнения = МенеджерНастроек.РезультатФункции_ВерсияРежимСовместимостиНеНижеУказанной.Получить(Версия);
	
	Если РезультатСравнения = Неопределено Тогда
		
		ВерсияРежимаСовместимости = СтрЗаменить(ВерсияРежимаСовместимости, "Версия", "");
		ВерсияРежимаСовместимости = СтрЗаменить(ВерсияРежимаСовместимости, "Version", "");
		ВерсияРежимаСовместимости = СтрЗаменить(ВерсияРежимаСовместимости, "_", ".");
		
		РезультатСравнения = (КонтурСтандарт_СравнитьВерсии(ВерсияРежимаСовместимости, Версия) >= 0);  
		
		МенеджерНастроек.РезультатФункции_ВерсияРежимСовместимостиНеНижеУказанной.Вставить(Версия, РезультатСравнения);
		
	КонецЕсли;
	
	Возврат РезультатСравнения;  
	
КонецФункции

// Определяет режим эксплуатации информационной базы файловый (Истина) или серверный (Ложь).
// При проверке используется СтрокаСоединенияИнформационнойБазы, которую можно указать явно.
//
// См. ОбщегоНазначения.ИнформационнаяБазаФайловая
//
// Параметры:
//  СтрокаСоединенияИнформационнойБазы - Строка - параметр используется, если
//                 нужно проверить строку соединения не текущей информационной базы.
//
// Возвращаемое значение:
//  Булево - Истина, если файловая.
//
&НаКлиенте
Функция КонтурСтандарт_ИнформационнаяБазаФайловая(Знач СтрокаСоединенияИнформационнойБазы = "") Экспорт
	
	Если ПустаяСтрока(СтрокаСоединенияИнформационнойБазы) Тогда
		СтрокаСоединенияИнформационнойБазы =  СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;
	Возврат Найти(Врег(СтрокаСоединенияИнформационнойБазы), "FILE=") = 1;
	
КонецФункции    

// Разбивает строку на несколько строк, используя заданный набор разделителей.
// Если параметр РазделителиСлов не задан, то разделителем слов считается любой из символов, 
// не относящихся к символам латиницы, кириллицы, цифры, подчеркивания.
//
// Параметры:
//  Значение        - Строка - исходная строка, которую необходимо разложить на слова.
//  РазделителиСлов - Строка - перечень символов-разделителей. Например, ".,;".
//
// Возвращаемое значение:
//  Массив - список слов.
//
// Пример:
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов("один-@#два2_!три") возвратит массив значений: "один",
//  "два2_", "три"; СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов("один-@#два2_!три", "#@!_") возвратит массив
//  значений: "один-", "два2", "три".
//
&НаКлиенте
Функция КонтурСтандарт_РазложитьСтрокуВМассивСлов(Знач Строка, РазделителиСлов="", РазделительКакЕдиныйСимвол = Ложь) Экспорт
	
	Слова = Новый Массив;
	
	ДлинаРазделителя = СтрДлина(РазделителиСлов);
	
	Если ДлинаРазделителя = 1 ИЛИ РазделительКакЕдиныйСимвол Тогда
		
		НайденныйСимвол = Найти(Строка,РазделителиСлов);
		Пока НайденныйСимвол>0 Цикл
			Слова.Добавить(СокрЛП(Лев(Строка,НайденныйСимвол + ДлинаРазделителя - 2)));
			Строка = Сред(Строка,НайденныйСимвол + ДлинаРазделителя);
			НайденныйСимвол = Найти(Строка,РазделителиСлов);
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(Строка) Тогда
			Слова.Добавить(СокрЛП(Строка));
		КонецЕсли;
		
	Иначе
		
		Для Сч = 1 По СтрДлина(РазделителиСлов) Цикл
			Строка = СтрЗаменить(Строка,Сред(РазделителиСлов,Сч,1),Символы.ПС);
		КонецЦикла;
		
		Для Сч=1 По СтрЧислоСтрок(Строка) Цикл
			ТекСлово = СокрЛП(СтрПолучитьСтроку(Строка,Сч));
			Если ТекСлово<>"" Тогда
				Слова.Добавить(СокрЛП(ТекСлово));
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат Слова;
	
КонецФункции 

// Проверят что переданная строка содержит цифры.
// 
// Параметры:
//  Стр - Строка - проверяемая строка .
// 
// Возвращаемое значение:
//   Булево - результат проверки.
//
&НаКлиенте
Функция КонтурСтандарт_ЕстьЦифрыВСтроке(Стр) Экспорт
	
	Для к = 1 По СтрДлина(Стр) Цикл 
		Если Найти("0123456789",Сред(Стр,к,1))<>0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
			
КонецФункции

// Кодирует строку в соответствии с выбранным способом кодирования.
// 
// Параметры:
//  Строка - Строка - Кодируемая строка.
//  пСпособКодированияСтроки - Строка - см. метод КонтурСтандарт_СпособКодированияСтроки
//
// Возвращаемое значение:
//   Строка - результат кодирования.
//
&НаКлиенте
Функция КонтурСтандарт_КодироватьСтроку_(пСтрока, пСпособКодированияСтроки) Экспорт 
	
	Если КонтурСтандарт_ДоступныБазовыеСтроковыеФункции() Тогда  
		
		Если НЕ пСпособКодированияСтроки = КонтурСтандарт_СпособКодированияСтроки().URLВКодировкеURL
			И НЕ пСпособКодированияСтроки = КонтурСтандарт_СпособКодированияСтроки().КодировкаURL Тогда
			
			ВызватьИсключение "Неверно задан способ кодирования строки";
			
		КонецЕсли;

		Возврат Вычислить("КодироватьСтроку(пСтрока, СпособКодированияСтроки[пСпособКодированияСтроки])");
		
	Иначе
		
		Возврат КонтурСтандарт_URLEncode(пСтрока, пСпособКодированияСтроки = КонтурСтандарт_СпособКодированияСтроки().КодировкаURL);
		
	КонецЕсли;
	
КонецФункции    

// Раскодирует строку, закодированную в соответствии с указанным способом кодирования.
// 
// Параметры:
//  Строка - Строка - Закодированная строка.
//  пСпособКодированияСтроки - Строка - способ, которым была закодирована исходная строка. см. метод КонтурСтандарт_СпособКодированияСтроки
//
// Возвращаемое значение:
//   Строка - раскодированная исходная строка.
//
&НаКлиенте
Функция КонтурСтандарт_РаскодироватьСтроку_(пСтрока, пСпособКодированияСтроки) Экспорт
	
	Если КонтурСтандарт_ДоступныБазовыеСтроковыеФункции() Тогда
		
		Если НЕ пСпособКодированияСтроки = КонтурСтандарт_СпособКодированияСтроки().URLВКодировкеURL
			И НЕ пСпособКодированияСтроки = КонтурСтандарт_СпособКодированияСтроки().КодировкаURL Тогда
			
			ВызватьИсключение "Неверно задан способ кодирования строки";
			
		КонецЕсли;
		
		Возврат Вычислить("РаскодироватьСтроку(пСтрока, СпособКодированияСтроки[пСпособКодированияСтроки])");	
		
	Иначе
		
		Возврат КонтурСтандарт_URLDecode(пСтрока);
		
	КонецЕсли;
	
КонецФункции

// Варианты кодирования строк.
// 
// Возвращаемое значение:
//   Строка - "URLВКодировкеURL", "КодировкаURL".
//
&НаКлиенте
Функция КонтурСтандарт_СпособКодированияСтроки() Экспорт
	
	Структура = Новый Структура(); 
	
	Структура.Вставить("URLВКодировкеURL", "URLВКодировкеURL");
	Структура.Вставить("КодировкаURL", "КодировкаURL");
	                                    
	Возврат Структура; 
	
КонецФункции

// Преобразует переданное число в указанную систему счисления.
// 
// Параметры:
//  Данные - Число - преобразуемое число.
//  Основание - Число - число системы счисления
//
// Возвращаемое значение:
//   Строка - результат преобразования в указанную систему счисления.
//
&НаКлиенте
Функция КонтурСтандарт_ЧислоВСистемеСчисления(Знач Данные, Основание) Экспорт
	
	Словарь = КонтурСтандарт_СловарьСистемыСчисления();
	
	Результат = "";
	Пока Данные > 0 Цикл
		Результат = XMLСтрока(Словарь.Получить(Данные % Основание)) + Результат;

		Данные = Цел(Данные/Основание);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Преобразует переданную строку системы счисления в число.
// 
// Параметры:
//  Данные - Строка - преобразуемые данные в системе счисления.
//  Основание - Число - число системы счисления
//
// Возвращаемое значение:
//   Число - результат преобразования в указанную систему счисления.
//
&НаКлиенте
Функция КонтурСтандарт_ЧислоИзСистемыСчисления(Знач Данные, Основание) Экспорт
	
	Словарь = КонтурСтандарт_СловарьСистемыСчисления();
	ДанныеСтроки = XMLСтрока(ВРег(Данные));
	
	Результат = 0;
	
	Длина = СтрДлина(ДанныеСтроки);
	Для Разряд = 0 По СтрДлина(ДанныеСтроки) - 1 Цикл
		
		ЧислоСловаря = Словарь.Получить(Сред(ДанныеСтроки, Длина - Разряд, 1));
		
		Если ЧислоСловаря >= Основание Тогда
			ВызватьИсключение "Недопустимый символ в данных " + Сред(ДанныеСтроки, Длина - Разряд, 1);	
		КонецЕсли;
		
		Результат = Результат + ЧислоСловаря * Pow(Основание, Разряд);   
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Создаёт объект ФабрикаXDTO по переданному описанию xsd-схемы
//
// Параметры:
//  СтрокаXML - Строка - xml-текст xsd-схемы.
//
// Возвращаемое значение:
//   ФабрикаXDTO - объект ФабрикаXDTO по переданной xsd-схеме.
//
&НаКлиенте
Функция КонтурСтандарт_ФабрикаXDTO(СтрокаXML) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	
	ПостроительСхемXML = Новый ПостроительСхемXML;
	СхемаXML = ПостроительСхемXML.СоздатьСхемуXML(ДокументDOM);
	
	НаборСхемXML = Новый НаборСхемXML;
	НаборСхемXML.Добавить(СхемаXML);
	
	Результат = Новый ФабрикаXDTO(НаборСхемXML);
	
	Возврат Результат;
	
КонецФункции		  

// Возвращает пустой объект XDTO по переданному типу пакета XDTO фабрики
//
// Параметры:
//  Фабрика - ФабрикаXDTO - фабрика.
//  ТипПакетаXDTO - Строка - имя пакета XDTO.
//  ПространствоИмен - Строка - имя пространства имен.
//
// Возвращаемое значение:
//   ОбъектXDTO - пустой объект ОбъектXDTO по переданному типу пакета. 
//
&НаКлиенте
Функция КонтурСтандарт_ПолучитьПустойОбъектXDTO(Фабрика, ТипПакетаXDTO, ПространствоИмен = "http://www.w3.org/2001/XMLSchema") Экспорт
	
	Результат = Неопределено;

	ЧастиПути = КонтурСтандарт_РазложитьСтрокуВМассивСлов(ТипПакетаXDTO, ".");
	
	ТипОбъекта = Фабрика.Тип(ПространствоИмен, ЧастиПути[0]);
	
	ЧастиПути.Удалить(0);
	
	Коллекция = ТипОбъекта.Свойства;
	
	Пока ЗначениеЗаполнено(ЧастиПути) Цикл
		
		Если Коллекция = Неопределено Тогда
			ТипОбъекта = Неопределено;
			Прервать;
		КонецЕсли;
		
		Свойство = Коллекция.Получить(ЧастиПути[0]);
		
		Если Свойство = Неопределено Тогда
			ТипОбъекта = Неопределено;
			Прервать;
		КонецЕсли;
		
		ТипОбъекта = Свойство.Тип;
		
		ЧастиПути.Удалить(0);
		
		Попытка
			Коллекция = ТипОбъекта.Свойства;
		Исключение
			Прервать;
		КонецПопытки;
		
	КонецЦикла;
	
	Если ТипОбъекта <> Неопределено Тогда
		Результат = Фабрика.Создать(ТипОбъекта);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет наличие реквизита в объекте XDTO и устанавливает значение реквизита
//
// Параметры:
//  Элемент - ОбъектXDTO - объект XDTO.
//  ИмяРеквизита - Строка - имя реквизита.
//  ЗначениеРеквизита - Произвольный - значение реквизита.
//
&НаКлиенте
Процедура КонтурСтандарт_УстановитьЗначениеXDTO(Элемент, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	Если ЗначениеРеквизита = Неопределено
		Или ЗначениеРеквизита = Null Тогда
		Возврат;
	КонецЕсли;
	
	Элемент[ИмяРеквизита] = ЗначениеРеквизита;
	
КонецПроцедуры

// Конвертирует объект XDTO в строку XML
//
// Параметры:
//  Фабрика - ФабрикаXDTO - фабрика.
//  ОбъектXDTO - объект XDTO - объект XDTO.
//  ТипКодировки - Строка - тип кодировки.
//
// Возвращаемое значение:
//   Строка - строка XML преобразованного объекта XDTO. 
//
&НаКлиенте
Функция КонтурСтандарт_ОбъектXDTO_В_СтрокаXML(Фабрика, ОбъектXDTO, ТипКодировки = "windows-1251") Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку(ТипКодировки);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	Фабрика.ЗаписатьXML(ЗаписьXML, ОбъектXDTO,,,, НазначениеТипаXML.Неявное);
	
	СтрокаXML = ЗаписьXML.Закрыть();
	
	Возврат СтрокаXML;	
	
КонецФункции

// Создаёт дочерний объект в переданном объекте XDTO по имени и указанной фабрике
//
// Параметры:
//  Фабрика - ФабрикаXDTO - фабрика.
//  Родитель - ОбъектXDTO - объект XDTO.
//  ИмяЭлемента - Строка - имя элемента.
//  ЗначениеЭлемента - Произвольный - значение элемента.
//
// Возвращаемое значение:
//   ОбъектXDTO - созданный объект. 
//
&НаКлиенте
Функция КонтурСтандарт_НовыйДочернийОбъектXDTO(Фабрика, Родитель, ИмяЭлемента, ЗначениеЭлемента = Неопределено) Экспорт
	
	СвойствоДочернего	 = Родитель.Тип().Свойства.Получить(ИмяЭлемента);
	ТипДочернего		 = СвойствоДочернего.Тип;
	ЭтоСписок			 = СвойствоДочернего.ВерхняяГраница <> 1;
	
	Если ЗначениеЭлемента = Неопределено Тогда
		Результат = Фабрика.Создать(ТипДочернего);
	Иначе
		Результат = Фабрика.Создать(ТипДочернего, ЗначениеЭлемента);
	КонецЕсли;
	
	Если ЭтоСписок Тогда
		Родитель[ИмяЭлемента].Добавить(Результат);
	Иначе
		Родитель[ИмяЭлемента] = Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает преобразованные данные JSON
//
// Параметры:
//  Строка                       - Строка         - Строка, содержащая текст в формате JSON.
//  ПрочитатьВСоответствие       - Булево         - Если установлено Истина, чтение объекта JSON будет выполнено
//
// Возвращаемое значение:
//  Структура, Соответствие - преобразованные данные JSON в типы «1С:Предприятия».
//
&НаКлиенте
Функция КонтурСтандарт_ЗначениеИзСтрокиJSON(Знач Строка, ПрочитатьВСоответствие = Ложь) Экспорт 
	
	Если ТипЗнч(Строка) = Тип("ДвоичныеДанные") Тогда
		Строка = КонтурСтандарт_ПолучитьСтрокуИзДвоичныхДанных_(Строка);	
	КонецЕсли;
	
	Если КонтурСтандарт_ДоступныЗаписьЧтениеJSON() Тогда 
		
		ЧтениеJSON = Вычислить("Новый ЧтениеJSON");
		ЧтениеJSON.УстановитьСтроку(Строка);	
		
		Результат = Вычислить("ПрочитатьJSON(ЧтениеJSON, " + XMLСтрока(ПрочитатьВСоответствие) + ", , , ""КонтурСтандарт_ФункцияВосстановленияJSON"", ЭтаФорма)");	
		
	Иначе   
		
		Результат = КонтурСтандарт_ПрочитатьJSON_Совместимость(Строка, ПрочитатьВСоответствие);
		
	КонецЕсли;   
	
	Возврат Результат;
	
КонецФункции

// Возвращает сериализованное значение в формат JSON
//
// Параметры:
//  Значение - Произвольный	 - Объект записи JSON. Меняет состояние потока записи.
//                             Представляет собой значение произвольного типа.
//
// Возвращаемое значение:
//  Строка - возвращает сериализованное <Значение> в формат JSON.
//
&НаКлиенте
Функция КонтурСтандарт_ЗначениеВСтрокуJSON(Значение) Экспорт 
	        
	Если КонтурСтандарт_ДоступныЗаписьЧтениеJSON() Тогда 
		
		НастройкиСериализации = Вычислить("Новый НастройкиСериализацииJSON");
		НастройкиСериализации.ВариантЗаписиДаты		 = Вычислить("ВариантЗаписиДатыJSON.УниверсальнаяДата");	
		НастройкиСериализации.ФорматСериализацииДаты = Вычислить("ФорматДатыJSON.ISO");
		НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Ложь;
		
		ЗаписьJSON = Вычислить("Новый ЗаписьJSON");
		ЗаписьJSON.УстановитьСтроку();
		
		Выполнить("ЗаписатьJSON(ЗаписьJSON, Значение, НастройкиСериализации)");	
		
		Результат = ЗаписьJSON.Закрыть();	
		
	Иначе   
		
		Результат = КонтурСтандарт_ЗаписатьJSON_Совместимость(Значение);
		
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

// Возвращает дату преобразованную из тиков
//
// Параметры:
//  Ticks - Число	 - количество в тиках.
//
// Возвращаемое значение:
//  Дата - дата преобразованная из числа тиков.
//
&НаКлиенте
Функция КонтурСтандарт_Ticks_To_Date(Ticks) Экспорт
	
	КоличествоТиковВМиллисекунде = 10000;
	КоличествоМиллисекундВСекунде = 1000;
	
	Результат = XMLЗначение(Тип("Дата"), XMLСтрока('00010101' + Ticks / (КоличествоТиковВМиллисекунде * КоличествоМиллисекундВСекунде)));
	
	Возврат Результат;
	
КонецФункции

// Возвращает количество тиков из даты
//
// Параметры:
//  Date - Дата	- дата и время.
//
// Возвращаемое значение:
//  Число - возвращает преобразованное значение даты в тиках.
//
&НаКлиенте
Функция КонтурСтандарт_Date_To_Ticks(Date) Экспорт
	
	КоличествоТиковВМиллисекунде = 10000;
	КоличествоМиллисекундВСекунде = 1000;

	Результат = Формат((Дата(Date) - '00010101') * КоличествоТиковВМиллисекунде * КоличествоМиллисекундВСекунде, "ЧГ=");
	
	Возврат Результат;
	
КонецФункции

// Возвращает разность массивов. Разностью двух массивов является массив, содержащий
// все элементы первого массива, не существующие во втором массиве.
//
// Параметры:
//  Массив - Массив - массив элементов, из которого необходимо выполнить вычитание;
//  МассивВычитания - Массив - массив элементов, который будет вычитаться.
// 
// Возвращаемое значение:
//  Массив - разностью двух массивов.
//
// Пример:
//	//А = [1, 3, 5, 7];
//	//В = [3, 7, 9];
//	Результат = ОбщегоНазначенияКлиентСервер.РазностьМассивов(А, В);
//	//Результат = [1, 5];
//
&НаКлиенте
Функция КонтурСтандарт_РазностьМассивов(Знач Массив, Знач МассивВычитания) Экспорт
	
	Результат = Новый Массив;
	Для Каждого Элемент Из Массив Цикл
		Если МассивВычитания.Найти(Элемент) = Неопределено Тогда
			Результат.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// Конструктор объекта ОписаниеОповещения
//
// Параметры:
//  ИмяПроцедуры - Строка - имя экспортируемой процедуры модуля
//  Модуль - ФормаКлиентскогоПриложения - для вызова метода модуля указанной формы
//         - КомандаКомандногоИнтерфейса - для вызова метода модуля команды командного интерфейса
//         - ОбщийМодуль - для вызова метода общего неглобального модуля
//  ДополнительныеПараметры - Произвольный - значение любого типа, которое будет передано в вызываемую функцию
//  ИмяПроцедурыОбработкиОшибки - Строка - имя экспортируемой процедуры модуля, которая будет вызвана при ошибке
//  МодульОбработкиОшибки - см. Модуль - аналогичный модуль для обработки ошибки
//
// Возвращаемое значение:
//   ОписаниеОповещения, ФиксированнаяСтруктура - Описание оповещения
//
&НаКлиенте
Функция КонтурСтандарт_ОписаниеОповещения(ИмяПроцедуры, Модуль,
		ДополнительныеПараметры = Неопределено,
		ИмяПроцедурыОбработкиОшибки = Неопределено,
		МодульОбработкиОшибки = Неопределено) Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ИмяПроцедуры);
	МассивПараметров.Добавить(Модуль);
	МассивПараметров.Добавить(ДополнительныеПараметры);
	
	Если ИмяПроцедурыОбработкиОшибки <> Неопределено
		И МодульОбработкиОшибки <> Неопределено Тогда
		МассивПараметров.Добавить(ИмяПроцедурыОбработкиОшибки);
		МассивПараметров.Добавить(МодульОбработкиОшибки);
	КонецЕсли;
	
	Попытка
		ОписаниеОповещения = Новый(Тип("ОписаниеОповещения"), МассивПараметров);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();

		ОписаниеОповещения = Новый Структура;
		ОписаниеОповещения.Вставить("ИмяПроцедуры", ИмяПроцедуры);
		ОписаниеОповещения.Вставить("Модуль", Модуль);
		ОписаниеОповещения.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
		ОписаниеОповещения.Вставить("ИмяПроцедурыОбработкиОшибки", ИмяПроцедурыОбработкиОшибки);
		ОписаниеОповещения.Вставить("МодульОбработкиОшибки", МодульОбработкиОшибки);
		ОписаниеОповещения = Новый ФиксированнаяСтруктура(ОписаниеОповещения);
	КонецПопытки;
	
	Возврат ОписаниеОповещения;
	
КонецФункции // ОписаниеОповещения

// Запускает выполнение процедуры (или функции), описанной в параметре <ВыполняемоеОповещение>.
//
// Параметры:
//  ВыполняемоеОповещение - ОписаниеОповещения - Содержит описание процедуры, вызов которой будет произведен
//  Результат - Произвольный - Значение, которое будет передано в процедуру, описанную
//    параметром <ВыполняемоеОповещение>. Необязательный, значение по умолчанию Ложь.
//
&НаКлиенте
Процедура КонтурСтандарт_ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Результат = Null) Экспорт
	
	Если ВыполняемоеОповещение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыполняемоеОповещение) = Тип("ФиксированнаяСтруктура") Тогда
		Если Результат = Null Тогда
			МассивПараметров = Неопределено;
		Иначе
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Результат);
		КонецЕсли;
		КонтурСтандарт_ВыполнитьОбработкуОповещенияСлужебный(ВыполняемоеОповещение, МассивПараметров);
	Иначе
		Выполнить("ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Результат);");
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьОбработкуОповещенияЛок

&НаКлиенте
Процедура КонтурСтандарт_ВыполнитьОбработкуОповещенияСлужебный(ВыполняемоеОповещение, МассивПараметров = Неопределено)
	
	Если ВыполняемоеОповещение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрокаПараметров = Новый Массив;
	Если ТипЗнч(МассивПараметров) = Тип("Массив")
		ИЛИ ТипЗнч(МассивПараметров) = Тип("ФиксированныйМассив") Тогда
		Для Сч = 0 По МассивПараметров.ВГраница() Цикл
			МассивСтрокаПараметров.Добавить("МассивПараметров[" + Формат(Сч, "ЧН=0; ЧГ=0") + "]");
		КонецЦикла;
	КонецЕсли;
	МассивСтрокаПараметров.Добавить("ВыполняемоеОповещение.ДополнительныеПараметры");
	СтрокаПараметров = КонтурСтандарт_СтрСоединить_(МассивСтрокаПараметров, ", ");
	
	Скрипт = "ВыполняемоеОповещение.Модуль.%1(%2)";
	Скрипт = СтрЗаменить(Скрипт, "%1", ВыполняемоеОповещение.ИмяПроцедуры);
	Скрипт = СтрЗаменить(Скрипт, "%2", СтрокаПараметров);
	
	Выполнить(Скрипт);
	
КонецПроцедуры // ВыполнитьОбработкуОповещенияСлужебный

// #КонецОбласти

// #Область Служебный_интерфейс

&НаКлиенте
Функция КонтурСтандарт_НовыйМенеджерНастроек()
	
	МенеджерНастроек = Новый Структура;
	
    МенеджерНастроек.Вставить("РезультатФункции_ВерсияПлатформыНеНижеУказанной");
	МенеджерНастроек.Вставить("РезультатФункции_ВерсияРежимСовместимостиНеНижеУказанной");
	
	Возврат МенеджерНастроек;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_СтрРазделить_Совместимость(Строка, Разделитель, ВключатьПустые = Истина)
	
	ПропускатьПустыеСтроки = НЕ ВключатьПустые;	
	Результат = Новый Массив;
	
	НачалоСтроки = 1;
	
	Для Позиция = 1 По СтрДлина(Строка) Цикл 
		Символ = Сред(Строка, Позиция, 1);
		Если Найти(Разделитель, Символ) > 0 Тогда
			Результат.Добавить(Сред(Строка, НачалоСтроки, Позиция - НачалоСтроки));	
			НачалоСтроки = Позиция + 1;
		КонецЕсли;
	КонецЦикла;
	
	Значение = Сред(Строка, НачалоСтроки, Позиция - НачалоСтроки);
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Значение) Тогда
		Результат.Добавить(Значение);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция КонтурСтандарт_РежимСовместимостиСтрокой_Сервер()
	
	Возврат Строка(Метаданные.РежимСовместимости);	
	
КонецФункции

// Вставляет параметры в строку, учитывая, что в параметрах могут использоваться подстановочные слова %1, %2 и т.д. 
&НаКлиенте
Функция КонтурСтандарт_ПодставитьПараметрыСПроцентом(Знач СтрокаПодстановки, Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,	
													Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
													Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено,
													Знач Параметр10 = Неопределено)
	
	Результат = "";
	Позиция = КонтурСтандарт_СтрНайти_(СтрокаПодстановки, "%");
		
	КартаПараметров = Новый Соответствие;
	КартаПараметров.Вставить("1", Параметр1);
	КартаПараметров.Вставить("(1)", Параметр1);
	КартаПараметров.Вставить("2", Параметр2);
	КартаПараметров.Вставить("(2)", Параметр2);
	КартаПараметров.Вставить("3", Параметр3);
	КартаПараметров.Вставить("(3)", Параметр3);
	КартаПараметров.Вставить("4", Параметр4);
	КартаПараметров.Вставить("(4)", Параметр4);
	КартаПараметров.Вставить("5", Параметр5);
	КартаПараметров.Вставить("(5)", Параметр5);
	КартаПараметров.Вставить("6", Параметр6);
	КартаПараметров.Вставить("(6)", Параметр6);
	КартаПараметров.Вставить("7", Параметр7);
	КартаПараметров.Вставить("(7)", Параметр7);
	КартаПараметров.Вставить("8", Параметр8);
	КартаПараметров.Вставить("(8)", Параметр8);
	КартаПараметров.Вставить("9", Параметр9);
	КартаПараметров.Вставить("(9)", Параметр9);
	КартаПараметров.Вставить("10", Параметр10);
	КартаПараметров.Вставить("(10)", Параметр10);

	Пока Позиция > 0 Цикл
		Результат = Результат + Лев(СтрокаПодстановки, Позиция - 1);
		СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, 1);
		Если СимволПослеПроцента = "(" Тогда
			СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, КонтурСтандарт_СтрНайти_(СтрокаПодстановки, ")", , Позиция) - Позиция);
		КонецЕсли;
		Если Сред(СтрокаПодстановки, Позиция + 1 + 1, 1) = "0" Тогда
			СимволПослеПроцента = СимволПослеПроцента + "0";
		КонецЕсли;
		ПодставляемыйПараметр = КартаПараметров.Получить(СимволПослеПроцента);
		Если ПодставляемыйПараметр = Неопределено Тогда
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + СтрДлина(СимволПослеПроцента) + 1);
		Иначе
			Результат = Результат + ПодставляемыйПараметр;
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + СтрДлина(СимволПослеПроцента) + 1);
		КонецЕсли;
		Позиция = КонтурСтандарт_СтрНайти_(СтрокаПодстановки, "%");
	КонецЦикла;
	
	Результат = Результат + СтрокаПодстановки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_СкопироватьСтруктуру(СтруктураИсточник, ФиксироватьДанные) 
	
	СтруктураРезультат = Новый Структура;
	
	Для Каждого КлючИЗначение Из СтруктураИсточник Цикл
		СтруктураРезультат.Вставить(КлючИЗначение.Ключ, 
		КонтурСтандарт_СкопироватьРекурсивно(КлючИЗначение.Значение, ФиксироватьДанные));
	КонецЦикла;
	
	Если ФиксироватьДанные = Истина 
		Или ФиксироватьДанные = Неопределено
		И ТипЗнч(СтруктураИсточник) = Тип("ФиксированнаяСтруктура") Тогда 
		Возврат Новый ФиксированнаяСтруктура(СтруктураРезультат);
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_СкопироватьСоответствие(СоответствиеИсточник, ФиксироватьДанные) 
	
	СоответствиеРезультат = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из СоответствиеИсточник Цикл
		СоответствиеРезультат.Вставить(КлючИЗначение.Ключ, 
		КонтурСтандарт_СкопироватьРекурсивно(КлючИЗначение.Значение, ФиксироватьДанные));
	КонецЦикла;
	
	Если ФиксироватьДанные = Истина 
		Или ФиксироватьДанные = Неопределено
		И ТипЗнч(СоответствиеИсточник) = Тип("ФиксированноеСоответствие") Тогда 
		Возврат Новый ФиксированноеСоответствие(СоответствиеРезультат);
	КонецЕсли;
	
	Возврат СоответствиеРезультат;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_СкопироватьМассив(МассивИсточник, ФиксироватьДанные) 
	
	МассивРезультат = Новый Массив;
	
	Для Каждого Элемент Из МассивИсточник Цикл
		МассивРезультат.Добавить(КонтурСтандарт_СкопироватьРекурсивно(Элемент, ФиксироватьДанные));
	КонецЦикла;
	
	Если ФиксироватьДанные = Истина 
		Или ФиксироватьДанные = Неопределено
		И ТипЗнч(МассивИсточник) = Тип("ФиксированныйМассив") Тогда 
		Возврат Новый ФиксированныйМассив(МассивРезультат);
	КонецЕсли;
	
	Возврат МассивРезультат;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_СкопироватьСписокЗначений(СписокИсточник, ФиксироватьДанные)
	
	СписокРезультат = Новый СписокЗначений;
	
	Для Каждого ЭлементСписка Из СписокИсточник Цикл
		СписокРезультат.Добавить(
		КонтурСтандарт_СкопироватьРекурсивно(ЭлементСписка.Значение, ФиксироватьДанные), 
		ЭлементСписка.Представление, 
		ЭлементСписка.Пометка, 
		ЭлементСписка.Картинка);
	КонецЦикла;
	
	Возврат СписокРезультат;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_URLEncode(стр, КодироватьСпецсимволы = Истина)	
	
	СпецсимволыМассив = КонтурСтандарт_СтрРазделить_("! # $ % & ' ( ) * + , / : ; = ? @ [ ]", " ");
	
	_РежимОтладки = Ложь;
	Если _РежимОтладки Тогда
		Длина = СтрДлина(Стр);
		Итог = "";
		
		Для Н=1 По Длина Цикл
			Знак = Сред(Стр, Н, 1);
			Код = КодСимвола(Знак);
			
			Если ((Знак >= "a") И (Знак <= "z")) или
				((Знак >= "A") И (Знак <= "Z")) или
				((Знак>="0") И (Знак <= "9")) 
				или Знак = "." 
				ИЛИ Знак = "-" 
				ИЛИ Знак = "_" 
				ИЛИ Знак = "~" 
				ИЛИ (НЕ КодироватьСпецсимволы И СпецсимволыМассив.Найти(Знак) <> Неопределено)  тогда
				
				Итог = Итог + Знак;
			Иначе
				Если (Код >= КодСимвола("А")) И (Код <= КодСимвола("п")) Тогда
					Итог = Итог + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(208, 16) + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(144 + Код - КодСимвола("А"), 16);
				ИначеЕсли (Код >= КодСимвола("р")) И (Код <= КодСимвола("я")) Тогда
					Итог = Итог + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(209, 16) + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(128 + Код - КодСимвола("р"), 16);
				ИначеЕсли (Знак = "ё") Тогда
					Итог = Итог + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(209, 16) + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(145, 16);
				ИначеЕсли (Знак="Ё") Тогда
					Итог = Итог + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(208, 16) + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(129, 16);
				Иначе
					Итог = Итог + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(Код, 16);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Итог;
	Иначе  
		Длина = СтрДлина(Стр);		Итог = "";				Для Н=1 По Длина Цикл			Знак = Сред(Стр, Н, 1);			Код = КодСимвола(Знак);						Если ((Знак >= "a") И (Знак <= "z")) или				((Знак >= "A") И (Знак <= "Z")) или				((Знак>="0") И (Знак <= "9")) 				или Знак = "." 				ИЛИ Знак = "-" 				ИЛИ Знак = "_" 				ИЛИ Знак = "~" 				ИЛИ (НЕ КодироватьСпецсимволы И СпецсимволыМассив.Найти(Знак) <> Неопределено)  тогда								Итог = Итог + Знак;			Иначе				Если (Код >= КодСимвола("А")) И (Код <= КодСимвола("п")) Тогда					Итог = Итог + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(208, 16) + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(144 + Код - КодСимвола("А"), 16);				ИначеЕсли (Код >= КодСимвола("р")) И (Код <= КодСимвола("я")) Тогда					Итог = Итог + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(209, 16) + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(128 + Код - КодСимвола("р"), 16);				ИначеЕсли (Знак = "ё") Тогда					Итог = Итог + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(209, 16) + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(145, 16);				ИначеЕсли (Знак="Ё") Тогда					Итог = Итог + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(208, 16) + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(129, 16);				Иначе					Итог = Итог + "%" + КонтурСтандарт_ЧислоВСистемеСчисления(Код, 16);				КонецЕсли;			КонецЕсли;		КонецЦикла;				Возврат Итог;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_URLDecode(URL)
	
	ДлинаСтроки = СтрДлина(URL);
	Инд = 1;
	Результат = "";
	ПолныйКод = 0;
	ОсталосьСимволов = 0;
	
	Пока Инд <= ДлинаСтроки Цикл
		
		Код = КодСимвола(URL, Инд);
		
		Если Код = 37 Тогда
			// Символ(37) = «%»
			Код = КонтурСтандарт_ЧислоИзСистемыСчисления(Сред(URL, Инд+1, 2), 16);
			Инд = Инд + 2;
		ИначеЕсли ОсталосьСимволов = 0 Тогда   
			Результат = Результат + Символ(Код);
			Инд = Инд + 1;
			Продолжить;
		КонецЕсли;
		
		Если Код <= 127 Тогда
			// Код = 0b0ххххххх
			Результат = Результат + Символ(Код);
		ИначеЕсли Код <= 191 Тогда
			// Код = 0b10хххххх
			ПолныйКод = (ПолныйКод*64) + (Код%64); // shl(ПолныйКод, 6) + (Код & 0x3F)
			ОсталосьСимволов = ОсталосьСимволов - 1;
			Если ОсталосьСимволов = 0 Тогда
				Результат = Результат + Символ(ПолныйКод);
			КонецЕсли;
		ИначеЕсли Код <= 223 Тогда
			// Код = 0b110ххххх
			ПолныйКод = Код % 32; // Код & 0x1F
			ОсталосьСимволов = 1;
		ИначеЕсли Код <= 239 Тогда
			// Код = 0b1110хххх
			ПолныйКод = Код % 16; // Код & 0x0F
			ОсталосьСимволов = 2;
		ИначеЕсли Код <= 247 Тогда
			// Код = 0b11110ххх
			ПолныйКод = Код % 8; // Код & 0x07
			ОсталосьСимволов = 3;
		ИначеЕсли Код <= 251 Тогда
			// Код = 0b111110хх
			ПолныйКод = Код % 4; // Код & 0x03
			ОсталосьСимволов = 4;
		ИначеЕсли Код <= 253 Тогда
			// Код = 0b1111110х
			ПолныйКод = Код % 2; // Код & 0x01
			ОсталосьСимволов = 5;
		КонецЕсли;
		
		Инд = Инд + 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_СловарьСистемыСчисления()
	
	Результат = Новый Соответствие;
	Источник = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	Для НомерСимвола = 1 По СтрДлина(Источник) Цикл
		Результат.Вставить(НомерСимвола - 1, Сред(Источник, НомерСимвола, 1));
		Результат.Вставить(Сред(Источник, НомерСимвола, 1), НомерСимвола - 1);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_ПрочитатьJSON_Совместимость(ЗНАЧ Текст, ПрочитатьВСоответствие = Ложь) Экспорт
	
	Перем Замены;
	
	// Выполним замену экранируемых символов. Конечно же, такие гуиды в тексте никогда не встретятся ))
	Замены = Новый Массив;
	Замены.Добавить(Новый Структура("Что,Чем",	"\\",	Строка(Новый УникальныйИдентификатор)));
	Замены.Добавить(Новый Структура("Что,Чем",	"\""",	Строка(Новый УникальныйИдентификатор)));
	
	КонтурСтандарт_ВыполнитьЗаменыДоОбработки(Текст,Замены);
	
	// Нарежем текст на куски, он будет быстрее обрабатываться
	СимволыДляПереноса = "{}[]:,";
	Для Сч=1 По СтрДлина(СимволыДляПереноса) Цикл
		ТекСимвол = Сред(СимволыДляПереноса, Сч, 1);
		Текст = СтрЗаменить(Текст, ТекСимвол, Символы.ПС + ТекСимвол + Символы.ПС);
	КонецЦикла;
	
	// Преобразуем текст в Массив строк, так обрабатывается гораздо быстрее
	МассивСтрок = КонтурСтандарт_ТекстВМассивСтрок(Текст);
	
	ВсегоСтрок = МассивСтрок.Количество();
	НомерТекущейСтроки = 1;
	
	// Распарсим
	Результат = КонтурСтандарт_ОбработатьТекущееЗначение(НомерТекущейСтроки, ВсегоСтрок, МассивСтрок, ПрочитатьВСоответствие);
	
	// Вернем на место экранированные символы.
	КонтурСтандарт_ВыполнитьЗаменыПослеОбработки(Результат, Замены);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КонтурСтандарт_ВыполнитьЗаменыДоОбработки(Текст, Замены)
	
	// Экранируются только 2 символа: \ "
	// Экранируются, причем, символом \
	
	// "Name": "Тест [ , %  / \\ \" {",

	Для Каждого Элемент Из Замены Цикл
		
		Текст = СтрЗаменить(Текст,Элемент.Что, Элемент.Чем);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КонтурСтандарт_ВыполнитьЗаменыПослеОбработки(Результат, Замены)
	
	ТекстСЗаменами = ЗначениеВСтрокуВнутр(Результат);

	Для Каждого Элемент Из Замены Цикл
		
		Если Элемент.Что = "\\" Тогда
			ТекстСЗаменами = СтрЗаменить(ТекстСЗаменами, Элемент.Чем, "\");
		ИначеЕсли Элемент.Что = "\""" Тогда
			ТекстСЗаменами = СтрЗаменить(ТекстСЗаменами, Элемент.Чем, """""");
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = ЗначениеИзСтрокиВнутр(ТекстСЗаменами);
	
КонецПроцедуры

&НаКлиенте
Функция КонтурСтандарт_ОбработатьТекущееЗначение(НомерТекущейСтроки, ВсегоСтрок, МассивСтрок, ПрочитатьВСоответствие = Ложь)
	
	Пока НомерТекущейСтроки <= ВсегоСтрок Цикл
		
		ТекСтрока = СокрЛП(МассивСтрок[НомерТекущейСтроки]);
	
		Если ПустаяСтрока(ТекСтрока) Тогда
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;
			Продолжить;
			
		ИначеЕсли СтрДлина(ТекСтрока) = 1 Тогда
			
			Если ТекСтрока = "{" Тогда
				
				// Начинается новая структура.
				Результат = КонтурСтандарт_ОбработатьНовуюСтруктуру(НомерТекущейСтроки, ВсегоСтрок, МассивСтрок, ПрочитатьВСоответствие);
				Возврат Результат;
				
			ИначеЕсли ТекСтрока = "[" Тогда
				
				// Начинается новый массив.
				Результат = КонтурСтандарт_ОбработатьНовыйМассив(НомерТекущейСтроки, ВсегоСтрок, МассивСтрок, ПрочитатьВСоответствие);
				Возврат Результат;
				
			ИначеЕсли ТекСтрока = "," или ТекСтрока = ":" Тогда
			//	или ТекСтрока="""" Тогда
				
				// пустота, идем дальше
				
			Иначе// Таки значение
				
				Результат = КонтурСтандарт_ОбработатьКонечноеЗначение(НомерТекущейСтроки, ВсегоСтрок, МассивСтрок);
				Возврат Результат;
				
			КонецЕсли;
				
		ИначеЕсли СокрЛП(ТекСтрока = "") Тогда
			
				// Пустота, идем дальше
				
		Иначе
			
			// Мы попадаем на конечное значение. Оно может быть в кавычках или без
			Результат = КонтурСтандарт_ОбработатьКонечноеЗначение(НомерТекущейСтроки, ВсегоСтрок, МассивСтрок);
			Возврат Результат;
			
		КонецЕсли;
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_ОбработатьКонечноеЗначение(НомерТекущейСтроки, ВсегоСтрок, МассивСтрок)
	
	// В этой строке может быть: одна кавычка, две, ноль
	НачальнаяСтрока = СокрЛП(МассивСтрок[НомерТекущейСтроки]);
	КавычкаОткрыта = (Лев(НачальнаяСтрока, 1) = """");
	КавычкаЗакрыта = (Прав(НачальнаяСтрока, 1) = """") И СтрДлина(НачальнаяСтрока) > 1;
	ЧислоКавычек = 0;
	
	Если КавычкаОткрыта И КавычкаЗакрыта Тогда
		
		Результат = НачальнаяСтрока;
		Результат = СтрЗаменить(Результат, """", "");
		
	ИначеЕсли Не КавычкаЗакрыта И не КавычкаОткрыта Тогда
		
		// Тут еще будут преобразования: булево, числа, даты
		Результат = НачальнаяСтрока;
		
		Если Результат = "true" Тогда
			Возврат Истина;
		ИначеЕсли Результат = "false" Тогда
			Возврат Ложь;
		ИначеЕсли КонтурСтандарт_ЭтоЧисло(Результат) Тогда
			Возврат Число(Результат); 
		ИначеЕсли Результат = "null" И ЧислоКавычек = 0 Тогда
			Возврат Неопределено;	
		КонецЕсли;
		
		Возврат Результат;
		
	Иначе// Многострочное значение, склеим
		//и оно началось с кавычки
		
		Результат = НачальнаяСтрока;
		Пока НомерТекущейСтроки < ВсегоСтрок Цикл
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;
		
			ТекСтрока = МассивСтрок[НомерТекущейСтроки];
			
			Результат = Результат + ТекСтрока;
			
			Если Найти(ТекСтрока, """") > 0 Тогда 
				Результат = СокрЛП(Сред(Результат, 2, СтрДлина(Результат) - 2));// уберем левую и правую кавычку
				Возврат КонтурСтандарт_ЗначениеJSON(Результат);// Вернемся тогда, когда значение кончится, т.е. встретится кавычка (мы ведь все экранированные кавычки поменяли на гуиды)
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_ОбработатьНовуюСтруктуру(НомерТекущейСтроки, ВсегоСтрок, МассивСтрок, ПрочитатьВСоответствие = Ложь)
	Если ПрочитатьВСоответствие Тогда
		Результат = Новый Соответствие; 	
	Иначе		
		Результат = Новый Структура;     
	КонецЕсли;
	
	Пока НомерТекущейСтроки < ВсегоСтрок Цикл
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		
		ТекСтрока = МассивСтрок[НомерТекущейСтроки];
		
		Если ТекСтрока = "}" Тогда
			// Структура закончилась
			Возврат Результат;

		ИначеЕсли ТекСтрока = "," Тогда
			
			Продолжить;// Дальше должен быть еще одна пара ключ-значение
			
		ИначеЕсли СокрЛП(ТекСтрока) = "" Тогда//пробелы и т.д.
			
			Продолжить;
			
		Иначе// Будем считать, что началась пара ключ-значение
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;
			ТекЗначение = КонтурСтандарт_ОбработатьТекущееЗначение(НомерТекущейСтроки, ВсегоСтрок, МассивСтрок, ПрочитатьВСоответствие);
			Результат.Вставить(СтрЗаменить(ТекСтрока, """", ""),ТекЗначение);

		КонецЕсли;
	
	КонецЦикла;
	
	НомерТекущейСтроки = НомерТекущейСтроки + 1;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_ОбработатьНовыйМассив(НомерТекущейСтроки, ВсегоСтрок, МассивСтрок, ПрочитатьВСоответствие)
	
	Результат = Новый Массив;
	
	Пока НомерТекущейСтроки < ВсегоСтрок Цикл
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		
		ТекСтрока = СокрЛП(МассивСтрок[НомерТекущейСтроки]);
		
		Если ТекСтрока = "]" Тогда
			// Массив кончился, выходим, оставаясь на текущей строке
			Возврат Результат;
			
		ИначеЕсли ТекСтрока = "," Тогда
			
			// Будет еще один элемент массива
			Продолжить;
			
		ИначеЕсли СокрЛП(ТекСтрока) = "" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Результат.Добавить(КонтурСтандарт_ОбработатьТекущееЗначение(НомерТекущейСтроки, ВсегоСтрок, МассивСтрок, ПрочитатьВСоответствие));
		
	КонецЦикла;
	
	//можно добавить проверку, что именно кончилось: массив или файл
	НомерТекущейСтроки = НомерТекущейСтроки + 1;
	
	Возврат Результат;
	
КонецФункции 

&НаСервереБезКонтекста
Функция КонтурСтандарт_ТекстВМассивСтрок(ЗНАЧ мТекст)
	
	мТекст = Символы.ПС + мТекст + Символы.ПС;// Чтобы точно было больше 1 строки
	
	мЧислоСтрок = СтрЧислоСтрок(мТекст);
	
	мТекст = СтрЗаменить(мТекст, """", """"""); // Одинарные кавычки на двойные
	мТекст = СтрЗаменить(мТекст, Символы.ПС, """}," + Символы.ПС + "{""S"","""); 
	
	мТекст = "{""#"",51e7a0d2-530b-11d4-b98a-008048da3034,
	|{" + Формат(мЧислоСтрок + 1, "ЧГ=0") + ",
	|" //+ 1 фиктивный элемент
	+ "{""S"",""" 
	
	+ мТекст
	
	+ """}"// Фиктивный элемент массива в конце, чтоб избежать проблем с запятой
	+ "
	|}
	|}";
	
	Возврат ЗначениеИзСтрокиВнутр(мТекст);
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_ЗаписатьJSON_Совместимость(Значение) Экспорт
	
	Разделитель = "";
	
	ТипЗн = ТипЗнч(Значение);

	Если ТипЗн = Тип("Строка") Тогда
		Стр = """" + КонтурСтандарт_ЭкранироватьЗаменитьНедопустимыеСимволы(Значение) + """";

	ИначеЕсли ТипЗн = Тип("Число") Или ТипЗнч(Значение) = Тип("Булево") Тогда
		Стр = XMLСтрока(Значение);

	ИначеЕсли ТипЗн = Тип("Дата") Тогда
		Стр = """" + ?(ЗначениеЗаполнено(Значение), XMLСтрока(Значение), "") + """";

	ИначеЕсли ТипЗн = Тип("Структура") 
		Или ТипЗн = Тип("Соответствие") 
		Или ТипЗн = Тип("ФиксированнаяСтруктура")
		Или ТипЗн = Тип("ФиксированноеСоответствие")
		Тогда
		Стр = "{";
		Для Каждого Параметр Из Значение Цикл
			Стр = Стр + Разделитель + Символы.ПС + """" + Параметр.Ключ + """:" + КонтурСтандарт_ЗаписатьJSON_Совместимость(Параметр.Значение);
			Разделитель = ",";
		КонецЦикла;
		Стр = Стр + Символы.ПС + "}";

	ИначеЕсли ТипЗн = Тип("Массив")
		ИЛИ ТипЗн = Тип("ФиксированныйМассив") Тогда
		Стр = "[";
		Для Каждого Элемент Из Значение Цикл
			Стр = Стр + Разделитель + Символы.ПС + КонтурСтандарт_ЗаписатьJSON_Совместимость(Элемент);
			Разделитель = ",";
		КонецЦикла;
		Стр = Стр + Символы.ПС + "]";

	ИначеЕсли ТипЗн = Тип("ТаблицаЗначений") Тогда
		Колонки = Значение.Колонки;
		Массив = Новый Массив;
		Для Каждого СтрокаТЗ Из Значение Цикл
			Структура = Новый Структура;
			Для Каждого Колонка Из Колонки Цикл
				Структура.Вставить(Колонка.Имя, СтрокаТЗ[Колонка.Имя]);
			КонецЦикла;
			Массив.Добавить(Структура);
		КонецЦикла;
		Стр = КонтурСтандарт_ЗаписатьJSON_Совместимость(Массив);

	ИначеЕсли Значение = Неопределено Тогда
		Стр = "null";

	Иначе
		Стр = """" + КонтурСтандарт_ЭкранироватьЗаменитьНедопустимыеСимволы(Значение) + """";
	КонецЕсли;

	Возврат Стр;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_ЭкранироватьЗаменитьНедопустимыеСимволы(Стр)
	
	Результат = СтрЗаменить(Стр			, "\"	, "\\");
	Результат = СтрЗаменить(Результат	, """"	, "\""");
	Результат = СтрЗаменить(Результат	, "/"	, "\/");
	
	Результат = СтрЗаменить(Результат, Символ(8)	, "\b");
	Результат = СтрЗаменить(Результат, Символы.ПФ	, "\f");
	Результат = СтрЗаменить(Результат, Символы.ПС	, "\n");
	Результат = СтрЗаменить(Результат, Символы.ВК	, "\r");
	Результат = СтрЗаменить(Результат, Символы.ВТаб	, "\t");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_ФункцияВосстановленияJSON(Свойство, Значение, ДополнительныеПараметры) Экспорт 
	
	Возврат	КонтурСтандарт_ЗначениеJSON(Значение)	
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_ЗначениеJSON(ЗначениеJSON)
	
	Значение = ЗначениеJSON;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		
		Если Найти(Значение, "T")= 11 Тогда

			Попытка   
				
				Если КонтурСтандарт_ДоступныЗаписьЧтениеJSON() Тогда
					
					Значение = Вычислить("ПрочитатьДатуJSON(ЗначениеJSON, ФорматДатыJSON.ISO)");   
					
				Иначе
					
					Значение = КонтурСтандарт_КонвертироватьДатуISO(ЗначениеJSON);
					
				КонецЕсли; 
				
			Исключение   
				// не удалось конвертировать дату	
			КонецПопытки;
			
			
		КонецЕсли;
				
	КонецЕсли;  
	
	Возврат Значение;
	
КонецФункции

&НаКлиенте
Функция КонтурСтандарт_КонвертироватьДатуISO(Дата) Экспорт
		
	Если ПустаяСтрока(Дата) Тогда 
		АвтоконвертированнаяДата = Дата(1, 1, 1);
	Иначе
		Попытка
			АвтоконвертированнаяДата = XMLЗначение(Тип("Дата"), Дата);
			
			Миллисекунды = Сред(Дата, 21);
			Миллисекунды = СокрЛП(СтрЗаменить(Миллисекунды, "Z", ""));
			
			Если НЕ ПустаяСтрока(Миллисекунды) Тогда
				
				ЧислоМиллисекунд = Число(Миллисекунды);
				
				Если ЧислоМиллисекунд >= 500 Тогда
					
					АвтоконвертированнаяДата = АвтоконвертированнаяДата - 1;
					
				КонецЕсли;
				
			КонецЕсли;
		Исключение  
			ВызватьИсключение "Не удалось конвертировать дату ISO8601 в дату 1С"	
		КонецПопытки;
		
	КонецЕсли; 
		
	Возврат АвтоконвертированнаяДата;
	
КонецФункции 

&НаКлиенте
Функция КонтурСтандарт_ХешированиеFNV1A128(Знач Данные)
	
	Перем Хеш, Байт, Бит;
	
	_РежимОтладки = Ложь;
	
	Если _РежимОтладки Тогда
		FNV_size = Pow(2, 128);
		FNV_prime = 309485009821345068724781371;
		Хеш = 144066263297769815596495629667062367629;

		ДанныеСтроки = XMLСтрока(Данные);
		
		Для НомерСимвола = 1 По СтрДлина(ДанныеСтроки) Цикл
			Байт = КодСимвола(ДанныеСтроки, НомерСимвола);
			
			Число1 = Хеш;
			Число2 = Байт;
			
			Бит = 1;
			Результат = 0;
			Пока Число1 <> 0 И Число2 <> 0 Цикл
				Результат = Бит * (((Число1 % 2) + (Число2 % 2)) % 2) + Результат;
				Бит = Бит * 2;
				Число1 = Цел(Число1 / 2);
				Число2 = Цел(Число2 / 2);
			КонецЦикла;
			
			Хеш = Результат + Макс(Число1, Число2) * Бит;
			
			Хеш = (Хеш * FNV_prime) % FNV_size;
				
		КонецЦикла;
	Иначе     
		FNV_size = Pow(2, 128);		FNV_prime = 309485009821345068724781371;		Хеш = 144066263297769815596495629667062367629;		ДанныеСтроки = XMLСтрока(Данные);				Для НомерСимвола = 1 По СтрДлина(ДанныеСтроки) Цикл			Байт = КодСимвола(ДанныеСтроки, НомерСимвола);						Число1 = Хеш;			Число2 = Байт;						Бит = 1;			Результат = 0;			Пока Число1 <> 0 И Число2 <> 0 Цикл				Результат = Бит * (((Число1 % 2) + (Число2 % 2)) % 2) + Результат;				Бит = Бит * 2;				Число1 = Цел(Число1 / 2);				Число2 = Цел(Число2 / 2);			КонецЦикла;						Хеш = Результат + Макс(Число1, Число2) * Бит;						Хеш = (Хеш * FNV_prime) % FNV_size;						КонецЦикла;	
	КонецЕсли;
		
	Возврат КонтурСтандарт_ЧислоВСистемеСчисления(Хеш, 16);
	
КонецФункции

&НаСервереБезКонтекста
Функция КонтурСтандарт_СтрСравнить_Совместимость(Строка1, Строка2)
	
	//Доступно только на сервере
	СравнениеЗначений = Новый СравнениеЗначений;
	
	Возврат СравнениеЗначений.Сравнить(Строка1, Строка2);
	
КонецФункции

// #КонецОбласти

// #КонецОбласти //МодульКонтурСтандарт

// #Область Криптография

////////////////////////////////////////////////////////////////////////
//				Дополнительный модуль "Криптография"           		  //        
////////////////////////////////////////////////////////////////////////

&НаКлиенте
Функция КриптографияПереопределяемый_МенеджерНастроек()
	
	КлючКэша = "Криптография_МенеджерНастроек"; 
	
	МенеджерНастроек = Кэш_Прочитать(КлючКэша);
	
	Если МенеджерНастроек = Неопределено Тогда
		
		МенеджерНастроек = Криптография_НовыйМенеджерНастроек();
		
		Кэш_Поместить(КлючКэша, МенеджерНастроек); 
		
	КонецЕсли;
	
	
    Возврат МенеджерНастроек;

КонецФункции

&НаКлиенте
Функция КриптографияПереопределяемый_Подписать(Знач ИсходныеДанные, ОтпечатокСертификата, ПарольДоступаКЗакрытомуКлючу = Неопределено)

	Результат = Неопределено;
		
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция КриптографияПереопределяемый_Расшифровать(ИсходныеДанные, Сертификат = Неопределено, ПарольДоступаКЗакрытомуКлючу  = Неопределено)
	
	Результат = Неопределено;                   
		
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Функция Криптография_МенеджерНастроек(МенеджерНастроек = Неопределено) Экспорт
	
	Если МенеджерНастроек = Неопределено Тогда
		
		МенеджерНастроек = КриптографияПереопределяемый_МенеджерНастроек();
		
		Если МенеджерНастроек = Неопределено Тогда
			
			МенеджерНастроек = Криптография_НовыйМенеджерНастроек();	
	
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат МенеджерНастроек;	

КонецФункции

&НаКлиенте
Функция Криптография_ИнициализироватьМенеджерКриптографии(ПарольДоступаКЗакрытомуКлючу = Неопределено, ПараметрыСозданияМенеджераКриптографии = Неопределено) Экспорт
	
	Если ПараметрыСозданияМенеджераКриптографии = Неопределено Тогда
		ВариантНастройки = Криптография_ПодходящийВариантНастройкиКриптографии();	
	Иначе
		ВариантНастройки = ПараметрыСозданияМенеджераКриптографии;
	КонецЕсли;
	
	Если ВариантНастройки = Неопределено Тогда
		ВызватьИсключение "Не удалось инициализировать менеджер криптографии по причине: не найден подходящий криптопровайдер на устройстве";	
	КонецЕсли;
	
	Попытка
		ПараметрыКонструктора = Новый Массив;
		ПараметрыКонструктора.Добавить(ВариантНастройки.ИмяМодуляКриптографии);
		ПараметрыКонструктора.Добавить(ВариантНастройки.ПутьМодуляКриптографии);
		ПараметрыКонструктора.Добавить(ВариантНастройки.ТипМодуляКриптографии);
		
		МенеджерКриптографии = Новый("МенеджерКриптографии", ПараметрыКонструктора);
	Исключение    
		ТекстОшибки = ОписаниеОшибки();
		ВызватьИсключение "Не удалось инициализировать менеджер криптографии по причине: " + ТекстОшибки;	
	КонецПопытки; 
		
	Криптография_УстановитьПарольДоступаКЗакрытомуКлючу(МенеджерКриптографии, ПарольДоступаКЗакрытомуКлючу);
	
	Возврат МенеджерКриптографии;
	
КонецФункции

&НаКлиенте
Функция Криптография_ПолучитьХранилищеСертификатов(ТипХранилища, РасположениеХранилища) Экспорт
	
	МенеджерКриптографии = Криптография_ИнициализироватьМенеджерКриптографии();
	
	ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилища, РасположениеХранилища);	
		
	Возврат ХранилищеСертификатовКриптографии;
	
КонецФункции

&НаКлиенте
Функция Криптография_Расшифровать(ИсходныеДанные, Сертификат = Неопределено, ПарольДоступаКЗакрытомуКлючу = Неопределено) Экспорт
	
	Результат = КриптографияПереопределяемый_Расшифровать(ИсходныеДанные, Сертификат, ПарольДоступаКЗакрытомуКлючу);
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВариантыНастройки = Криптография_ВариантыНастройкиПоТипуПлатформы();
	
	Для Каждого ВариантНастройки Из ВариантыНастройки Цикл
		
		Попытка	
			
			Результат = Криптография_РасшифроватьКонтент(ИсходныеДанные, Сертификат, ПарольДоступаКЗакрытомуКлючу, ВариантНастройки);
			
			Прервать;
			
		Исключение  
			
			ТекстОшибки = ОписаниеОшибки();
			
			Если ВариантыНастройки.Найти(ВариантНастройки) = ВариантыНастройки.ВГраница() 
				ИЛИ Криптография_ЕстьБлокирующиеОшибки(ТекстОшибки) Тогда
				ВызватьИсключение ТекстОшибки;	
			КонецЕсли;
			
			ВариантНастройкиИзТекстаОшибки = Криптография_ОбработатьВариантНастройкиИзТекстаОшибки(ТекстОшибки);
			
			Если НЕ ВариантНастройкиИзТекстаОшибки = Неопределено Тогда
				Результат = Криптография_РасшифроватьКонтент(ИсходныеДанные, Сертификат, ПарольДоступаКЗакрытомуКлючу, ВариантНастройкиИзТекстаОшибки);   
				Прервать;	
			КонецЕсли;
			
		КонецПопытки;		
		
	КонецЦикла; 	 
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Функция Криптография_НайтиПоОтпечатку(Отпечаток) Экспорт
	
	ПараметрыПоиска = Криптография_ПараметрыПоискаСертификатов();
	
	Сертификат = Криптография_ПолучитьДанныеСертификата(Отпечаток, ПараметрыПоиска);
		
	Возврат Сертификат;
	
КонецФункции

&НаКлиенте
Функция Криптография_Подписать(ИсходныеДанные, ОтпечатокСертификата, ПарольДоступаКЗакрытомуКлючу = "") Экспорт
		
	Результат = КриптографияПереопределяемый_Подписать(ИсходныеДанные, ОтпечатокСертификата, ПарольДоступаКЗакрытомуКлючу);
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	МенеджерНастроек = Криптография_МенеджерНастроек();
	
	// Получаем сертификат	
	СтруктураСертификата = Криптография_НайтиПоОтпечатку(ОтпечатокСертификата);	
	СертификатКриптографии = Новый СертификатКриптографии(СтруктураСертификата.ДвоичныеДанные);
	
	ОтпечатокСертификатаСтрокой = СтруктураСертификата.Отпечаток;
	
	ВариантыНастройки = Криптография_ВариантыНастройкиПоТипуПлатформы();
	
	ВариантНастройкиСертификата = МенеджерНастроек.ВариантыНастройкиСертификатов.Получить(ОтпечатокСертификатаСтрокой);
	
	Если НЕ ВариантНастройкиСертификата = Неопределено Тогда
		ВариантыНастройки.Вставить(0, ВариантНастройкиСертификата);	
	КонецЕсли;
	
	Для Каждого ВариантНастройки Из ВариантыНастройки Цикл
		
		Попытка	
			
			Результат = Криптография_ПодписатьКонтент(ИсходныеДанные, СертификатКриптографии, ПарольДоступаКЗакрытомуКлючу, ВариантНастройки);
			
			МенеджерНастроек.ВариантыНастройкиСертификатов.Вставить(ОтпечатокСертификатаСтрокой, ВариантНастройки);
			
			Прервать;
			
		Исключение  
			
			ТекстОшибки = ОписаниеОшибки();
			
			Если ВариантыНастройки.Найти(ВариантНастройки) = ВариантыНастройки.ВГраница() 
				ИЛИ Криптография_ЕстьБлокирующиеОшибки(ТекстОшибки) Тогда
				ВызватьИсключение ТекстОшибки;	
			КонецЕсли;
			
			ВариантНастройкиИзТекстаОшибки = Криптография_ОбработатьВариантНастройкиИзТекстаОшибки(ТекстОшибки);
			
			Если НЕ ВариантНастройкиИзТекстаОшибки = Неопределено Тогда
				Результат = Криптография_ПодписатьКонтент(ИсходныеДанные, СертификатКриптографии, ПарольДоступаКЗакрытомуКлючу, ВариантНастройкиИзТекстаОшибки);   
				МенеджерНастроек.ВариантыНастройкиСертификатов.Вставить(ОтпечатокСертификатаСтрокой, ВариантНастройкиИзТекстаОшибки);
				Прервать;	
			КонецЕсли;
			
		КонецПопытки;		
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Криптография_ПолучитьСертификатыДляПодписиШифрования(ТолькоДействующие = Истина) Экспорт
	
	Результат = Новый Массив;
	
	ПараметрыПоиска = Криптография_ПараметрыПоискаСертификатов();
	
	ХранилищеСертификатовКриптографии = Криптография_ПолучитьХранилищеСертификатов(ПараметрыПоиска.Тип, ПараметрыПоиска.Расположение);
	
	КоллекцияСертификатовХранилища = ХранилищеСертификатовКриптографии.ПолучитьВсе();
	
	Для Каждого Сертификат Из КоллекцияСертификатовХранилища Цикл
		
		Если Сертификат.ИспользоватьДляПодписи = Ложь 
			ИЛИ Сертификат.ИспользоватьДляШифрования = Ложь Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ТолькоДействующие
			И КонецДня(Сертификат.ДатаОкончания) < ТекущаяДата() Тогда
			Продолжить;
		КонецЕсли;
		
		РеквизитыСертификата = Криптография_НовыйОписаниеСертификата(Сертификат);
		Результат.Добавить(РеквизитыСертификата);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Функция Криптография_НовыйМенеджерНастроек()

	МенеджерНастроек = Новый Структура;
	
	МенеджерНастроек.Вставить("ПодходящийВариантНастройкиКриптографии");
	МенеджерНастроек.Вставить("КэшСертификатов", Новый Соответствие);
	МенеджерНастроек.Вставить("ВариантыНастройкиСертификатов", Новый Соответствие);
	
	Возврат МенеджерНастроек;
	
КонецФункции

&НаКлиенте
Процедура Криптография_УстановитьПарольДоступаКЗакрытомуКлючу(МенеджерКриптографии, ПарольДоступаКЗакрытомуКлючу)
	
	Если ЗначениеЗаполнено(ПарольДоступаКЗакрытомуКлючу) Тогда
		МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ПарольДоступаКЗакрытомуКлючу; 	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция Криптография_ПодходящийВариантНастройкиКриптографии()
	
	МенеджерНастроек = Криптография_МенеджерНастроек();
	
	Если МенеджерНастроек.ПодходящийВариантНастройкиКриптографии = Неопределено Тогда
		
		ВариантыНастройки = Криптография_ВариантыНастройкиПоТипуПлатформы();	
				
		Для Каждого ВариантНастройки Из ВариантыНастройки Цикл
			
			Попытка
				
				ПараметрыКонструктора = Новый Массив;
				ПараметрыКонструктора.Добавить(ВариантНастройки.ИмяМодуляКриптографии);
				ПараметрыКонструктора.Добавить(ВариантНастройки.ПутьМодуляКриптографии);
				ПараметрыКонструктора.Добавить(ВариантНастройки.ТипМодуляКриптографии);
				
				МенеджерКриптографии = Новый("МенеджерКриптографии", ПараметрыКонструктора);
				
				МенеджерНастроек.ПодходящийВариантНастройкиКриптографии = ВариантНастройки;
				
				Прервать;
				
			Исключение
				
				_ОписаниеОшибки = ОписаниеОшибки();
				
			КонецПопытки;

		КонецЦикла;  
		
	КонецЕсли;
	
	Возврат МенеджерНастроек.ПодходящийВариантНастройкиКриптографии;

КонецФункции

&НаКлиенте
Функция Криптография_ВариантыНастройкиПоТипуПлатформы(ТипПлатформы = Неопределено) Экспорт
	
	ТипыМодулейКриптографии = Новый Массив;
	
	ВариантыНастройки = Криптография_ВариантыНастройкиКриптографии();
	
	Если ТипПлатформы = Неопределено Тогда
		СистемнаяИнформация = КонтурСтандарт_НовыйСистемнаяИнформация();
		ТипПлатформыСтрокой = НРег(СистемнаяИнформация.ТипПлатформы);
	Иначе
		ТипПлатформыСтрокой = НРег(ТипПлатформы);
	КонецЕсли;
	
	Если Найти(ТипПлатформыСтрокой, "windows") Тогда

		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.КриптоПроГОСТ2012);
		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.КриптоПроГОСТ2012SystemCSP);
		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.КриптоПроГОСТ2001);
		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.КриптоПроГОСТ2012Усиленый);
		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.КриптоПроФКН);
		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.КриптоПроРутокен);
		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.ВИПНетГОСТ2012);
		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.ВИПНетГОСТ2001);
		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.ВИПНетГОСТ2012Усиленый);
		
	ИначеЕсли Найти(ТипПлатформыСтрокой, "linux") Тогда	

		ПутьМодуляКриптографии = Криптография_ПутиМодуляКриптографии();	

		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.КриптоПроГОСТ_2012_Linux_x64);	
		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.КриптоПроГОСТ_2012_SystemCSP_Linux_x64);
		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.КриптоПроГОСТ_2012_Усиленый_Linux_x64);
	    ТипыМодулейКриптографии.Добавить(ВариантыНастройки.КриптоПроГОСТ34_10_2001_Linux_x64);
	  	ТипыМодулейКриптографии.Добавить(ВариантыНастройки.КриптоПроГОСТ34_10_2001_Linux_x32);
		
	ИначеЕсли Найти(ТипПлатформыСтрокой, "macos") Тогда     
		
		ПутьМодуляКриптографии = Криптография_ПутиМодуляКриптографии();

		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.КриптоПроГОСТ_2012_macOS);
		ТипыМодулейКриптографии.Добавить(ВариантыНастройки.КриптоПроГОСТ_2001_macOS);
		
	КонецЕсли;
	
	Возврат ТипыМодулейКриптографии;
	
КонецФункции 

&НаКлиенте
Функция Криптография_ВариантыНастройкиКриптографии() 

	ВариантыНастройки = Новый Структура;
	
	// Windows
	
	КриптоПроГОСТ2012 			= Криптография_НовыйВариантНастройкиКриптографии(80, "Crypto-Pro GOST R 34.10-2012 Cryptographic Service Provider");
	КриптоПроГОСТ2012SystemCSP 	= Криптография_НовыйВариантНастройкиКриптографии(80, "Crypto-Pro GOST R 34.10-2012 System CSP");
	КриптоПроГОСТ2001 			= Криптография_НовыйВариантНастройкиКриптографии(75, "Crypto-Pro GOST R 34.10-2001 Cryptographic Service Provider");
	КриптоПроГОСТ2012Усиленый 	= Криптография_НовыйВариантНастройкиКриптографии(81, "Crypto-Pro GOST R 34.10-2012 Strong Cryptographic Service Provider");
	КриптоПроФКН 				= Криптография_НовыйВариантНастройкиКриптографии(75, "GOST R 34.10-2001 eToken CSP");
	КриптоПроРутокен 			= Криптография_НовыйВариантНастройкиКриптографии(75, "GOST R 34.10-2001 Rutoken CSP");
	ВИПНетГОСТ2012 				= Криптография_НовыйВариантНастройкиКриптографии(77, "Infotecs GOST 2012/512 Cryptographic Service Provider");
	ВИПНетГОСТ2001 				= Криптография_НовыйВариантНастройкиКриптографии(2, "Infotecs Cryptographic Service Provider");
	ВИПНетГОСТ2012Усиленый 		= Криптография_НовыйВариантНастройкиКриптографии(78, "Infotecs GOST 2012/1024 Cryptographic Service Provider");
	
	ВариантыНастройки.Вставить("КриптоПроГОСТ2012", КриптоПроГОСТ2012);
	ВариантыНастройки.Вставить("КриптоПроГОСТ2012SystemCSP", КриптоПроГОСТ2012SystemCSP);
	ВариантыНастройки.Вставить("КриптоПроГОСТ2001", КриптоПроГОСТ2001);
	ВариантыНастройки.Вставить("КриптоПроГОСТ2012Усиленый", КриптоПроГОСТ2012Усиленый);
	ВариантыНастройки.Вставить("КриптоПроФКН", КриптоПроФКН);
	ВариантыНастройки.Вставить("КриптоПроРутокен", КриптоПроРутокен);
	ВариантыНастройки.Вставить("ВИПНетГОСТ2012", ВИПНетГОСТ2012);
	ВариантыНастройки.Вставить("ВИПНетГОСТ2001", ВИПНетГОСТ2001);
	ВариантыНастройки.Вставить("ВИПНетГОСТ2012Усиленый", ВИПНетГОСТ2012Усиленый);
	
	// Linux 
	
	ПутьМодуляКриптографии = Криптография_ПутиМодуляКриптографии();	
	
	КриптоПроГОСТ_2012_Linux_x64 = Криптография_НовыйВариантНастройкиКриптографии(80, "Crypto-Pro GOST R 34.10-2012 Cryptographic Service Provider", ПутьМодуляКриптографии, "linux");		
	КриптоПроГОСТ_2012_SystemCSP_Linux_x64 = Криптография_НовыйВариантНастройкиКриптографии(80, "Crypto-Pro GOST R 34.10-2012 System CSP", ПутьМодуляКриптографии, "linux");
	КриптоПроГОСТ_2012_Усиленый_Linux_x64 = Криптография_НовыйВариантНастройкиКриптографии(81, "Crypto-Pro GOST R 34.10-2012 Strong Cryptographic Service Provider", ПутьМодуляКриптографии, "linux");
	КриптоПроГОСТ34_10_2001_Linux_x64 = Криптография_НовыйВариантНастройкиКриптографии(75, "Crypto-Pro GOST R 34.10-2001 KC1 CSP", ПутьМодуляКриптографии, "linux");
	КриптоПроГОСТ34_10_2001_Linux_x32 = Криптография_НовыйВариантНастройкиКриптографии(75, "Crypto-Pro GOST R 34.10-2001 KC1 CSP", ПутьМодуляКриптографии, "linux");
	
	ВариантыНастройки.Вставить("КриптоПроГОСТ_2012_Linux_x64", КриптоПроГОСТ_2012_Linux_x64);	
	ВариантыНастройки.Вставить("КриптоПроГОСТ_2012_SystemCSP_Linux_x64", КриптоПроГОСТ_2012_SystemCSP_Linux_x64);
	ВариантыНастройки.Вставить("КриптоПроГОСТ_2012_Усиленый_Linux_x64", КриптоПроГОСТ_2012_Усиленый_Linux_x64);
	ВариантыНастройки.Вставить("КриптоПроГОСТ34_10_2001_Linux_x64", КриптоПроГОСТ34_10_2001_Linux_x64);
	ВариантыНастройки.Вставить("КриптоПроГОСТ34_10_2001_Linux_x32", КриптоПроГОСТ34_10_2001_Linux_x32);
	
	// MacOS 
	
	КриптоПроГОСТ_2012_macOS = Криптография_НовыйВариантНастройкиКриптографии(80, "Crypto-Pro GOST R 34.10-2012 KC1 CSP", ПутьМодуляКриптографии, "macos");
	КриптоПроГОСТ_2001_macOS = Криптография_НовыйВариантНастройкиКриптографии(75, "Crypto-Pro GOST R 34.10-2001 KC1 CSP", ПутьМодуляКриптографии, "macos");
	
	ВариантыНастройки.Вставить("КриптоПроГОСТ_2012_macOS", КриптоПроГОСТ_2012_macOS);
	ВариантыНастройки.Вставить("КриптоПроГОСТ_2001_macOS", КриптоПроГОСТ_2001_macOS);
	
	Возврат ВариантыНастройки;
	
КонецФункции

&НаКлиенте
Функция Криптография_ПутиМодуляКриптографии()
	
	ПутиМодуляКриптографии = Новый Массив;  
	
	ПутиМодуляКриптографии.Добавить("/opt/cprocsp/lib/amd64/libcapilite.so");
	ПутиМодуляКриптографии.Добавить("/opt/cprocsp/lib/amd64/libcapi10.so");
	ПутиМодуляКриптографии.Добавить("/opt/cprocsp/lib/amd64/libcapi20.so");
	ПутиМодуляКриптографии.Добавить("/opt/cprocsp/lib/libcapi10.dylib");
	ПутиМодуляКриптографии.Добавить("/opt/cprocsp/lib/libcapi20.dylib");
	ПутиМодуляКриптографии.Добавить("/opt/cprocsp/lib/libcapi10.4.dylib");
	ПутиМодуляКриптографии.Добавить("/opt/cprocsp/lib/libcapi20.4.dylib");
	ПутиМодуляКриптографии.Добавить("/opt/cprocsp/lib/ia32/libcapi10.so");
	ПутиМодуляКриптографии.Добавить("/opt/cprocsp/lib/ia32/libcapi20.so");
	
	Возврат КонтурСтандарт_СтрСоединить_(ПутиМодуляКриптографии, ":");	
	
КонецФункции

&НаКлиенте
Функция Криптография_НовыйВариантНастройкиКриптографии(ТипМодуляКриптографии, ИмяМодуляКриптографии, ПутьМодуляКриптографии = "", ПлатформаОС = "windows")

	ВариантНастройкиКриптографии = Новый Структура;
	
	ВариантНастройкиКриптографии.Вставить("ИмяМодуляКриптографии", ИмяМодуляКриптографии);
	ВариантНастройкиКриптографии.Вставить("ПутьМодуляКриптографии", ПутьМодуляКриптографии);
	ВариантНастройкиКриптографии.Вставить("ТипМодуляКриптографии", ТипМодуляКриптографии);
	ВариантНастройкиКриптографии.Вставить("ПлатформаОС", ПлатформаОС);
	
	Возврат ВариантНастройкиКриптографии;

КонецФункции

&НаКлиенте
Функция Криптография_ПараметрыПоискаСертификатов()

	ПараметрыПоиска = Новый Структура;
	
	ПараметрыПоиска.Вставить("Тип", ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	ПараметрыПоиска.Вставить("Расположение", РасположениеХранилищаСертификатовКриптографии.ДанныеПользователяОС);
	
	Возврат ПараметрыПоиска;	

КонецФункции

&НаКлиенте
Функция Криптография_ПолучитьДанныеСертификата(ОтпечатокСертификата, ПараметрыПоиска)
	
	Если НЕ ТипЗнч(ОтпечатокСертификата) = Тип("ДвоичныеДанные") Тогда
		
		КлючКэшаСертификатов = ОтпечатокСертификата;
		Отпечаток = КонтурСтандарт_ПолучитьДвоичныеДанныеИзHexСтроки_(ОтпечатокСертификата);
		
	Иначе      
		
		КлючКэшаСертификатов = КонтурСтандарт_ПолучитьHexСтрокуИзДвоичныхДанных_(ОтпечатокСертификата);
		Отпечаток = ОтпечатокСертификата; 
		
	КонецЕсли;
	
	МенеджерНастроек = Криптография_МенеджерНастроек();
	
	СертификатКриптографии = МенеджерНастроек.КэшСертификатов.Получить(КлючКэшаСертификатов); 
	
	Если СертификатКриптографии = Неопределено Тогда
	
		ХранилищеСертификатовКриптографии = Криптография_ПолучитьХранилищеСертификатов(ПараметрыПоиска.Тип, ПараметрыПоиска.Расположение);

		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоОтпечатку(Отпечаток);
		
		МенеджерНастроек.КэшСертификатов.Вставить(КлючКэшаСертификатов, СертификатКриптографии);
		
	КонецЕсли;	
	
	Результат = Криптография_НовыйОписаниеСертификата(СертификатКриптографии, Истина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Криптография_НовыйОписаниеСертификата(СертификатКриптографии, ДобавлятьДвоичныеДанные = Истина)
	
	Результат = Новый Структура();
	
	Результат.Вставить("Отпечаток", КонтурСтандарт_ПолучитьHexСтрокуИзДвоичныхДанных_(СертификатКриптографии.Отпечаток));
	Результат.Вставить("ОткрытыйКлюч", КонтурСтандарт_ПолучитьHexСтрокуИзДвоичныхДанных_(СертификатКриптографии.ОткрытыйКлюч));
	Результат.Вставить("СерийныйНомер", КонтурСтандарт_ПолучитьHexСтрокуИзДвоичныхДанных_(СертификатКриптографии.СерийныйНомер));
	Результат.Вставить("Издатель", КонтурСтандарт_СкопироватьРекурсивно(СертификатКриптографии.Издатель, Ложь));
	
	Результат.Вставить("Субъект", КонтурСтандарт_СкопироватьРекурсивно(СертификатКриптографии.Субъект, Ложь));
	
	Если СертификатКриптографии.Субъект.Свойство("OGRN") Тогда
		Результат.Субъект.Вставить("ОГРН", СертификатКриптографии.Субъект.OGRN);
	ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_100_1") Тогда
		Результат.Субъект.Вставить("ОГРН", СертификатКриптографии.Субъект.OID1_2_643_100_1);
	КонецЕсли;
	
	Если СертификатКриптографии.Субъект.Свойство("SNILS") Тогда
		Результат.Субъект.Вставить("СНИЛС", СертификатКриптографии.Субъект.SNILS);
	ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_100_3") Тогда
		Результат.Субъект.Вставить("СНИЛС", СертификатКриптографии.Субъект.OID1_2_643_100_3);
	КонецЕсли;
	
	Если СертификатКриптографии.Субъект.Свойство("INN") Тогда
		Результат.Субъект.Вставить("ИНН", СертификатКриптографии.Субъект.INN);
	ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_3_131_1_1") Тогда
		Результат.Субъект.Вставить("ИНН", СертификатКриптографии.Субъект.OID1_2_643_3_131_1_1);
	КонецЕсли;
	
	Результат.Вставить("Версия", СертификатКриптографии.Версия);
	Результат.Вставить("ИспользоватьДляПодписи", СертификатКриптографии.ИспользоватьДляПодписи);
	Результат.Вставить("ИспользоватьДляШифрования", СертификатКриптографии.ИспользоватьДляШифрования);
	Результат.Вставить("ДатаНачала", СертификатКриптографии.ДатаНачала);
	Результат.Вставить("ДатаОкончания", СертификатКриптографии.ДатаОкончания);
	Результат.Вставить("РасширенныеСвойства", Новый Структура(СертификатКриптографии.РасширенныеСвойства));
	Результат.Вставить("ДвоичныеДанные", Неопределено);
	Результат.Вставить("АлгоритмКлюча", "");
	
	Если ДобавлятьДвоичныеДанные Тогда
		
		Результат.ДвоичныеДанные = СертификатКриптографии.Выгрузить();	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Криптография_ОтпечатокСертификатаСтрокой(ОтпечатокСертификата)
	
	Если НЕ ТипЗнч(ОтпечатокСертификата) = Тип("ДвоичныеДанные") Тогда
		ОтпечатокСтрокой = ОтпечатокСертификата;
	Иначе      
		ОтпечатокСтрокой = КонтурСтандарт_ПолучитьHexСтрокуИзДвоичныхДанных_(ОтпечатокСертификата);		
	КонецЕсли;
	
	Возврат ОтпечатокСтрокой; 
	
КонецФункции

&НаКлиенте
Функция Криптография_ЕстьБлокирующиеОшибки(ТекстОшибки)
	
	ТекстОшибкиНРег = НРег(ТекстОшибки);
	
	ЭтоОшибкаПароляКонтейнера = Найти(ТекстОшибкиНРег, "неправильный пароль доступа к закрытому ключу")
							ИЛИ Найти(ТекстОшибкиНРег, "контекст был получен в ограниченном режиме")
							ИЛИ Найти(ТекстОшибкиНРег, "incorrect access password to a private key")
							ИЛИ Найти(ТекстОшибкиНРег, "ошибка при установке параметра модуля криптографии")
							ИЛИ Найти(ТекстОшибкиНРег, "ошибка при расшифровании криптографических данных");
							
	Если ЭтоОшибкаПароляКонтейнера Тогда
		ТекстОшибки = "Неправильный пароль доступа к закрытому ключу";
	КонецЕсли;
	
	Возврат ЭтоОшибкаПароляКонтейнера;
		
КонецФункции

&НаКлиенте
Функция Криптография_ОбработатьВариантНастройкиИзТекстаОшибки(ТекстОшибки)
	
	ВариантНастройкиИзТекстаОшибки = Неопределено;
	
	ТекстОшибкиНРег = НРег(ТекстОшибки);

	Если Найти(ТекстОшибкиНРег, "сертификат, связанный с закрытым ключом, указывает на модуль криптографии, отличный от текущего") Тогда
		
		ВариантыНастроек = Криптография_ВариантыНастройкиПоТипуПлатформы(); 	
		
		Для Каждого ВариантНастроек Из ВариантыНастроек Цикл
			
			Если Найти(ТекстОшибкиНРег, НРег(ВариантНастроек.ИмяМодуляКриптографии))
				И Найти(ТекстОшибкиНРег, НРег(ВариантНастроек.ТипМодуляКриптографии)) Тогда
				
				ВариантНастройкиИзТекстаОшибки = ВариантНастроек;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВариантНастройкиИзТекстаОшибки = Неопределено Тогда
			
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВариантНастройкиИзТекстаОшибки;
	
КонецФункции

&НаКлиенте
Функция Криптография_РасшифроватьКонтент(ИсходныеДанные, СертификатКриптографии = Неопределено, ПарольДоступаКЗакрытомуКлючу = Неопределено, ВариантНастройки = Неопределено)
	
	МенеджерКриптографии = Криптография_ИнициализироватьМенеджерКриптографии(ПарольДоступаКЗакрытомуКлючу, ВариантНастройки);
		
	Если КонтурСтандарт_ВерсияПлатформыНеНижеУказанной("8.3.24") Тогда
		Результат = МенеджерКриптографии.Расшифровать(ИсходныеДанные, СертификатКриптографии, ПарольДоступаКЗакрытомуКлючу);	
	Иначе   	
		Результат = МенеджерКриптографии.Расшифровать(ИсходныеДанные);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Криптография_ПодписатьКонтент(ИсходныеДанные, СертификатКриптографии = Неопределено, ПарольДоступаКЗакрытомуКлючу = Неопределено, ВариантНастройки = Неопределено) 
	
	МенеджерКриптографии = Криптография_ИнициализироватьМенеджерКриптографии(ПарольДоступаКЗакрытомуКлючу, ВариантНастройки);	
	
	Результат = МенеджерКриптографии.Подписать(ИсходныеДанные, СертификатКриптографии);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти

// #Область МодульПостроительСхем

////////////////////////////////////////////////////////////////////////
//				Дополнительный модуль "ПостроительСхем"           	  //        
////////////////////////////////////////////////////////////////////////


&НаКлиенте
Функция ПостроительСхем_НовыйМенеджерНастроек()
	
	МенеджерНастроек = Новый Структура;
	
	Возврат МенеджерНастроек;
	
КонецФункции

&НаКлиенте
Функция ПостроительСхем_МенеджерНастроек() Экспорт
	
	МенеджерНастроек = Кэш_Прочитать("ПостроительСхем_МенеджерНастроек");
	
	Если МенеджерНастроек = Неопределено Тогда

		МенеджерНастроек = ПостроительСхем_НовыйМенеджерНастроек();
		
		
				
		Кэш_Поместить("ПостроительСхем_МенеджерНастроек", МенеджерНастроек); 
		
	КонецЕсли;
	
	Возврат МенеджерНастроек;
	
КонецФункции

&НаКлиенте
Процедура ПостроительСхем_ДобавитьСхему(ХранилищеСхем, Имя, Схема)
	
	ХранилищеСхем.Вставить(Имя, Новый ФиксированнаяСтруктура(Схема));
	
КонецПроцедуры

&НаКлиенте
Функция ПостроительСхем_ПолучитьСхему(ХранилищеСхем, Имя)  
	
	ПолученнаяСхема = ХранилищеСхем.Получить(Имя);
	
	Если ПолученнаяСхема = Неопределено Тогда
		
		ВызватьИсключение "Указанной схемы " + Имя + " не существует в хранилище схем";
		
	КонецЕсли;
	
	Возврат КонтурСтандарт_СкопироватьРекурсивно(ПолученнаяСхема);
	
КонецФункции

&НаКлиенте
Функция ПостроительСхем_ПривестиПоСхеме(ХранилищеСхем, Схема, ОбъектКонвертации = Неопределено, ЛокальныеИмена = Ложь) Экспорт
	
	СоздаваемыйОбъект = Неопределено;
	
	Если ТипЗнч(Схема) = Тип("Строка") Тогда
		СхемаДляРаботы = ПостроительСхем_ПолучитьСхему(ХранилищеСхем, Схема);	
	Иначе
		СхемаДляРаботы = КонтурСтандарт_СкопироватьРекурсивно(Схема);	
	КонецЕсли;
		
	Если СхемаДляРаботы.Свойство("__Ссылка") Тогда 
		СхемаДляРаботы = ПостроительСхем_ПолучитьСхему(ХранилищеСхем, СхемаДляРаботы.__Ссылка);	
	КонецЕсли; 	
		
	ОписаниеТипа = Новый ОписаниеТипов(СхемаДляРаботы.Тип);
		
	СоздаваемыйОбъект = ОписаниеТипа.ПривестиЗначение();
	
	Если СхемаДляРаботы.Тип = "Структура" Тогда
		
		Для Каждого Свойство Из СхемаДляРаботы.Свойства Цикл
			
			СоставСвойства = Свойство.Значение;
			
			Если ЛокальныеИмена 
				И СоставСвойства.Свойство("ЛокальноеИмя") 
				И НЕ ПустаяСтрока(СоставСвойства.ЛокальноеИмя) Тогда 
				
				ИмяСвойства = СоставСвойства.ЛокальноеИмя;
				
			Иначе
				
				ИмяСвойства = Свойство.Ключ;

			КонецЕсли;
			
			ЗначениеСвойства = Неопределено;	
			
			Если ОбъектКонвертации = Неопределено Тогда 
				Если СоставСвойства.Свойство("ПоУмолчанию") Тогда
					
					ЗначениеСвойства = СоставСвойства.ПоУмолчанию; 
					
				Иначе      
					
					ЗначениеСвойства = ПостроительСхем_ПривестиПоСхеме(ХранилищеСхем, СоставСвойства, Неопределено, ЛокальныеИмена);
	
				КонецЕсли;
			Иначе  
				
				Если НЕ ПустаяСтрока(СоставСвойства.ЛокальноеИмя) И ОбъектКонвертации.Свойство(СоставСвойства.ЛокальноеИмя) Тогда
					
					ЗначениеСвойства = ПостроительСхем_ПривестиПоСхеме(ХранилищеСхем, СоставСвойства, ОбъектКонвертации[СоставСвойства.ЛокальноеИмя], ЛокальныеИмена);
					
				ИначеЕсли ОбъектКонвертации.Свойство(Свойство.Ключ) Тогда
					
					ЗначениеСвойства = ПостроительСхем_ПривестиПоСхеме(ХранилищеСхем, СоставСвойства, ОбъектКонвертации[Свойство.Ключ], ЛокальныеИмена);
					
				Иначе
					
					ЗначениеСвойства = ПостроительСхем_ПривестиПоСхеме(ХранилищеСхем, СоставСвойства, Неопределено, ЛокальныеИмена);
					
				КонецЕсли; 
				
			КонецЕсли;
			
			СоздаваемыйОбъект.Вставить(ИмяСвойства, ЗначениеСвойства);
			
		КонецЦикла;
		
		
	ИначеЕсли СхемаДляРаботы.Тип = "Массив" Тогда
		
		Если ОбъектКонвертации = Неопределено Тогда
			
		Иначе
			
			Для Каждого Элемент Из ОбъектКонвертации Цикл
				
				СозданныйЭлемент = ПостроительСхем_ПривестиПоСхеме(ХранилищеСхем, СхемаДляРаботы.ЭлементыМассива, Элемент, ЛокальныеИмена);
				
				Если НЕ СозданныйЭлемент = Неопределено Тогда
					
					СоздаваемыйОбъект.Добавить(СозданныйЭлемент); 
					
				КонецЕсли;
			
			КонецЦикла; 
			
		КонецЕсли;
		
	ИначеЕсли Найти("Число,Строка,Булево,Неопределено", СхемаДляРаботы.Тип) Тогда
		
		Если ОбъектКонвертации = Неопределено Тогда       
			
		Иначе
			
			Если СхемаДляРаботы.Свойство("Перечисление")   Тогда
				
				Если НЕ ПустаяСтрока(ОбъектКонвертации) И СхемаДляРаботы.Перечисление.Найти(ОбъектКонвертации) <> Неопределено Тогда  
					
					СоздаваемыйОбъект = ОбъектКонвертации;
					
				Иначе
							
					СоздаваемыйОбъект = Неопределено;	
					
				КонецЕсли;
				
			Иначе
				
				СоздаваемыйОбъект = ОбъектКонвертации; 
				
			КонецЕсли;	
			
		КонецЕсли;
		
	ИначеЕсли СхемаДляРаботы.Тип = Неопределено Тогда
		
		СоздаваемыйОбъект = ОбъектКонвертации;
		
	КонецЕсли;
	
	Возврат СоздаваемыйОбъект;
	
КонецФункции

&НаКлиенте
Процедура ПостроительСхем_ДобавитьСвойство(Схема, ВложеннаяСхема, Имя, ЛокальноеИмя = Неопределено, ПоУмолчанию = Неопределено, ЭлементыМассива = Неопределено) Экспорт
	
	ВложеннаяСхема = ПостроительСхем_НовыйСхема(ВложеннаяСхема);
	
	Если ЛокальноеИмя <> Неопределено Тогда         
		
		ВложеннаяСхема.Вставить("ЛокальноеИмя", ЛокальноеИмя); 
		
	КонецЕсли;                       
	
	Если ЭлементыМассива <> Неопределено Тогда   
		
		ВложеннаяСхема.Вставить("ЭлементыМассива", ПостроительСхем_НовыйСхема(ЭлементыМассива));
		
	КонецЕсли;
	
	Если ПоУмолчанию <> Неопределено Тогда  
		
		ВложеннаяСхема.Вставить("ПоУмолчанию", ПоУмолчанию);
		
	КонецЕсли;
	
	ФиксированнаяВложеннаяСхема = Новый ФиксированнаяСтруктура(ВложеннаяСхема); 	
	
	Схема.Свойства.Вставить(Имя, ФиксированнаяВложеннаяСхема);
	
КонецПроцедуры

&НаКлиенте
Функция ПостроительСхем_НовыйСхема(Тип = Неопределено, Перечисление = Ложь) Экспорт
	
	Схема = Новый Структура;
	
	Схема.Вставить("Тип", Тип);
	
	Если Тип = "Структура" Тогда  
		
		Схема.Вставить("Свойства", Новый Соответствие);	
		Схема.Вставить("Обязательны", Новый Массив);
		
	ИначеЕсли Тип = "Массив" Тогда
		
		Схема.Вставить("ЭлементыМассива");
		
	ИначеЕсли Найти("Число,Булево,Строка,Неопределено",Тип) = 0 Тогда
		
		Схема.Удалить("Тип");
		Схема.Вставить("__Ссылка", Тип);     
		
	ИначеЕсли Найти("Число,Булево,Строка,Неопределено",Тип) Тогда
		
		Если Перечисление Тогда
			Схема.Вставить("Перечисление", Новый Массив);	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Схема;	
	
КонецФункции

// #КонецОбласти //МодульПостроительСхем


// #Область МодульКонтурДиадокAPI

////////////////////////////////////////////////////////////////////////
//			Дополнительный модуль "КонтурДиадокAPI"            		  //       
////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////
// ПЕРЕОПРЕДЕЛЯЕМЫЕ МЕТОДЫ

&НаКлиенте
Функция КонтурДиадокAPI_Переопределяемый_МенеджерНастроек() Экспорт
	
	МенеджерНастроек = Кэш_Прочитать("КонтурДиадокAPI_МенеджерНастроек");
	
	Если МенеджерНастроек = Неопределено Тогда

		МенеджерНастроек = МенеджерНастроекКонтурДиадокAPIНаСервере();
		
		Кэш_Поместить("КонтурДиадокAPI_МенеджерНастроек", МенеджерНастроек); 
		
	КонецЕсли;
	
	Возврат МенеджерНастроек;
	
КонецФункции

////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Функция КонтурДиадокAPI_МенеджерНастроек() Экспорт
		
	Возврат КонтурДиадокAPI_Переопределяемый_МенеджерНастроек();
	
КонецФункции



////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Функция КонтурДиадокAPI_НовыйМенеджерНастроек()
	
	МенеджерНастроек = Новый Структура;
	
	МенеджерНастроек.Вставить("КлиентИД", "");
	МенеджерНастроек.Вставить("ТестовоеОкружение", Ложь);
	МенеджерНастроек.Вставить("Сессия", Неопределено);
	МенеджерНастроек.Вставить("КэшТокенов", Неопределено);
	МенеджерНастроек.Вставить("АдресСервера", "");
	МенеджерНастроек.Вставить("АдресаСерверов", Неопределено);
	МенеджерНастроек.Вставить("ХранилищеСхем", Неопределено);

	Возврат МенеджерНастроек;
	
КонецФункции

// Метод для создания и инициализации структуры данных авторизации в API Диадок.
// В зависимости от выбранного типа авторизации заполняет структуру соответствующими полями.
//
// Параметры:
//   ТипАвторизации - Строка - Тип авторизации, значение из метода КонтурДиадокAPI_ТипыАвторизации.
//
// Возвращаемое значение:
//   Структура - Структура, содержащая поля для авторизации в зависимости от типа:
//     * ТипАвторизации - Строка - Выбранный тип авторизации.
//     Для типа "ЛогинПароль":
//       ** Логин  - Строка - Логин пользователя.
//       ** Пароль - Строка - Пароль пользователя.
//       ** Токен  - Строка - Токен доступа (заполняется после авторизации).
//     Для типа "Сертификат":
//       ** Отпечаток           - Строка - Отпечаток сертификата.
//       ** Расположение        - Строка - Путь к файлу сертификата.
//       ** ПарольЗакрытогоКлюча - Строка - Пароль к закрытому ключу.
//       ** ДвоичныеДанные      - ДвоичныеДанные, Неопределено - Данные сертификата в двоичном виде.
//       ** Токен               - Строка - Токен доступа (заполняется после авторизации).
//     Для типа "ИдентификаторСессии":
//       ** ИдентификаторСессии - Строка - Идентификатор активной сессии.
//       ** Токен               - Строка - Токен доступа (заполняется после авторизации).
//
&НаКлиенте
Функция КонтурДиадокAPI_НовыйДанныеАвторизации(ТипАвторизации) Экспорт
	
	ДанныеАвторизацииДиадок = Новый Структура("ТипАвторизации");
	ТипыАвторизации = КонтурДиадокAPI_ТипыАвторизации();               
	
	Если ТипАвторизации = ТипыАвторизации.ЛогинПароль Тогда
		
		ДанныеАвторизацииДиадок.ТипАвторизации = ТипыАвторизации.ЛогинПароль;	
		ДанныеАвторизацииДиадок.Вставить("Логин", "");
		ДанныеАвторизацииДиадок.Вставить("Пароль", "");
		ДанныеАвторизацииДиадок.Вставить("Токен", "");
		
	ИначеЕсли ТипАвторизации = ТипыАвторизации.Сертификат Тогда
		
		ДанныеАвторизацииДиадок.ТипАвторизации = ТипыАвторизации.Сертификат;	
		ДанныеАвторизацииДиадок.Вставить("Отпечаток", "");
		ДанныеАвторизацииДиадок.Вставить("Расположение", "");
		ДанныеАвторизацииДиадок.Вставить("ПарольЗакрытогоКлюча", "");
		ДанныеАвторизацииДиадок.Вставить("ДвоичныеДанные", Неопределено);
		ДанныеАвторизацииДиадок.Вставить("Токен", "");
		
	ИначеЕсли ТипАвторизации = ТипыАвторизации.ИдентификаторСессии Тогда
		
		ДанныеАвторизацииДиадок.ТипАвторизации = ТипыАвторизации.ИдентификаторСессии;	
		ДанныеАвторизацииДиадок.Вставить("ИдентификаторСессии", "");
		ДанныеАвторизацииДиадок.Вставить("Токен", "");
		
	Иначе
		
		ВызватьИсключение "Задан некорректный способ авторизации";
		
	КонецЕсли;
	
    Возврат ДанныеАвторизацииДиадок;
	
КонецФункции

// Метод возвращает структуру, содержащую доступные типы авторизации для работы с API Диадок.
//
// Возвращаемое значение:
//   Структура - Содержит ключи и соответствующие им строковые значения типов авторизации:
//     * ЛогинПароль        - Строка - Авторизация по логину и паролю.
//     * Сертификат         - Строка - Авторизация по сертификату.
//     * ИдентификаторСессии - Строка - Авторизация по идентификатору сессии.
//
&НаКлиенте
Функция КонтурДиадокAPI_ТипыАвторизации() Экспорт
	
	ТипыАвторизации = Новый Структура;
	
	ТипыАвторизации.Вставить("ЛогинПароль", 		"password");
	ТипыАвторизации.Вставить("Сертификат", 			"certificate");
	ТипыАвторизации.Вставить("ИдентификаторСессии", "sid");
	
	Возврат ТипыАвторизации;
	
КонецФункции

// Метод для получения авторизационного токена в API Диадок.
// Поддерживает три способа авторизации: по логину и паролю, по сертификату и по идентификатору сессии.
// При авторизации по сертификату возвращает подтверждение авторизации после расшифровки ответа.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//
// Возвращаемое значение:
//   Строка - Токен для доступа к API Диадок.
//
&НаКлиенте
Функция КонтурДиадокAPI_Авторизоваться(ДанныеАвторизацииДиадок) Экспорт   
	
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок", ДанныеАвторизацииДиадок);
	Возврат КонтурДиадокAPI_ВыполнитьСервернуюФункцию("КонтурДиадокAPI_Авторизоваться", ПараметрыМетода);
	 
КонецФункции

// Метод для подтверждения авторизации при использовании сертификата.
// Отправляет расшифрованный токен и отпечаток сертификата для завершения процедуры аутентификации.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   РасшифрованныйТокен - Строка - Расшифрованное содержимое ответа, полученного при первичной авторизации.
//   Отпечаток           - Строка - Отпечаток сертификата, использованного для авторизации.
//
// Возвращаемое значение:
//   Строка - Токен для доступа к API Диадок.
//
&НаКлиенте
Функция КонтурДиадокAPI_ПодтверждениеАвторизации(РасшифрованныйТокен, Отпечаток) Экспорт
	
	ПараметрыМетода = Новый Структура("РасшифрованныйТокен,Отпечаток", РасшифрованныйТокен, Отпечаток);
	Возврат КонтурДиадокAPI_ВыполнитьСервернуюФункцию("КонтурДиадокAPI_ПодтверждениеАвторизации", ПараметрыМетода);
	 	
КонецФункции

// Метод для проверки квалифицированности сертификата электронной подписи в системе Диадок.
// Позволяет определить, является ли сертификат квалифицированным и действительным для работы с указанным ящиком.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//   ОтпечатокСертификата    - Строка - Отпечаток проверяемого сертификата.
//   ОтветВЛокальныхИменах   - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_CertificateVerificationResponse.
//
&НаКлиенте
Функция КонтурДиадокAPI_ПроверкаКвалифицированностиСертификата(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ОтпечатокСертификата, ОтветВЛокальныхИменах = Ложь) Экспорт
	
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,ОтпечатокСертификата,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.ОтпечатокСертификата 	= ОтпечатокСертификата;
	ПараметрыМетода.ОтветВЛокальныхИменах 	= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ПроверкаКвалифицированностиСертификата", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции 

// Метод для проверки возможности использования сертификата для подписания документов в указанном ящике Диадок.
// Выполняет проверку на сервере Диадок, отправляя двоичные данные сертификата.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//   Отпечаток               - Строка - Отпечаток проверяемого сертификата.
//
// Возвращаемое значение:
//   Булево - Истина, если сертификат может использоваться для подписания документов в указанном ящике.
//
&НаКлиенте
Функция КонтурДиадокAPI_СертификатИспользуетсяДляПодписания(ДанныеАвторизацииДиадок, ИдентификаторЯщика, Отпечаток) Экспорт
	
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,Отпечаток");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.Отпечаток 				= Отпечаток;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_СертификатИспользуетсяДляПодписания", ПараметрыМетода);
	
	Возврат Результат;

КонецФункции

// Метод для предварительной проверки наличия и действительности машиночитаемой доверенности (МЧД) для указанного сертификата.
// Проверяет, зарегистрирована ли доверенность на владельца сертификата и действительна ли она для работы в указанном ящике.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//	 ИдентификаторМЧД        - Структура - см. метод КонтурДиадокAPI_Схема_PowerOfAttorneyFullId
//   Отпечаток               - Строка - Отпечаток сертификата доверенного лица.
//   ОтветВЛокальныхИменах   - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_PowerOfAttorneyPrevalidateResult.
//
&НаКлиенте
Функция КонтурДиадокAPI_ПредварительнаяПроверкаДоверенности(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ИдентификаторМЧД, Отпечаток, ОтветВЛокальныхИменах = Ложь) Экспорт
	
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,ИдентификаторМЧД,Отпечаток,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.ИдентификаторМЧД 		= ИдентификаторМЧД;
	ПараметрыМетода.Отпечаток 				= Отпечаток;
	ПараметрыМетода.ОтветВЛокальныхИменах 	= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ПредварительнаяПроверкаДоверенности", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для получения списка сертификатов электронной подписи, доступных текущему пользователю в указанном ящике Диадок.
// Возвращает информацию об отпечатках, сроках действия и статусе сертификатов.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//   ОтветВЛокальныхИменах   - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_CertificateList.
//
&НаКлиенте
Функция КонтурДиадокAPI_ИнформацияОСертификатах(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ОтветВЛокальныхИменах = Ложь) Экспорт
	
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.ОтветВЛокальныхИменах 	= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ИнформацияОСертификатах", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для получения информации о текущем авторизованном пользователе в системе Диадок.
// Возвращает данные учетной записи, включая идентификатор, имя, права доступа и связанные организации.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ОтветВЛокальныхИменах   - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_UserV2.
//
&НаКлиенте
Функция КонтурДиадокAPI_ИнформацияТекущегоПользователя(ДанныеАвторизацииДиадок, ОтветВЛокальныхИменах = Ложь) Экспорт
		
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ОтветВЛокальныхИменах 	= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ИнформацияТекущегоПользователя", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для получения списка машиночитаемых доверенностей (МЧД), выданных указанному пользователю в рамках заданного ящика Диадок.
// Позволяет отфильтровать только актуальные на текущий момент доверенности.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//   ИдентификаторПользователя - Строка - Идентификатор пользователя, для которого запрашиваются доверенности.
//   ТолькоАктуальные        - Булево - Признак получения только действующих на текущую дату доверенностей (по умолчанию Ложь).
//   ОтветВЛокальныхИменах   - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_EmployeePowerOfAttorneyList.
//
&НаКлиенте
Функция КонтурДиадокAPI_ДоверенностиПользователя(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ИдентификаторПользователя, ТолькоАктуальные = Ложь, ОтветВЛокальныхИменах = Ложь) Экспорт
		
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,ИдентификаторПользователя,ТолькоАктуальные,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок 	= ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 			= ИдентификаторЯщика;
	ПараметрыМетода.ИдентификаторПользователя 	= ИдентификаторПользователя;
	ПараметрыМетода.ТолькоАктуальные 			= ТолькоАктуальные;
	ПараметрыМетода.ОтветВЛокальныхИменах 		= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ДоверенностиПользователя", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для получения информации об организации в системе Диадок.
// Поиск организации может выполняться по одному из критериев: идентификатор организации,
// идентификатор ящика, идентификатор участника ЭДО или ИНН (с возможным уточнением по КПП).
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок  - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторОрганизации - Строка - Идентификатор организации в Диадок (необязательный).
//   ИдентификаторЯщика       - Строка - Идентификатор ящика организации в Диадок (необязательный).
//   ИдентификаторУчастникаЭДО - Строка - Идентификатор участника электронного документооборота (необязательный).
//   ИННОрганизации           - Строка - ИНН организации (необязательный).
//   КППОрганизации           - Строка - КПП организации, используется для уточнения при поиске по ИНН (необязательный).
//   ОтветВЛокальныхИменах    - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_Organization.
//
&НаКлиенте
Функция КонтурДиадокAPI_Организации(ДанныеАвторизацииДиадок, ИдентификаторОрганизации = "", ИдентификаторЯщика = "", ИдентификаторУчастникаЭДО = "", ИННОрганизации = "", КППОрганизации = "", ОтветВЛокальныхИменах = Ложь) Экспорт
	
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторОрганизации,ИдентификаторЯщика,ИдентификаторУчастникаЭДО,ИННОрганизации,КППОрганизации,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок 	= ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторОрганизации 	= ИдентификаторОрганизации;
	ПараметрыМетода.ИдентификаторЯщика 			= ИдентификаторЯщика;
	ПараметрыМетода.ИдентификаторУчастникаЭДО 	= ИдентификаторУчастникаЭДО;
	ПараметрыМетода.ИННОрганизации 				= ИННОрганизации;
	ПараметрыМетода.КППОрганизации 				= КППОрганизации;
	ПараметрыМетода.ОтветВЛокальныхИменах 		= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_Организации", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для получения содержимого и метаинформации сообщения из ящика Диадок.
// Позволяет получить полную информацию о сообщении, включая вложенные документы, подписи и статусы.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок     - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика          - Строка - Идентификатор ящика организации в Диадок.
//   ИдентификаторСообщения      - Строка - Идентификатор сообщения.
//   ИдентификаторСущности       - Строка - Идентификатор конкретной сущности (документа) внутри сообщения (необязательный).
//   ТипВозвращаемойПодписи      - Строка - Тип возвращаемой подписи для документов (необязательный).
//   ВозвращатьСодержимоеСущностей - Булево - Признак включения содержимого сущностей в ответ (по умолчанию Истина).
//   ОтветВЛокальныхИменах       - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_Message.
//
&НаКлиенте
Функция КонтурДиадокAPI_СодержимоеСообщения(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ИдентификаторСообщения, ИдентификаторСущности = "", ТипВозвращаемойПодписи = "", ВозвращатьСодержимоеСущностей = Истина, ОтветВЛокальныхИменах = Ложь) Экспорт

	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,ИдентификаторСообщения,ИдентификаторСущности,ТипВозвращаемойПодписи,ВозвращатьСодержимоеСущностей,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок 		= ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 				= ИдентификаторЯщика;
	ПараметрыМетода.ИдентификаторСообщения 			= ИдентификаторСообщения;
	ПараметрыМетода.ИдентификаторСущности 			= ИдентификаторСущности;
	ПараметрыМетода.ТипВозвращаемойПодписи 			= ТипВозвращаемойПодписи;
	ПараметрыМетода.ВозвращатьСодержимоеСущностей 	= ВозвращатьСодержимоеСущностей;
	ПараметрыМетода.ОтветВЛокальныхИменах 			= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_СодержимоеСообщения", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для подготовки документов к подписанию в системе Диадок.
// Формирует данные для подписи (хэши) для указанных документов или черновиков.
// Полученные данные могут быть использованы для последующего подписания с использованием сертификата электронной подписи.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ТелоЗапроса            - Структура - см. свойства в методе КонтурДиадокAPI_Схема_PrepareDocumentsToSignRequest.
//   ОтветВЛокальныхИменах  - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_PrepareDocumentsToSignResponse.
//
&НаКлиенте
Функция КонтурДиадокAPI_ПодготовитьДокументыКПодписанию(ДанныеАвторизацииДиадок, ТелоЗапроса, ОтветВЛокальныхИменах = Ложь) Экспорт
	
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ТелоЗапроса,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок 	= ДанныеАвторизацииДиадок;
	ПараметрыМетода.ТелоЗапроса 				= ТелоЗапроса;
	ПараметрыМетода.ОтветВЛокальныхИменах 		= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ПодготовитьДокументыКПодписанию", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для получения информации о ящике организации в системе Диадок.
// Возвращает данные о ящике, включая идентификатор, наименование, связанную организацию и настройки.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//   ОтветВЛокальныхИменах   - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_Box.
//
&НаКлиенте
Функция КонтурДиадокAPI_ИнформацияОЯщике(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ОтветВЛокальныхИменах = Ложь) Экспорт

	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок 	= ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 				= ИдентификаторЯщика;
	ПараметрыМетода.ОтветВЛокальныхИменах 		= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ИнформацияОЯщике", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для отправки сообщения, предварительно созданного в виде черновика, в системе Диадок.
// Позволяет отправить подготовленный документ или пакет документов контрагенту.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ТелоЗапроса            - Структура - см. свойства в методе КонтурДиадокAPI_Схема_DraftToSend.
//   ИдентификаторОперации   - Строка - Уникальный идентификатор операции для отправки (необязательный).
//   ОтветВЛокальныхИменах   - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_Message.
//
&НаКлиенте
Функция КонтурДиадокAPI_ОтправитьСообщениеИзЧерновика(ДанныеАвторизацииДиадок, ТелоЗапроса, ИдентификаторОперации = "", ОтветВЛокальныхИменах = Ложь) Экспорт
	
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ТелоЗапроса,ИдентификаторОперации,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок 	= ДанныеАвторизацииДиадок;
	ПараметрыМетода.ТелоЗапроса 				= ТелоЗапроса;
	ПараметрыМетода.ИдентификаторОперации 		= ИдентификаторОперации;
	ПараметрыМетода.ОтветВЛокальныхИменах 		= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ОтправитьСообщениеИзЧерновика", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для получения списка документов из ящика Диадок с возможностью фильтрации по категории и постраничной навигации.
// Возвращает перечень документов, соответствующих заданным критериям отбора.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок   - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика        - Строка - Идентификатор ящика организации в Диадок.
//   Категория                 - Строка - Категория документов для фильтрации (например, "Inbound", "Outbound", "Internal").
//   КлючПостраничногоВывода   - Строка - Ключ для продолжения постраничного вывода, полученный в предыдущем ответе (необязательный).
//   ОтветВЛокальныхИменах     - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_DocumentList.
//
&НаКлиенте
Функция КонтурДиадокAPI_СписокДокументов(ДанныеАвторизацииДиадок, ИдентификаторЯщика, Категория, КлючПостраничногоВывода = Неопределено, ОтветВЛокальныхИменах = Ложь) Экспорт
	
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,Категория,КлючПостраничногоВывода,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.Категория 				= Категория;
	ПараметрыМетода.КлючПостраничногоВывода = КлючПостраничногоВывода;
	ПараметрыМетода.ОтветВЛокальныхИменах 	= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_СписокДокументов", ПараметрыМетода);
	
	Возврат Результат;	

КонецФункции

// Метод для регистрации сертификата электронной подписи в Федеральной налоговой службе через систему Диадок.
// Отправляет заявление о присоединении к регламенту ЭДО счетов-фактур и регистрирует сертификат в ФНС.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//   Отпечаток               - Строка - Отпечаток регистрируемого сертификата.
//
// Возвращаемое значение:
//   Булево - Истина - Успешное выполнение запроса регистрации сертификата в ФНС.
//
&НаКлиенте
Функция КонтурДиадокAPI_ЗарегистрироватьСертификатФНС(ДанныеАвторизацииДиадок, ИдентификаторЯщика, Отпечаток) Экспорт
	
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,Отпечаток");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.Отпечаток 				= Отпечаток;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ЗарегистрироватьСертификатФНС", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для получения информации о машиночитаемой доверенности (МЧД), связанной с конкретной сущностью в сообщении.
// Возвращает данные доверенности, включая сведения о доверителе, доверенном лице и сроке действия.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//   ИдентификаторСообщения  - Строка - Идентификатор сообщения, содержащего сущность.
//   ИдентификаторСущности   - Строка - Идентификатор сущности (документа), для которой запрашивается доверенность.
//   ОтветВЛокальныхИменах   - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_PowerOfAttorney.
//
&НаКлиенте
Функция КонтурДиадокAPI_ИнформацияДоверенности(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ИдентификаторСообщения, ИдентификаторСущности, ОтветВЛокальныхИменах = Ложь) Экспорт
	
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,ИдентификаторСообщения,ИдентификаторСущности,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.ИдентификаторСообщения 	= ИдентификаторСообщения;
	ПараметрыМетода.ИдентификаторСущности 	= ИдентификаторСущности;
	ПараметрыМетода.ОтветВЛокальныхИменах 	= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ИнформацияДоверенности", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для регистрации машиночитаемой доверенности (МЧД) в системе Диадок.
// Отправляет данные доверенности для регистрации в распределенном реестре ФНС.
// Операция выполняется асинхронно, результат содержит идентификатор задачи для отслеживания статуса.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//   ТелоЗапроса            - Структура - см. свойства в методе КонтурДиадокAPI_Схема_PowerOfAttorneyToRegister.
//   ОтветВЛокальныхИменах   - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_AsyncMethodResult.
//
&НаКлиенте
Функция КонтурДиадокAPI_ЗарегистрироватьДоверенность(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ТелоЗапроса, ОтветВЛокальныхИменах = Ложь) Экспорт
		
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,ТелоЗапроса,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.ТелоЗапроса 			= ТелоЗапроса;
	ПараметрыМетода.ОтветВЛокальныхИменах 	= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ЗарегистрироватьДоверенность", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для проверки статуса регистрации машиночитаемой доверенности (МЧД) в системе Диадок.
// Используется для получения результата асинхронной операции регистрации доверенности по идентификатору задачи.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//   ИдентификаторОперации   - Строка - Идентификатор задачи, полученный при вызове метода КонтурДиадокAPI_ЗарегистрироватьДоверенность.
//   ОтветВЛокальныхИменах   - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_PowerOfAttorneyRegisterResult.
//
&НаКлиенте
Функция КонтурДиадокAPI_ПроверитьРегистрациюДоверенности(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ИдентификаторОперации, ОтветВЛокальныхИменах = Ложь) Экспорт
		
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,ИдентификаторОперации,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.ИдентификаторОперации 	= ИдентификаторОперации;
	ПараметрыМетода.ОтветВЛокальныхИменах 	= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ПроверитьРегистрациюДоверенности", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для привязки сотрудника к машиночитаемой доверенности (МЧД) в системе Диадок.
// Устанавливает связь между пользователем ящика и зарегистрированной доверенностью,
// позволяя сотруднику действовать от имени организации в рамках полномочий доверенности.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//   ИдентификаторСотрудника - Строка - Идентификатор сотрудника (пользователя), которому назначается доверенность.
//	 ТелоЗапроса             - Структура - см. метод КонтурДиадокAPI_Схема_PowerOfAttorneyFullId
//   ОтветВЛокальныхИменах   - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_EmployeePowerOfAttorney.
//
&НаКлиенте
Функция КонтурДиадокAPI_ПривязатьСотрудникаКДоверенности(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ИдентификаторСотрудника, ТелоЗапроса, ОтветВЛокальныхИменах = Ложь) Экспорт
	                                                                                                        	
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,ИдентификаторСотрудника,ТелоЗапроса,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.ИдентификаторСотрудника = ИдентификаторСотрудника;
	ПараметрыМетода.ТелоЗапроса 			= ТелоЗапроса;
	ПараметрыМетода.ОтветВЛокальныхИменах 	= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ПривязатьСотрудникаКДоверенности", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для генерации XML-файла извещения о получении документа в системе Диадок (версия 2).
// Создает структурированный XML-документ, подтверждающий факт получения одного или нескольких документов от контрагента.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//   ТелоЗапроса            - Структура - см. свойства в методе КонтурДиадокAPI_Схема_ReceiptGenerationRequestV2.
//
// Возвращаемое значение:
//   Строка - Сгенерированный XML извещения о получении документов.
//
&НаКлиенте
Функция КонтурДиадокAPI_СгенерироватьИзвещениеОПолучении_V2(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ТелоЗапроса) Экспорт
	                                                                                                        	
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,ТелоЗапроса");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.ТелоЗапроса 			= ТелоЗапроса;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_СгенерироватьИзвещениеОПолучении_V2", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КонтурДиадокAPI_СписокДокументовПолный(ДанныеАвторизацииДиадок, ИдентификаторЯщика, Категория, ОтветВЛокальныхИменах = Ложь) Экспорт
		
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,Категория,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.Категория 				= Категория;
	ПараметрыМетода.ОтветВЛокальныхИменах 	= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_СписокДокументовПолный", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для генерации универсального сообщения на основе полученного документа в системе Диадок.
// Создает XML-файл ответного документа (уведомления, подтверждения и т.д.) на основе шаблона, переданного в теле запроса.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//   ИдентификаторСообщения  - Строка - Идентификатор сообщения, на которое формируется ответ.
//   ИдентификаторСущности   - Строка - Идентификатор сущности (документа), на которую формируется ответ.
//   ТелоЗапроса            - ДвоичныеДанные - Шаблон универсального сообщения в виде двоичных данных.
//
// Возвращаемое значение:
//   Строка - Сгенерированный XML универсального сообщения.
//
&НаКлиенте
Функция КонтурДиадокAPI_СгенерироватьУниверсальноеСообщение(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ИдентификаторСообщения, ИдентификаторСущности, ТелоЗапроса) Экспорт
		
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,ИдентификаторСообщения,ИдентификаторСущности,ТелоЗапроса");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.ИдентификаторСообщения 	= ИдентификаторСообщения;
	ПараметрыМетода.ИдентификаторСущности 	= ИдентификаторСущности;
	ПараметрыМетода.ТелоЗапроса 			= ТелоЗапроса;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_СгенерироватьУниверсальноеСообщение", ПараметрыМетода);	
	
	Возврат Результат;
	
КонецФункции

// Метод для отправки дополнения (патча) к существующему сообщению в системе Диадок.
// Используется для добавления подписей, титулов покупателя, уведомлений об уточнении, аннулирования и других действий
// с уже существующим сообщением или его сущностями.
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ТелоЗапроса            - Структура - см. свойства в методе КонтурДиадокAPI_Схема_MessagePatchToPost.
//   ИдентификаторОперации   - Строка - Уникальный идентификатор операции для идемпотентной отправки (необязательный).
//   ОтветВЛокальныхИменах   - Булево - Признак приведения имен свойств ответа к локальному формату (по умолчанию Ложь).
//
// Возвращаемое значение:
//   Структура - См. свойства в методе КонтурДиадокAPI_Схема_MessagePatch.
//
&НаКлиенте
Функция КонтурДиадокAPI_ОтправитьДополнениеКСообщению(ДанныеАвторизацииДиадок, ТелоЗапроса, ИдентификаторОперации = "", ОтветВЛокальныхИменах = Ложь) Экспорт
		
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ТелоЗапроса,ИдентификаторОперации,ОтветВЛокальныхИменах");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ТелоЗапроса 			= ТелоЗапроса;
	ПараметрыМетода.ИдентификаторОперации 	= ИдентификаторОперации;
	ПараметрыМетода.ОтветВЛокальныхИменах 	= ОтветВЛокальныхИменах;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_ОтправитьДополнениеКСообщению", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

// Метод для получения содержимого конкретной сущности (документа) из сообщения в ящике Диадок.
// Возвращает двоичные данные документа в исходном формате (XML).
// В случае HTTP ответа отличного от "200", выбрасывает исключение.
//
// Параметры:
//   ДанныеАвторизацииДиадок - Структура - см. метод КонтурДиадокAPI_НовыйДанныеАвторизации.
//   ИдентификаторЯщика      - Строка - Идентификатор ящика организации в Диадок.
//   ИдентификаторСообщения  - Строка - Идентификатор сообщения, содержащего сущность.
//   ИдентификаторСущности   - Строка - Идентификатор запрашиваемой сущности (документа).
//
// Возвращаемое значение:
//   ДвоичныеДанные - Содержимое сущности в виде двоичных данных.
//
&НаКлиенте
Функция КонтурДиадокAPI_СодержимоеСущности(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ИдентификаторСообщения, ИдентификаторСущности) Экспорт
		
	ПараметрыМетода = Новый Структура("ДанныеАвторизацииДиадок,ИдентификаторЯщика,ИдентификаторСообщения,ИдентификаторСущности");
	ПараметрыМетода.ДанныеАвторизацииДиадок = ДанныеАвторизацииДиадок;
	ПараметрыМетода.ИдентификаторЯщика 		= ИдентификаторЯщика;
	ПараметрыМетода.ИдентификаторСообщения 	= ИдентификаторСообщения;
	ПараметрыМетода.ИдентификаторСущности 	= ИдентификаторСущности;
	
	Результат = КонтурДиадокAPI_ВызватьФункциюAPIНаСервере("КонтурДиадокAPI_СодержимоеСущности", ПараметрыМетода);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КонтурДиадокAPI_ВызватьФункциюAPIНаСервере(ИмяМетода, ПараметрыМетода)
		
	КонтурДиадокAPI_УстановитьТокенДляЗапроса(ПараметрыМетода.ДанныеАвторизацииДиадок);
	
	Попытка
		Результат = КонтурДиадокAPI_ВыполнитьСервернуюФункцию(ИмяМетода, ПараметрыМетода);	
	Исключение
	    ОписаниеОшибки = ОписаниеОшибки();
		Если Найти(ОписаниеОшибки, КонтурДиадокAPI_ИдентификаторОшибкиОбновитьТокенАвторизации()) > 0 Тогда
			КонтурДиадокAPI_ОбновитьТокенАвторизации(ПараметрыМетода.ДанныеАвторизацииДиадок);
			Результат = КонтурДиадокAPI_ВыполнитьСервернуюФункцию(ИмяМетода, ПараметрыМетода);
		Иначе
			ВызватьИсключение;
		КонецЕсли;		
	КонецПопытки;	
	
	Возврат Результат;
	
КонецФункции

// Осуществляет попытку преобразования объекта в структуру, описанной схемой.  
// Список всех доступных схем см. КонтурEDIAPI_ИнициализироватьСхемы  
//
// Параметры:
//   Схема - Строка - Имя схемы по которой следует привести объект.	
//   ОбъектКонвертации - Структура - Входная структура для приведения по схеме 
//   ЛокальныеИмена - Булево - флаг отвечающий за локализацию ключей структуры ответа метода
//
// Возвращаемое значение:
//   Структура - приведенная модель по переданному объекту и схеме  
//
&НаКлиенте
Функция КонтурДиадокAPI_Привести(Схема, ОбъектКонвертации, ЛокальныеИмена = Ложь) Экспорт  
	
	МенеджерНастроек = КонтурДиадокAPI_МенеджерНастроек();
	ХранилищеСхем	 = МенеджерНастроек.ХранилищеСхем;
	
	ПриведенныйОбъект = Неопределено;
	
	Если Схема = "PowerOfAttorneyToPost" 
		И НЕ ОбъектКонвертации = Неопределено Тогда  
		
		ПриведенныйОбъект = КонтурДиадокAPI_Привести_PowerOfAttorneyToPost(ХранилищеСхем, Схема, ОбъектКонвертации, ЛокальныеИмена);			
		
	ИначеЕсли Схема = "PowerOfAttorneyToRegister"
		И НЕ ОбъектКонвертации = Неопределено Тогда
		
		ПриведенныйОбъект = КонтурДиадокAPI_Привести_PowerOfAttorneyToRegister(ХранилищеСхем, Схема, ОбъектКонвертации, ЛокальныеИмена);	
		
	Иначе
		
		ПриведенныйОбъект = ПостроительСхем_ПривестиПоСхеме(ХранилищеСхем, Схема, ОбъектКонвертации, ЛокальныеИмена);
		
	КонецЕсли;	
	
	Возврат ПриведенныйОбъект; 
	
КонецФункции

// Осуществляет попытку создать структуру, описанной схемой.  
//
// Параметры:
//   Схема - Строка - Имя схемы по которой следует создать структуру.	
//   ЛокальныеИмена - Булево - флаг отвечающий за локализацию ключей структуры ответа метода
//
// Возвращаемое значение:
//   Структура - приведенная модель по схеме  
//
&НаКлиенте
Функция КонтурДиадокAPI_СоздатьПоСхеме(Схема, ЛокальныеИмена = Ложь) Экспорт
	
	МенеджерНастроек = КонтурДиадокAPI_МенеджерНастроек();
	ХранилищеСхем	 = МенеджерНастроек.ХранилищеСхем;
	
	СозданныйОбъект = Неопределено;
	
	СозданныйОбъект = ПостроительСхем_ПривестиПоСхеме(ХранилищеСхем, Схема, Неопределено, ЛокальныеИмена);
	
	Возврат СозданныйОбъект; 
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Процедура КонтурДиадокAPI_ОбновитьТокенАвторизации(ДанныеАвторизацииДиадок)
		
	ДанныеАвторизацииДиадок.Токен = "";
		
	КонтурДиадокAPI_ЗаписатьТокенВКэш(ДанныеАвторизацииДиадок);	
	
	КонтурДиадокAPI_УстановитьТокенДляЗапроса(ДанныеАвторизацииДиадок);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтурДиадокAPI_УстановитьТокенДляЗапроса(ДанныеАвторизацииДиадок)
	
	ТипыАвторизации = КонтурДиадокAPI_ТипыАвторизации();
	
	Если ДанныеАвторизацииДиадок.ТипАвторизации = ТипыАвторизации.Сертификат И ДанныеАвторизацииДиадок.Расположение = "сервер" Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеАвторизацииДиадок.Токен) Тогда
		
		ДанныеАвторизацииДиадок.Токен = КонтурДиадокAPI_ПрочитатьТокенИзКэша(ДанныеАвторизацииДиадок);	
			
		Если ПустаяСтрока(ДанныеАвторизацииДиадок.Токен) Тогда
			
			ЗашифрованныйКонтент = КонтурДиадокAPI_Авторизоваться(ДанныеАвторизацииДиадок);
			
			Если ДанныеАвторизацииДиадок.ТипАвторизации = ТипыАвторизации.Сертификат Тогда
				РасшифрованныйТокен = Криптография_Расшифровать(ЗашифрованныйКонтент, , ДанныеАвторизацииДиадок.ПарольЗакрытогоКлюча);
				ДанныеАвторизацииДиадок.Токен = КонтурСтандарт_Base64Строка(РасшифрованныйТокен);    
			ИначеЕсли ДанныеАвторизацииДиадок.ТипАвторизации = ТипыАвторизации.ЛогинПароль Тогда
				ДанныеАвторизацииДиадок.Токен 	= ЗашифрованныйКонтент;	
			Иначе         
				ВызватьИсключение "КонтурДиадокAPI: Неизвестный тип авторизации для получения токена";	
			КонецЕсли;
			
			КонтурДиадокAPI_ЗаписатьТокенВКэш(ДанныеАвторизацииДиадок);	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтурДиадокAPI_ЗаписатьТокенВКэш(ДанныеАвторизацииДиадок)
	
	МенеджерНастроек = КонтурДиадокAPI_МенеджерНастроек();
	
	КлючНастроек = КонтурДиадокAPI_КлючНастроекТокенаПоДаннымАвторизации(ДанныеАвторизацииДиадок);

	МенеджерНастроек.КэшТокенов.Вставить(КлючНастроек, ДанныеАвторизацииДиадок.Токен);

КонецПроцедуры

&НаКлиенте
Функция КонтурДиадокAPI_ПрочитатьТокенИзКэша(ДанныеАвторизацииДиадок)
	
	МенеджерНастроек = КонтурДиадокAPI_МенеджерНастроек();
	
	КлючНастроек = КонтурДиадокAPI_КлючНастроекТокенаПоДаннымАвторизации(ДанныеАвторизацииДиадок);
	
	Токен = МенеджерНастроек.КэшТокенов.Получить(КлючНастроек);
	
	Возврат ?(Токен = Неопределено, "", Токен); 

КонецФункции

&НаКлиенте
Функция КонтурДиадокAPI_КлючНастроекТокенаПоДаннымАвторизации(ДанныеАвторизацииДиадок)
	
	ТипыАвторизации = КонтурДиадокAPI_ТипыАвторизации();
	
	КлючНастроек = Неопределено;
	
	Если ДанныеАвторизацииДиадок.ТипАвторизации = ТипыАвторизации.ЛогинПароль Тогда
		КлючНастроек = ДанныеАвторизацииДиадок.Логин;	
	ИначеЕсли ДанныеАвторизацииДиадок.ТипАвторизации = ТипыАвторизации.Сертификат Тогда
		КлючНастроек = ДанныеАвторизацииДиадок.Отпечаток;	
	ИначеЕсли ДанныеАвторизацииДиадок.ТипАвторизации = ТипыАвторизации.ИдентификаторСессии Тогда
		КлючНастроек = ДанныеАвторизацииДиадок.ИдентификаторСессии;		
	Иначе	
		КлючНастроек = "";	
	КонецЕсли;
	
	Возврат КлючНастроек;
	
КонецФункции

&НаКлиенте
Функция КонтурДиадокAPI_ИдентификаторОшибкиОбновитьТокенАвторизации()

	Возврат "DIADOC_API_ERROR_REFRESH_TOKEN_CLIENT";
	
КонецФункции

&НаСервере
Функция КонтурДиадокAPI_ВыполнитьСервернуюФункцию(Знач ИмяМетода, Знач ПараметрыМетода = Неопределено)

	Результат = Неопределено;
	
	МодульОбъекта = МодульОбъекта();
	
	СтрокаПараметров = "";
	Если ЗначениеСоответствуетТипу(ПараметрыМетода, "Структура") Тогда
		Для Каждого Параметр Из ПараметрыМетода Цикл
			СтрокаПараметров = СтрокаПараметров + ?(ПустаяСтрока(СтрокаПараметров), "", ",") + "ПараметрыМетода." + Параметр.Ключ;				
		КонецЦикла;
	КонецЕсли;
	
	ТекстВычислить = "МодульОбъекта." + ИмяМетода + "(" + СтрокаПараметров + ")";
	
	Результат = Вычислить(ТекстВычислить);	
	                                                                            
	Возврат Результат;

КонецФункции


////////////////////////////////////////////////////////////////////////
// Специфичная обработка приведения схем моделей

&НаКлиенте
Функция КонтурДиадокAPI_Привести_PowerOfAttorneyToPost(ХранилищеСхем, Схема, ОбъектКонвертации, ЛокальныеИмена = Ложь)
	
	ПриведенныйОбъект = ПостроительСхем_ПривестиПоСхеме(ХранилищеСхем, Схема, ОбъектКонвертации, ЛокальныеИмена);
	
	Если ЗначениеЗаполнено(ПриведенныйОбъект.Content.Content.Content)
		И ЗначениеЗаполнено(ПриведенныйОбъект.Content.Signature.Content) Тогда
		
		ПриведенныйОбъект.Удалить("FullId");
		ПриведенныйОбъект.Удалить("UseDefault");
		ПриведенныйОбъект.Удалить("SendAsFile");
		
	ИначеЕсли ЗначениеЗаполнено(ПриведенныйОбъект.FullId.RegistrationNumber)
		И ЗначениеЗаполнено(ПриведенныйОбъект.FullId.IssuerInn)
		И ЗначениеЗаполнено(ПриведенныйОбъект.FullId.RepresentativeInn) Тогда
		
		ПриведенныйОбъект.Удалить("Content");
		ПриведенныйОбъект.Удалить("UseDefault");
		
	ИначеЕсли ПриведенныйОбъект.UseDefault = Истина Тогда
		
		ПриведенныйОбъект.Удалить("FullId");
		ПриведенныйОбъект.Удалить("Content");
		
	Иначе
		
		ПриведенныйОбъект = Неопределено;
		
	КонецЕсли;
	
	Возврат ПриведенныйОбъект;
	
КонецФункции

&НаКлиенте
Функция КонтурДиадокAPI_Привести_PowerOfAttorneyToRegister(ХранилищеСхем, Схема, ОбъектКонвертации, ЛокальныеИмена = Ложь)
	
	ПриведенныйОбъект = ПостроительСхем_ПривестиПоСхеме(ХранилищеСхем, Схема, ОбъектКонвертации, ЛокальныеИмена);
	
	Если ЗначениеЗаполнено(ПриведенныйОбъект.Content.Content.Content)
		И ЗначениеЗаполнено(ПриведенныйОбъект.Content.Signature.Content) Тогда
		
		ПриведенныйОбъект.Удалить("FullId");
		
	ИначеЕсли ЗначениеЗаполнено(ПриведенныйОбъект.FullId.RegistrationNumber)
		И ЗначениеЗаполнено(ПриведенныйОбъект.FullId.IssuerInn)
		И ЗначениеЗаполнено(ПриведенныйОбъект.FullId.RepresentativeInn) Тогда
		
		ПриведенныйОбъект.Удалить("Content");
		
	Иначе
		
		ПриведенныйОбъект = Новый Структура;
		
	КонецЕсли;
	
	Возврат ПриведенныйОбъект;
	
КонецФункции

// #КонецОбласти

// #Область АутентификацияНаУФ

&НаКлиенте
Функция КлиентАутентификации(Организация = Неопределено)

	ПараметрыФормы = Новый Структура("Организация", Организация);
    КлиентАутентификации = ПолучитьФорму_КонтурEDI("Аутентификатор_Клиент", , ПараметрыФормы, ВладелецФормы);
	
	Возврат КлиентАутентификации;

КонецФункции

&НаКлиенте
Процедура АутентификацияНаКлиенте(ФормаОповещения, Организация = Неопределено) Экспорт

    Аутентификатор = КлиентАутентификации(Организация);
	ДополнительныеПараметры = Новый Соответствие;
	Оповещение = КонтурСтандарт_ОписаниеОповещения("ПослеАутентификации", ФормаОповещения, ДополнительныеПараметры);
	Аутентификатор.НачатьПолучениеСессии(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьМетрикиФормыАутентификации(ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ДополнительныеПараметры) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормыАутентификации = "Аутентификатор_Клиент";
	ФормаАутентификации = КлиентАутентификации();

	СтэкДействий = ДополнительныеПараметры.Получить("Стэк");
	Если СтэкДействий <> Неопределено И ТипЗнч(СтэкДействий) = Тип("Массив") Тогда
		Для Каждого Действие Из СтэкДействий Цикл
			Если Действие = "ОткрытаФорма" Тогда
				ОсновнаяФорма().ПриОткрытииФормы(ФормаАутентификации, ИмяФормыАутентификации);
			ИначеЕсли Действие = "ЗакрытаФорма" Тогда
				ОсновнаяФорма().ПриЗакрытииФормы(ФормаАутентификации, ИмяФормыАутентификации);
			ИначеЕсли Действие = "БраузерОткрылся" Тогда
				НоваяМетрика().Информация("Аутентификация", "Браузер открылся").НаФорме(ФормаАутентификации).ПоместитьВОчередь();
			ИначеЕсли Лев(Действие, СтрДлина("Аутентификация")) = "Аутентификация" Тогда
				_ПортальныйИд = Сред(Действие, СтрДлина("Аутентификация")+2);
				НоваяМетрика().Информация("Аутентификация", _ПортальныйИд).НаФорме(ФормаАутентификации).ПоместитьВОчередь();
			Иначе	
				Кнопка = Новый Структура("Имя", Действие);
    			НоваяМетрика().НажатаКнопка(Кнопка).НаФорме(ФормаАутентификации).ПоместитьВОчередь();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	СтэкОшибок = ДополнительныеПараметры.Получить("Ошибки");
	Если СтэкОшибок <> Неопределено И ТипЗнч(СтэкОшибок) = Тип("Массив") Тогда
		Для Каждого Ошибка Из СтэкОшибок Цикл
			Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
				Ошибка = Ошибка.Описание;
			КонецЕсли;
			НоваяМетрика().Ошибка("Аутентификация", Ошибка).НаФорме(ФормаАутентификации).ПоместитьВОчередь();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // АутентификацияНаУФ

////////////////////////////////////////////////////////////////////////
//				Дополнительный модуль "КонтурСКД"           		  //        
////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс общего назначения

// Функция создает новый отбор компоновки данных
//
// Возвращаемое значение:
//   ОтборКомпоновкиДанных - Созданный отбор компоновки данных
&НаКлиенте
Функция КонтурСКД_НовыйОтборКомпоновкиДанных() Экспорт
	
	Попытка
		Отбор = Новый(Тип("ОтборКомпоновкиДанных"));
	Исключение
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		Отбор = КомпоновщикНастроек.Настройки.Отбор;
	КонецПопытки;

	Возврат Отбор;
	
КонецФункции

// Функция создает новый элемент отбора компоновки данных.
//
// Параметры:
//   ОтборКомопновки - ОтборКомпоновкиДанных - Отбор компоновки данных, в который добавляется элемент отбора
//   ЛевоеЗначение - ПолеКомпоновкиДанных, Строка - Левое значение отбора, можно указать поле компоновки или путь к данным
//   ПравоеЗначение - Произвольный - Правое значение отбора
//   ВидСравнения - ВидСравненияКомпоновкиДанных - Вид сравнения отбора, по умолчанию будет установлено Равно или ВСписке (при указании коллекции в правом значении)
//
// Возвращаемое значение:
//   ЭлементОтбораКомпоновкиДанных - Созданный элемент отбора компоновки данных
&НаКлиенте
Функция КонтурСКД_НовыйЭлементОтбораКомпоновки(ОтборКомопновки, ЛевоеЗначение = Неопределено, ПравоеЗначение = Неопределено, ВидСравнения = Неопределено) Экспорт
	
	ЭлементОтбора = ОтборКомопновки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Если ЛевоеЗначение <> Неопределено Тогда
		Если ТипЗнч(ЛевоеЗначение) = Тип("ПолеКомпоновкиДанных") Тогда
			ЭлементОтбора.ЛевоеЗначение = ЛевоеЗначение;
		Иначе
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ЛевоеЗначение);
		КонецЕсли;
	КонецЕсли;
	
	ЭлементОтбора.ПравоеЗначение = ПравоеЗначение;
			
	Если ВидСравнения = Неопределено Тогда
		
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
		Если ТипЗнч(ПравоеЗначение) = Тип("Массив") ИЛИ ТипЗнч(ПравоеЗначение) = Тип("СписокЗначений") Тогда
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		КонецЕсли;
		
	Иначе
		ЭлементОтбора.ВидСравнения = ВидСравнения;
	КонецЕсли;
	
	Возврат ЭлементОтбора;
	
КонецФункции

// Функция создает новую группу отбора компоновки данных.
//
// Параметры:
//   ОтборКомпоновки - ОтборКомпоновкиДанных - Отбор компоновки данных, в который добавляется группа отбора
//   ТипГруппы - ТипГруппыЭлементовОтбораКомпоновкиДанных - Тип группы отбора
//
// Возвращаемое значение:
//   ГруппаЭлементовОтбораКомпоновкиДанных - Созданная группа отбора компоновки данных
&НаКлиенте
Функция КонтурСКД_НоваяГруппаОтбораКомпоновки(ОтборКомпоновки, ТипГруппы = Неопределено) Экспорт
	
	ГруппаОтбора = ОтборКомпоновки.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));	
	
	Если ТипГруппы <> Неопределено Тогда
		ГруппаОтбора.ТипГруппы = ТипГруппы;
	КонецЕсли;
	
	Возврат ГруппаОтбора;
	
КонецФункции

// Функция рекурсивно копирует отбор компоновки данных из одного объекта в другой.
//
// Параметры:
//   ОтборПриемник - ОтборКомпоновкиДанных - Отбор, в который будет скопированы данные из источника
//   ОтборИсточник - ОтборКомпоновкиДанных - Отбор, из которого будет скопированы данные в приемник 
&НаКлиенте
Процедура КонтурСКД_СкопироватьОтборКомпоновкиДанныхРекурсивно(ОтборПриемник, ОтборИсточник) Экспорт
	
	Для Каждого ЭлементИсточника Из ОтборИсточник.Элементы Цикл
		
		Если ТипЗнч(ЭлементИсточника) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			НовыйЭлементПриемника = КонтурСКД_НоваяГруппаОтбораКомпоновки(ОтборПриемник);
			ЗаполнитьЗначенияСвойств(НовыйЭлементПриемника, ЭлементИсточника);
			КонтурСКД_СкопироватьОтборКомпоновкиДанныхРекурсивно(НовыйЭлементПриемника, ЭлементИсточника);
			
		Иначе
			
			Если Не ЗначениеЗаполнено(ЭлементИсточника.ЛевоеЗначение) Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйЭлементПриемника = КонтурСКД_НовыйЭлементОтбораКомпоновки(ОтборПриемник, ЭлементИсточника.ЛевоеЗначение, ЭлементИсточника.ПравоеЗначение);
			ЗаполнитьЗначенияСвойств(НовыйЭлементПриемника, ЭлементИсточника);
						
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
