&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ
 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	Параметры.МодальностьЗапрещена = МодульОбъекта().МодальностьЗапрещена();
	ПутьКФормам = МодульОбъекта().Метаданные().ПолноеИмя() + ".Форма.";
	
	МыПоставщик = МодульОбъекта().ПолучитьКонстантуEDI("МыПоставщик");
	МыТорговаяСеть = МодульОбъекта().ПолучитьКонстантуEDI("МыТорговаяСеть");
	
	Если ЗначениеЗаполнено(Параметры.СсылкаНаПартнера) Тогда
		
		Партнер = МодульОбъекта().ПолучитьЭлементСправочника("Партнеры",Параметры.СсылкаНаПартнера);
		
		Наименование 	= Партнер.Наименование;
		GLN				= Партнер.GLN;
		ЭтоТорговаяСеть	= Партнер.ТорговаяСеть;
		ЭтоПоставщик	= Партнер.Поставщик;
		КодСети			= Партнер.КодСети;
		
		ПерезаполнитьЮрЛиц();
		ОбновитьСписокНоменклатуры();                                      
		ОбновитьСписокТочекДоставки();
        ОбновитьСписокПодразделений();
		ОбновитьСинонимыПартнера();
		
		НачальнаяСтраница = "";
		Если Параметры.Свойство("НачальнаяСтраница", НачальнаяСтраница) Тогда
			Если НачальнаяСтраница = "ТочкиДоставки" Тогда
				НачальнаяСтраницаЭлемент = Элементы.ГруппаСтраницаТочкиДоставки;
			ИначеЕсли НачальнаяСтраница = "Номенклатура" Тогда
				НачальнаяСтраницаЭлемент = Элементы.ГруппаНоменклатура;
			ИначеЕсли НачальнаяСтраница = "Настройки" Тогда
				НачальнаяСтраницаЭлемент = Элементы.ГруппаСтраницаНастройки;
			Иначе
				НачальнаяСтраницаЭлемент = Элементы.ГруппаСтраницаЮрФизЛица;			
			КонецЕсли;
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница = НачальнаяСтраницаЭлемент;
		КонецЕсли;
				
	Иначе
		
		ЭтоНовыйПартнер = Истина;
		
		Если МыПоставщик И МыТорговаяСеть Тогда
			// нужно выбрать руками, мы не знаем кто это
		ИначеЕсли МыПоставщик Тогда
        	ЭтоТорговаяСеть = Истина;
		ИначеЕсли МыТорговаяСеть Тогда
			ЭтоПоставщик = Истина;
		КонецЕсли;
				
	КонецЕсли;
	
	УстановитьТипыЗначенийПолей();

	УправлениеВидимостью();
	
	ДеревоОбъект=РеквизитФормыВЗначение("ДеревоНастроек");
	МодульОбъекта().СоздатьДеревоНастроек(ДеревоОбъект,"Партнеры",Партнер);
	
	// автотесты
	Если ЗначениеЗаполнено(Параметры.ПараметрыАвтотестирования) Тогда
		СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.ПараметрыАвтотестирования);
		СтруктураПараметров = СтруктураПараметров.Настройки.Партнер;
		Для Каждого СтрНастроек Из СтруктураПараметров.Настройки Цикл
			
			УстановитьЗначениеНастройки(ДеревоОбъект,СокрЛП(СтрНастроек.Настройка),СтрНастроек.Значение);
			
		КонецЦикла;
	КонецЕсли;	
	
	ЗначениеВРеквизитФормы(ДеревоОбъект,"ДеревоНастроек");
	
	НачальныйРазделНастроек = "";
	Если Параметры.Свойство("НачальныйРазделНастроек", НачальныйРазделНастроек) Тогда
		РазделыНастроек = ДеревоНастроек.ПолучитьЭлементы();
		Для Каждого РазделНастроек Из РазделыНастроек Цикл
			Если РазделНастроек.НастройкаИД = НачальныйРазделНастроек Тогда
				ИдентификаторСтрокиДерева = РазделНастроек.ПолучитьИдентификатор();
				Элементы.ДеревоНастроек.ТекущаяСтрока = ИдентификаторСтрокиДерева;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.СсылкаНаПартнера) Тогда
		ПроверитьЗаблокироватьЭлементыДляРедактирования();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаблокироватьЭлементыДляРедактирования()
	
	РезультатБлокировки = ВыполнитьБлокировкуПартнера();
	
	Если Не РезультатБлокировки.Успешно Тогда 
		
		СписокЭлементов = СписокЭлементовДляБлокировки();
		
		Для Каждого ЭлементКоллекции Из СписокЭлементов Цикл
			ЗаполнитьЗначенияСвойств(Элементы[ЭлементКоллекции.Ключ], ЭлементКоллекции.Значение);
		КонецЦикла;
		
		МодульОбъекта().Сообщить_КонтурEDI(РезультатБлокировки.ТекстСообщения);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ВыполнитьБлокировкуПартнера()
	
	РезультатБлокировки = Новый Структура("Успешно, ТекстСообщения", Истина, "");
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Параметры.СсылкаНаПартнера,, ЭтаФорма.УникальныйИдентификатор);
	Исключение
		
		ФормаЗаблокирована = Истина;
		
		РезультатБлокировки.Успешно = Ложь;
		
		ТекстОшибки = ОписаниеОшибки();
		
		ТекстСообщения = "Настройки для редактирования недоступны. По причине:" + Символы.ПС;
		
		РезультатБлокировки.ТекстСообщения = ТекстСообщения + ТекстОшибки;
		
	КонецПопытки;
	
	Возврат РезультатБлокировки;
	
КонецФункции

&НаСервере
Функция СписокЭлементовДляБлокировки()
	
	ЗначениеПросмотра 	= Новый Структура("ТолькоПросмотр"	, Истина);
	ЗначениеДоступности = Новый Структура("Доступность"		, Ложь);
	
	Структура = Новый Структура;
	Структура.Вставить("GLN"							, ЗначениеПросмотра);
	Структура.Вставить("Наименование"					, ЗначениеПросмотра);
	Структура.Вставить("ЭтоПоставщик"					, ЗначениеПросмотра);
	Структура.Вставить("ЭтоТорговаяСеть"				, ЗначениеПросмотра);
	Структура.Вставить("ТаблицаЮрФизЛиц"				, ЗначениеПросмотра);
	Структура.Вставить("ТаблицаТочекДоставки"			, ЗначениеПросмотра);
	Структура.Вставить("ТаблицаНоменклатуры"			, ЗначениеПросмотра);
	Структура.Вставить("ДеревоНастроек"					, ЗначениеПросмотра);
	Структура.Вставить("ТаблицаСинонимов"				, ЗначениеПросмотра);
	
	Структура.Вставить("ФормаЗаписатьИЗакрыть"				, ЗначениеДоступности);
	Структура.Вставить("ТаблицаЮрФизЛицКоманднаяПанель"		, ЗначениеДоступности);
	Структура.Вставить("ТаблицаТочекДоставкиКоманднаяПанель", ЗначениеДоступности);
	Структура.Вставить("ТаблицаНоменклатурыКоманднаяПанель"	, ЗначениеДоступности);
	Структура.Вставить("ТаблицаСинонимовКоманднаяПанель"	, ЗначениеДоступности);

	Возврат Структура;
	
КонецФункции

&НаСервере
Процедура ОбновитьСинонимыПартнера()
	
	СинонимыОднойСтрокой = МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Параметры.СсылкаНаПартнера, "GLN_Партнера_Синонимы");	
	МассивСинонимов = МодульОбъекта().EDI_РазложитьСтрокуВМассивСлов(СинонимыОднойСтрокой,",");
	
	Для Каждого Синоним Из МассивСинонимов Цикл
		НовСтрокаСинонимов = ТаблицаСинонимов.Добавить();
		НовСтрокаСинонимов.GLN = Синоним;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция УстановитьЗначениеНастройки(Ветка,ИмяНастройки,Значение)
	
	Для Каждого Стр ИЗ Ветка.Строки Цикл
		Если СокрЛП(Стр.НастройкаИД) = ИмяНастройки Тогда
			Стр.Значение = Значение;
			Возврат Истина;
		КонецЕсли;
		Если УстановитьЗначениеНастройки(Стр,ИмяНастройки,Значение) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.ГруппаСтраницаТочкиДоставки.Видимость = (ЭтоТорговаяСеть=истина);
	
	Если МодульОбъекта().ПараметрыПользователяEDI.РольПользователяEDI<>"ПолныеПрава" Тогда
		
		//пользователь с ограниченными правами будет редактировать только точки доставки и номенклатуру
		ДоступныеСтраницы = МодульОбъекта().EDI_РазложитьСтрокуВМассивСлов("ГруппаСтраницаТочкиДоставки,ГруппаНоменклатура",",");
		Для Каждого Страница Из Элементы.ГруппаСтраницы.ПодчиненныеЭлементы Цикл
			Если ДоступныеСтраницы.Найти(Страница.Имя)=Неопределено Тогда
				Страница.Видимость = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Элементы.GLN.ТолькоПросмотр					= Истина;
		Элементы.Наименование.ТолькоПросмотр		= Истина;
		Элементы.ЭтоТорговаяСеть.ТолькоПросмотр		= Истина;
		Элементы.ЭтоПоставщик.ТолькоПросмотр		= Истина;
		
	КонецЕсли;
	
	Если МодульОбъекта().ПараметрыПользователяEDI.ФильтрОбменаПоТочкамДоставки = Истина Тогда
		Элементы.ТаблицаТочекДоставкиЗагружатьСообщения.Видимость = Истина;
	Иначе
		Элементы.ТаблицаТочекДоставкиЗагружатьСообщения.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыЗначенийПолей()
	
	УстановитьТипЗначенияКолонки(Элементы.ТаблицаЮрФизЛицЮрФизЛицо,		"ЮрФизЛицоСтороннее");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипЗначенияКолонки(ПолеФормы,Тип1С)
	
	ТипПоля		= МодульОбъекта().ПолучитьТипЗначенияОбъекта(Тип1С);
	
	Если ТипПоля = Неопределено Тогда
		Сообщить("Не задан тип объекта 1С для поля с типом "+Тип1С);
	Иначе	
		
		ПолеФормы.ОграничениеТипа = Новый ОписаниеТипов(ТипПоля);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(Параметры.ПараметрыАвтотестирования) Тогда

		ПодключитьОбработчикОжидания("ЗаписатьНастройкиАвтотестирования",0.1,Истина);
		
	КонецЕсли;
	
	Если МодульОбъектаКлиент().ПеременнаяСодержитСвойство(Элементы.ПолеПодсказки, "АвтоМаксимальнаяШирина") Тогда	
		Элементы.ПолеПодсказки.АвтоМаксимальнаяШирина = Ложь;
	КонецЕсли;
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "Партнеры_ЭлементУправляемая");	           
	
КонецПроцедуры

&НаСервере
Функция НайтиКонтрагентаПоНаименованию(НаименованиеКонтрагента)
	
	Возврат Справочники.Контрагенты.НайтиПоНаименованию(НаименованиеКонтрагента);
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьНастройкиАвтотестирования()
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.ПараметрыАвтотестирования);
	СтруктураПараметров = СтруктураПараметров.Настройки.Партнер;
	
	Наименование = СтруктураПараметров.Наименование;
	GLN = СтруктураПараметров.GLN;
	
	ЭтоТорговаяСеть = Истина;
	
	Если Не ЗаписатьИзменения_Клиент() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЮрЛицо Из СтруктураПараметров.ЮрЛица Цикл
		НоваяСтрока = ТаблицаЮрФизЛиц.Добавить();
		НоваяСтрока.ЮрФизЛицо = НайтиКонтрагентаПоНаименованию(ЮрЛицо.Контрагент);
		НоваяСтрока.GLN = ЮрЛицо.GLN;
		НоваяСтрока.Основной = Истина;
	КонецЦикла;
	
	// настраиваем точки доставки
	Для Каждого ТД Из СтруктураПараметров.ТочкиДоставки Цикл
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ПараметрыАвтотестирования",Параметры.ПараметрыАвтотестирования);
		ПараметрыФормы.Вставить("Партнер",Параметры.СсылкаНаПартнера);
		ПараметрыФормы.Вставить("Наименование",ТД.АдресДоставки);
		ПараметрыФормы.Вставить("АдресДоставки",ТД.АдресДоставки);
		ПараметрыФормы.Вставить("GLN",ТД.GLN);
		
		Если ЗначениеЗаполнено(ТД.Контрагент) Тогда
			ПараметрыФормы.Вставить("ЮрФизЛицо",НайтиКонтрагентаПоНаименованию(ТД.Контрагент));
		КонецЕсли;
		
		МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ТочкиДоставкиСторонние_ЭлементУправляемая", , ПараметрыФормы, ЭтаФорма);
		
	КонецЦикла;
	
	// настраиваем номенклатуру
	Для Каждого СтрТоваров Из СтруктураПараметров.СоответствияТоваров Цикл
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ПараметрыАвтотестирования",Параметры.ПараметрыАвтотестирования);
		ПараметрыФормы.Вставить("Партнер",Параметры.СсылкаНаПартнера);
		ПараметрыФормы.Вставить("GTIN",СтрТоваров.GTIN);
		ПараметрыФормы.Вставить("КодТовараПартнера",СтрТоваров.КодТовараПартнера);
		// остальные параметры будут найдены в форме сопоставления номенклатуры
		
		МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Номенклатура_ЭлементУправляемая", , ПараметрыФормы, ЭтаФорма);
		
	КонецЦикла;
	
	// чтобы нормально отработали предыдущие открытые формы тд и номенклатуры
	ПодключитьОбработчикОжидания("Автотесты_НажатьЗаписатьИЗакрыть",0.1,Истина);

КонецПроцедуры

&НаКлиенте
Процедура Автотесты_НажатьЗаписатьИЗакрыть()
	ПроверитьНастройкиИЗаписать();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНоменклатуры()
	
	МодульОбъекта().ОбновитьСписокНоменклатуры(ТаблицаНоменклатуры,Параметры.СсылкаНаПартнера);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокТочекДоставки()
	
	//запоминаем gln текущей строки
	ТекGLN = Неопределено;
	ТекСтрокаИдентификатор = Элементы.ТаблицаТочекДоставки.ТекущаяСтрока;
	Если Не ТекСтрокаИдентификатор = Неопределено Тогда
		ТекGLN = ТаблицаТочекДоставки.НайтиПоИдентификатору(ТекСтрокаИдентификатор).GLN;
	КонецЕсли;
	
	ТаблицаТочекДоставкиОбъект = РеквизитФормыВЗначение("ТаблицаТочекДоставки");
	ТаблицаТочекДоставкиОбъект.Очистить();
	
	СписокТочекДоставки = МодульОбъекта().ПолучитьСписокЭлементовСправочника("ТочкиДоставкиСторонние",Параметры.СсылкаНаПартнера);
	Если НЕ СписокТочекДоставки = Неопределено Тогда
		Для каждого Стр ИЗ СписокТочекДоставки Цикл
			НоваяСтрока = ТаблицаТочекДоставкиОбъект.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
		КонецЦикла;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТаблицаТочекДоставкиОбъект, "ТаблицаТочекДоставки");
	
	//восстанавливаем текущую строку по gln
	Если НЕ ТекGLN = Неопределено Тогда
		НайденныеСтроки = ТаблицаТочекДоставки.НайтиСтроки(Новый Структура("GLN",ТекGLN));
		Если Не НайденныеСтроки.Количество() = 0 Тогда
			Элементы.ТаблицаТочекДоставки.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПодразделений()
 //все подразделения выпилены уже давно за ненадобностью.
КонецПроцедуры

// Отказы действиям пользователя
&НаКлиенте
Процедура ТаблицаЮрФизЛицПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЮрФизЛицПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТочекДоставкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТочекДоставкиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатурыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатурыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
////////////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ДобавитьЮрФизЛицо(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	ТаблицаЮрФизЛиц.Добавить();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЮрФизЛицо(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ТекСтрока = Элементы.ТаблицаЮрФизЛиц.ТекущиеДанные;
	Если НЕ ТекСтрока = Неопределено Тогда
		ТаблицаЮрФизЛиц.Удалить(ТекСтрока);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПартнеров(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Состояние("Запрашиваю данные о юр. лицах сети",75);
	
	КодСети = Неопределено;
	Если Не ЗначениеЗаполнено(Параметры.СсылкаНаПартнера) Тогда
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Сохраните данные партнёра для продолжения");
		Возврат;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(КодСети) Тогда
		КодСети = ПолучитьКодСети();
		//Поищем код сети в list._xml
		Если Не ЗначениеЗаполнено(КодСети) Тогда
			МодульОбъектаКлиент().Предупреждение_КонтурEDI("Сеть не найдена на сервере");
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КодСети", КодСети);
	ПараметрыФормы.Вставить("Партнер", Параметры.СсылкаНаПартнера);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сервис_ОбновлениеЮрЛицСетиУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикОбновленияСпискаЮрЛиц" ,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновленияСпискаЮрЛиц(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Состояние("Перезаполняю список юр. лиц",80);
	ПерезаполнитьЮрЛиц();
	
КонецПроцедуры 

&НаСервере
Процедура ПерезаполнитьЮрЛиц()
	
	ТаблицаЮрФизЛиц.Очистить();
	
	СписокЮрЛиц = МодульОбъекта().ПолучитьСписокЭлементовСправочника("ЮрФизЛицаСторонние", Параметры.СсылкаНаПартнера);
	
	Для каждого ЮрЛицо ИЗ СписокЮрЛиц Цикл
		НоваяСтрока = ТаблицаЮрФизЛиц.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЮрЛицо);	
	КонецЦикла;

КонецПроцедуры // ПерезаполнитьЮрЛиц()

&НаКлиенте
Процедура УдалитьТочкуДоставки(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ТекСтрока = Элементы.ТаблицаТочекДоставки.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		
		ТекстВопроса ="Точка доставки """+ТекСтрока.АдресДоставки +"("+ТекСтрока.Наименование+")"+""" будет удалена. Продолжить?";
		
			Если Параметры.МодальностьЗапрещена Тогда
				Выполнить("ПоказатьВопрос(Новый ОписаниеОповещения(""ОбработчикПодтверждениеУдаленияТД"", ЭтаФорма), ТекстВопроса, РежимДиалогаВопрос.ДаНет)");
			иначе
				РезультатВопросаУдаленияТД = Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
				ОбработчикПодтверждениеУдаленияТД(РезультатВопросаУдаленияТД, Неопределено)
			КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПодтверждениеУдаленияТД(ОтветНаВопрос=Неопределено,ДопПараметр=Неопределено) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		ОбработчикПодтверждениеУдаленияТДСервер(Элементы.ТаблицаТочекДоставки.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработчикПодтверждениеУдаленияТДСервер(СсылкаТД)
	
	МодульОбъекта().УдалитьЭлементСправочника("ТочкиДоставкиСторонние",СсылкаТД);
	ОбновитьСписокТочекДоставки();
	
КонецПроцедуры // ОбработчикПодтверждениеУдаленияТД()

&НаКлиенте
Процедура ОбновитьСписокТочекДоставок(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если Не ЗначениеЗаполнено(Параметры.СсылкаНаПартнера) Тогда
		Предупреждение("Сохраните данные партнёра для продолжения");
		Возврат;
	КонецЕсли;	
	
	Если не ЗначениеЗаполнено(КодСети) Тогда
		КодСети = ПолучитьКодСети();
		//Поищем код сети в list._xml
		Если Не ЗначениеЗаполнено(КодСети) Тогда
			Сообщить("Сеть не найдена на сервере");
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КодСети", 						КодСети);
	ПараметрыФормы.Вставить("GUIDФормыВыводаУведомлений", 	ЭтаФорма.УникальныйИдентификатор);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сервис_ОбновлениеДанныхПартнераУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослеПроверкиНовыхТД", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеПроверкиНовыхТД(Параметр1=Неопределено,ДопПараметрПереданныйВОбработчик=Неопределено) Экспорт
	ОбновитьСписокТочекДоставки();
КонецПроцедуры 


&НаСервере
Функция ПолучитьКодСети()
	
	СписокСетей = МодульОбъекта().ПолучитьСтруктуруДанныхТорговойСети("list");
	Если СписокСетей<>Неопределено Тогда
		
		ПодходящаяСеть = СписокСетей.Сети.Найти(GLN,"GLN");
		Если ПодходящаяСеть<>Неопределено Тогда
			КодСети = ПодходящаяСеть.Код;
			МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(ЭтаФорма.Параметры.СсылкаНаПартнера,"КодСети",КодСети);
		КонецЕсли;
		
	КонецЕсли;
	Возврат КодСети;
		
КонецФункции


&НаКлиенте
Процедура КоманднаяПанельНоменклатурыДобавить(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	//убедимся что партнер записан
	Если Не ЗначениеЗаполнено(Параметры.СсылкаНаПартнера) Тогда 
		Состояние("Запись партнера",70);

		Если ЗаписатьИзменения_Клиент() Тогда
			//все ок
			//Параметры.СсылкаНаПартнера установлены
		Иначе
			Если Параметры.МодальностьЗапрещена Тогда 
				Выполнить("ПоказатьПредупреждение(Новый ОписаниеОповещения(""NOP"", ЭтаФорма),""Не удалось записать партнера перед добавлением точки доставки"")");
			Иначе
				Предупреждение("Не удалось записать партнера перед добавлением точки доставки");    //модальность
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Состояние("Создаю форму...",75);
	ТекСтрока= Элементы.ТаблицаНоменклатуры.ТекущиеДанные;
	
	ПараметрыФормы=	Новый Структура;
	ПараметрыФормы.Вставить("Партнер"			,Параметры.СсылкаНаПартнера);
	ПараметрыФормы.Вставить("GTIN"				,"");
	ПараметрыФормы.Вставить("КодТовараПартнера"	,"");
	ПараметрыФормы.Вставить("Наименование"		,"");
	                                                       
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Номенклатура_ЭлементУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослередактированияНоменклатуры", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослередактированияНоменклатуры(ПараметрыЗакрытияИнтерактивнойФормы, ДополнительныеПараметры) Экспорт
	ОбновитьСписокНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура NOP(Параметр1 = Неопределено)Экспорт

//заглушка - для обработчиков предупреждений, не имеющих неадобности	

КонецПроцедуры


&НаКлиенте
Процедура КоманднаяПанельНоменклатурыИзменить(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ИзменитьНоменклатуру();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНоменклатуру()
	
	//Запомним положение курсора
	ТекСтрока = Элементы.ТаблицаНоменклатуры.ТекущиеДанные;
	Если НЕ ТекСтрока = Неопределено Тогда  //м.б. открытие модуля
		ТекGTIN=Элементы.ТаблицаНоменклатуры.ТекущиеДанные.GTIN;
		ТекКодТовараПартнера=Элементы.ТаблицаНоменклатуры.ТекущиеДанные.КодТовараПартнера;
	КонецЕсли;
	
	//Откроем карточку элемента
	Если ТекСтрока<>Неопределено Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Партнер"			,Параметры.СсылкаНаПартнера);
		ПараметрыФормы.Вставить("GTIN"				,ТекСтрока.GTIN);
		ПараметрыФормы.Вставить("КодТовараПартнера"	,ТекСтрока.КодТовараПартнера);
		ПараметрыФормы.Вставить("Наименование"		,ТекСтрока.Наименование);
		
		МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Номенклатура_ЭлементУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослередактированияНоменклатуры", ЭтаФорма);
		
	КонецЕсли;
	
	// Восстановим положение курсора
	СтрОтбора=     Новый Структура("GTIN", ТекGTIN);
	СтрОтбора.Вставить("КодТовараПартнера",ТекКодТовараПартнера);
	НайденныеСтроки=ТаблицаНоменклатуры.НайтиСтроки(СтрОтбора);
	Если НайденныеСтроки.Количество()>0 Тогда 
		Идентификатор=НайденныеСтроки[0].ПолучитьИдентификатор();
		Элементы.ТаблицаНоменклатуры.ТекущаяСтрока=Идентификатор;
	КонецЕсли;
	
КонецПроцедуры	
	
&НаКлиенте
Процедура КоманднаяПанельНоменклатурыОбновить(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	ОбновитьСписокНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент.Имя="ДеревоНастроекЗначение" 
		И Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		Отказ=Истина;
	КонецЕсли;	
	
	Если Элемент.ТекущийЭлемент.Имя="ДеревоНастроекЗначение" 
		И ТипЗнч(Элементы.ДеревоНастроек.ТекущиеДанные.Значение)=Тип("Булево") Тогда
		Элемент.ТекущиеДанные.Значение = Не Элемент.ТекущиеДанные.Значение;
		Отказ=Истина;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ДеревоНастроекЗначение" 
		И Элемент.ТекущиеДанные.ОписаниеТипа = Новый ОписаниеТипов("Дата") Тогда
		
		Отказ = Истина;
				
		ЗначениеДаты = Элемент.ТекущиеДанные.Значение;
				
		Подсказка = "Укажите дату действия настройки";
				
		МодульОбъектаКлиент().ПоказатьВводДаты_КонтурEDI("ОбработчикПослеВводаДаты", ЭтаФорма,, ЗначениеДаты, Подсказка, ЧастиДаты.Дата);
				
	КонецЕсли;
	
	//фиксированные списки редактировать не дадим
	Если Элемент.ТекущийЭлемент.Имя="ДеревоНастроекЗначение" 
		И Элемент.ТекущиеДанные.ОписаниеТипа=Новый ОписаниеТипов("СписокЗначений") Тогда
		Отказ=Истина;
		ДеревоНастроекЗначениеНачалоВыбора(Элемент,ложь,Ложь);
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ДеревоНастроекЗначение"
		И Элемент.ТекущиеДанные.НастройкаИД = "СкладыОстатков" Тогда 
		
		Значение = Элемент.ТекущиеДанные.Значение;
		МодульОбъектаКлиент().РедактированиеСкладыОстатков(Значение, Наименование, "ОбработчикПослеЗакрытияУниверсальнойФормыРедактирования2", ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеВводаДаты(РезультатВвода, ДополнительныеПараметры) Экспорт
	
	Если РезультатВвода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДеревоНастроек.ТекущиеДанные.Значение = РезультатВвода;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеЗакрытияУниверсальнойФормыРедактирования2(РезультатРедактирования = Неопределено, ДопПараметрыОбработчика = Неопределено) Экспорт
	
	Если РезультатРедактирования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНастройкиСкладовОстатков_НаСервере(РезультатРедактирования, ДопПараметрыОбработчика.НаименованиеПартнера, ДопПараметрыОбработчика.Значение);
	Элементы.ДеревоНастроек.ТекущиеДанные.Значение = ДопПараметрыОбработчика.Значение;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиСкладовОстатков_НаСервере(АдресВХ, НаименованиеПартнера, Значение)
	
	МодульОбъекта().ЗаписатьНастройкиСкладовОстатков(АдресВХ, НаименованиеПартнера, Значение);

КонецПроцедуры


&НаКлиенте
Процедура ДеревоНастроекЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока=Элементы.ДеревоНастроек.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.Список) Тогда
		СтандартнаяОбработка=Ложь;
		Список = ЗначениеИзСтрокиВнутрВызовСервера(ТекСтрока.Список);
		
		Если Параметры.МодальностьЗапрещена Тогда
			Выполнить("ПоказатьВыборИзСписка(Новый ОписаниеОповещения(""ОбработчикВыбораЗначения"", ЭтаФорма), Список,Элемент,)");
		Иначе
			Выбранный = Список.ВыбратьЭлемент();
			ОбработчикВыбораЗначения(Выбранный); 
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораЗначения(ВыбранноеЗначение, Параметр = Неопределено) Экспорт
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		
		Элементы.ДеревоНастроек.ТекущиеДанные.Значение = ВыбранноеЗначение.Значение;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЗначениеИзСтрокиВнутрВызовСервера(Значение)
	Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") 
		или ТипЗнч(Значение) = Тип("ДеревоЗначений")
		тогда
		ВызватьИсключение("ЗначениеИзСтрокиВнутр тут быть не должно");
	КонецЕсли;
	
	Возврат ЗначениеИзСтрокиВнутр(Значение);
КонецФункции

&НаКлиенте
Процедура ДеревоНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущийЭлемент.Имя="ДеревоНастроекЗначение" 
		И Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		СтандартнаяОбработка=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ПроверитьНастройкиИЗаписать(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНастройкиИЗаписать()
	
	Если ЗаписатьИзменения_Клиент()  Тогда 
		ЭтаФорма.Закрыть(Истина);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПредупреждения_КонтурEDI(МассивПредупреждений) Экспорт
	
	Если ТипЗнч(МассивПредупреждений) = Тип("Массив") И МассивПредупреждений.Количество() > 0 Тогда
		
		ТекстПредупреждения = МассивПредупреждений[0];
		
		МассивПредупреждений.Удалить(0);
		
		Если Параметры.МодальностьЗапрещена Тогда
			Выполнить("ПоказатьПредупреждение(Новый ОписаниеОповещения(""ВывестиПредупреждения_КонтурEDI"", ЭтаФорма, МассивПредупреждений),ТекстПредупреждения, 5,""Контур.EDI"")");
		Иначе
			Предупреждение(ТекстПредупреждения, 5,"Контур.EDI");
			ВывестиПредупреждения_КонтурEDI(МассивПредупреждений)
		КонецЕсли;
		
	КонецЕсли;  

КонецПроцедуры

&НаКлиенте
Функция ЗаписатьИзменения_Клиент()

	РезультатЗаписиНастройки = ЗаписатьИзменения();
	
	Если Не РезультатЗаписиНастройки.Успешно Тогда
			
		РезультатЗаписиНастройки.РезультатПроверки.Добавить("Не удалось записать настройки");
		
		ВывестиПредупреждения_КонтурEDI(РезультатЗаписиНастройки.РезультатПроверки);
		
	КонецЕсли;
	
	Возврат РезультатЗаписиНастройки.Успешно; 

КонецФункции 

&НаСервере
Функция ЗаписатьИзменения()
	
	РезультатЗаписиНастройки = Новый Структура("Успешно,РезультатПроверки", Истина, Новый Массив);
	
	Если НЕ ПроверитьЗначенияФормы() Тогда
		РезультатЗаписиНастройки.Успешно = Ложь;
		Возврат РезультатЗаписиНастройки;
	КонецЕсли;
	
	СтруктураПолейПартнера = Новый Структура();
	СтруктураПолейПартнера.Вставить("Наименование",							Наименование);
	СтруктураПолейПартнера.Вставить("GLN",									GLN);
	СтруктураПолейПартнера.Вставить("КодСети",								КодСети);
	СтруктураПолейПартнера.Вставить("ЭтоТорговаяСеть",						ЭтоТорговаяСеть);
	СтруктураПолейПартнера.Вставить("ЭтоПоставщик",							ЭтоПоставщик);
	
	МодульОбъекта().ПодготовитьНастройкиПартнера_КонтурEDI(ДеревоНастроек,СтруктураПолейПартнера);
	
	РезультатПроверки =  МодульОбъекта().ПроверитьКорректностьНастроекПартнераПередЗаписью(СтруктураПолейПартнера);
		
	Если РезультатПроверки.Отказ Тогда
		
		РезультатПроверки.РезультатПроверки.Добавить("Внимание! Если вы не до конца понимаете значение этих настроек - обратитесь в техподдержку."); 		
		РезультатЗаписиНастройки.РезультатПроверки	= РезультатПроверки.РезультатПроверки;		
		РезультатЗаписиНастройки.Успешно			= Ложь;
		
		Возврат РезультатЗаписиНастройки;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
    	
		МодульОбъекта().СохранитьЭлементСправочника("Партнеры", Параметры.СсылкаНаПартнера, СтруктураПолейПартнера);
		МодульОбъекта().СохранитьСписокЭлементовСправочника("ЮрФизЛицаСторонние", ТаблицаЮрФизЛиц, Параметры.СсылкаНаПартнера);
		МодульОбъекта().СохранитьСинонимыОрганизации(Параметры.СсылкаНаПартнера, ТаблицаСинонимов.Выгрузить().ВыгрузитьКолонку("GLN"));
		
		Модифицированность	= Ложь;
		ЭтоНовыйПартнер		= Ложь;
		
		Если ТранзакцияАктивна() Тогда
	        ЗафиксироватьТранзакцию();
	    КонецЕсли;
		
    Исключение
		
	    Если ТранзакцияАктивна() Тогда
	        ОтменитьТранзакцию();
		КонецЕсли;
		Если Параметры.ЭтоНовыйПартнер Тогда
			Параметры.СсылкаНаПартнера = Неопределено;
		КонецЕсли;	
		
		ТекстОшибки = "Не удалось записать партнера - " + ОписаниеОшибки();
		МодульОбъекта().ЗаписьЖурналаРегистрации_КонтурEDI(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
		
    КонецПопытки;
	
	Возврат РезультатЗаписиНастройки;
	
КонецФункции // ЗаписатьИзменения()

&НаСервере
Функция ПроверитьЗначенияФормы()
	
	// 1. инициализируем таблицу вывода ошибок
	ТаблицаОшибок = МодульОбъекта().ИнициализироватьТаблицуОшибок();
	
	// 2. передать структуру для проверки
	МодульОбъекта().ПроверитьПолеФормы(ТаблицаОшибок, Наименование, "Строка50",	Истина, "Наименование");
	МодульОбъекта().ПроверитьПолеФормы(ТаблицаОшибок, GLN,			 "GLN",			Истина, "GLN");
	
	// юр лица
	
	ТабПроверки = РеквизитФормыВЗначение("ТаблицаЮрФизЛиц").Скопировать();
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("ЮрФизЛицо", "Юр\физ лицо");
	СписокПолей.Добавить("GLN","GLN");
	
	МодульОбъекта().НайтиДублиВТаблице(ТаблицаОшибок,ТабПроверки, "ЮрФизЛицо", "Юр. лица", "Юр\физ лицо");
	
	//Старая проверка. теперь в этой таблице может быть несколько GLN
	//МодульОбъекта().НайтиДублиВТаблице(ТаблицаОшибок,ТабПроверки, "GLN", 		"Юр. лица", "GLN");
	
	Если НЕ ЭтоТорговаяСеть и НЕ ЭтоПоставщик Тогда
		МодульОбъекта().ЗафиксироватьОшибку(ТаблицаОшибок,"GLN",,,"Необходимо указать, кем является ваш партнер: поставщиком или торговой сетью.");
	КонецЕсли;
	
	сч = 0;
	
	Для каждого Стр Из ТабПроверки Цикл
		
		сч = сч + 1;
		
		Если ЗначениеЗаполнено(Стр.GLN) ИЛИ ЗначениеЗаполнено(Стр.ЮрФизЛицо) Тогда
		
	 		МодульОбъекта().ПроверитьПолеФормы(ТаблицаОшибок, Стр.GLN,			"GLN", Истина, "GLN", 		"ТаблицаЮрФизЛиц",сч,				,"Юр. лица");
	 		МодульОбъекта().ПроверитьПолеФормы(ТаблицаОшибок, Стр.ЮрФизЛицо,		 , Истина, "ЮрФизЛицо", "ТаблицаЮрФизЛиц",сч,"Юр\физ лицо"	,"Юр. лица");
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ЮрФизЛицо) Тогда
			
			ПартнерЮрФизЛица = МодульОбъекта().ОпределитьПартнера(Новый Структура("ТипЗначения, ЮрФизЛицо", "ЮрФизЛицо", Стр.ЮрФизЛицо));

			Если ЗначениеЗаполнено(ПартнерЮрФизЛица) И НЕ ПартнерЮрФизЛица = Параметры.СсылкаНаПартнера Тогда
				МодульОбъекта().ЗафиксироватьОшибку(ТаблицаОшибок,"GLN","ТаблицаЮрФизЛиц",сч,"Юр.\физ лицо """+СокрЛП(Стр.ЮрФизЛицо)+""" уже выбрано у партнера: "+СокрЛП(ПартнерЮрФизЛица));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// проверяем возможные комбинации настроек
	СтруктураПолейПартнера = Новый Структура();
	СтруктураПолейПартнера.Вставить("Наименование",							Наименование);
	СтруктураПолейПартнера.Вставить("GLN",									GLN);
	СтруктураПолейПартнера.Вставить("КодСети",								КодСети);
	СтруктураПолейПартнера.Вставить("ЭтоТорговаяСеть",						ЭтоТорговаяСеть);
	СтруктураПолейПартнера.Вставить("ЭтоПоставщик",							ЭтоПоставщик);
	
	МодульОбъекта().ПодготовитьНастройкиПартнера_КонтурEDI(ДеревоНастроек,СтруктураПолейПартнера);
	
	
	//проверим синонимы
	сч = 0;
	Для Каждого СтрокаСинонима Из ТаблицаСинонимов Цикл
		
		сч = сч + 1;
		
		МодульОбъекта().ПроверитьПолеФормы(ТаблицаОшибок, СтрокаСинонима.GLN, "GLN", Истина, "GLN", "СинонимыОрганизации", сч, ,"Синонимы");
			
		Если ЗначениеЗаполнено(СтрокаСинонима.GLN) Тогда
			Если СтрокаСинонима.GLN = GLN Тогда
				МодульОбъекта().ЗафиксироватьОшибку(ТаблицаОшибок, "GLN", "СинонимыОрганизации",, "Синоним " + СтрокаСинонима.GLN + " уже указан в качестве основного GLN");
			ИначеЕсли ТаблицаСинонимов.НайтиСтроки(Новый Структура("GLN", СтрокаСинонима.GLN)).Количество() > 1 Тогда
				МодульОбъекта().ЗафиксироватьОшибку(ТаблицаОшибок, "GLN", "СинонимыОрганизации",, "Синоним " + СтрокаСинонима.GLN + " встречается несколько раз");
			КонецЕсли;
		КонецЕсли;
				
	КонецЦикла;
	
	
	Если ТаблицаОшибок.Количество() > 0 Тогда
		
		ТекстЗаголовка = "При заполнения партнера найдены ошибки.";
		
		//ОткрытьФормуВыводаОшибок(ТекстЗаголовка,ТаблицаОшибок,ЭтаФорма);
		Для Каждого СтрокаОшибки из ТаблицаОшибок Цикл 
			СП = новый СообщениеПользователю;
			СП.Текст = СтрокаОшибки.СведенияОбОшибках;
			Сп.Сообщить();
			
		КонецЦикла;
		
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ФормаЗаблокирована Тогда 
		Возврат;
	КонецЕсли;
	
	ИзменитьНоменклатуру();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТочекДоставкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ФормаЗаблокирована Тогда 
		Возврат;
	КонецЕсли;
	
	Состояние("Открываю точку доставки",75);
	
	СтандартнаяОбработка = Ложь;	
	ТекСтрока = Элемент.ТекущиеДанные;
	Если НЕ ТекСтрока = Неопределено Тогда
	   	ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СсылкаТочкиДоставки", ТекСтрока.Ссылка);
		МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ТочкиДоставкиСторонние_ЭлементУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикМодификацииТочкиДоставки", ЭтаФорма);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТочкуДоставки(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	СтандартнаяОбработка = Ложь;
	
	//убедимся что партнер записан
	
	Если Не ЗначениеЗаполнено(Параметры.СсылкаНаПартнера) Тогда 
		Состояние("Запись партнера",70);

		Если ЗаписатьИзменения_Клиент() Тогда
			//все ок
			//Параметры.СсылкаНаПартнера установлены
		Иначе
			Если Параметры.МодальностьЗапрещена Тогда 
				Выполнить("ПоказатьПредупреждение(Новый ОписаниеОповещения(""NOP"", ЭтаФорма),""Не удалось записать партнера перед добавлением точки доставки"")");
			Иначе
				Предупреждение("Не удалось записать партнера перед добавлением точки доставки");    //модальность
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Состояние("Создаю форму...",75);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Партнер", Параметры.СсылкаНаПартнера);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ТочкиДоставкиСторонние_ЭлементУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикМодификацииТочкиДоставки", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикМодификацииТочкиДоставки(Параметр1=Неопределено, Параметр2=Неопределено) Экспорт

	ОбновитьСписокТочекДоставки();

КонецПроцедуры

&НаКлиенте
Процедура КРасширениям(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если ЗначениеЗаполнено(Параметры.СсылкаНаПартнера) Тогда 
		
		Состояние("Открываю библиотеку ",75);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Партнер",Параметры.СсылкаНаПартнера);
		МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ФормаРасширения_СписокУправляемая", , ПараметрыФормы, ЭтаФорма);
		
	Иначе
		Сообщить("Переход к расширениям станет доступным после записи партнера");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЮрФизЛицОсновнойПриИзменении(Элемент)
	
	Если Элементы.ТаблицаЮрФизЛиц.ТекущиеДанные.Основной = Истина Тогда
		УстановилиКонтрагенту=Элементы.ТаблицаЮрФизЛиц.ТекущиеДанные.ЮрФизЛицо;
		//Необходимо проверить, нет ли другого основного контрагента на этот GLN
		Поиск = Новый Структура("GLN, Основной",Элементы.ТаблицаЮрФизЛиц.ТекущиеДанные.GLN,Истина);
		НайденыТакиеЖеОсновные = ТаблицаЮрФизЛиц.НайтиСтроки(Поиск);
		Если НайденыТакиеЖеОсновные.Количество()>1 Тогда 
			Для Каждого СтрокаСброситьОсновной Из НайденыТакиеЖеОсновные Цикл
				Если УстановилиКонтрагенту<>СтрокаСброситьОсновной.ЮрФизЛицо Тогда 
					СтрокаСброситьОсновной.Основной = Ложь;
					
					ТекстПредупреждения="Контрагент: """+СтрокаСброситьОсновной.ЮрФизЛицо+""" теперь НЕ основной";
					Если Параметры.МодальностьЗапрещена Тогда 
						Выполнить("ПоказатьПредупреждение(,ТекстПредупреждения,,""Контур.EDI"")");
					Иначе
						Предупреждение(ТекстПредупреждения,,"Контур.EDI");
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЮрФизЛицGLNПриИзменении(Элемент)
	
	Поиск = Новый Структура("GLN",Элементы.ТаблицаЮрФизЛиц.ТекущиеДанные.GLN);
	НайденыТакиеЖе = ТаблицаЮрФизЛиц.НайтиСтроки(Поиск);
	Если НайденыТакиеЖе.Количество()=1 Тогда //только Эта строка
		Элементы.ТаблицаЮрФизЛиц.ТекущиеДанные.Основной = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СнятьБлокировкуПартнера(Знач Ссылка, Знач ИдентификаторФормы)
	РазблокироватьДанныеДляРедактирования(Ссылка, ИдентификаторФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "Партнеры_ЭлементУправляемая");
		
	КонецЕсли;
	
	СнятьБлокировкуПартнера(Параметры.СсылкаНаПартнера, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

