
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИнформацияЗапускаМодуля = ИнформацияЗапускаМодуля();	
		
	РасположениеМодуля = ИнформацияЗапускаМодуля.РасположениеМодуля;
	ПутьКМодулю        = ИнформацияЗапускаМодуля.ПутьКМодулю;  	

	Если НЕ (ЗначениеЗаполнено(ИнформацияЗапускаМодуля.РасположениеМодуля) 
			И ЗначениеЗаполнено(ИнформацияЗапускаМодуля.ПутьКМодулю)) Тогда	
		
		ОткрытьФормуНастройкиПодключенияМодуля();
		
	Иначе
		
		Если РасположениеМодуля = "Файл" ИЛИ РасположениеМодуля = "Справочник" Тогда
			
			Если РасположениеМодуля = "Файл" Тогда
				
				ДвоичныеДанныеОбработки = Новый ДвоичныеДанные(ПутьКМодулю); 
				АдресХранилищаОбработки = ПоместитьВоВременноеХранилище(ДвоичныеДанныеОбработки);
				
				ИмяОбработки = ПроверитьПодключитьОбработкуEDI(АдресХранилищаОбработки);
				
			Иначе    
				
				ИмяОбработки = ПроверитьПодключитьОбработкуEDI(ПутьКМодулю);	
				
			КонецЕсли;    
			
			Если ИмяОбработки <> Неопределено Тогда
				
				ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма")
				
			Иначе 
				
				Если МодальностьЗапрещена() Тогда
					
					ПараметрыОповещения = Новый Массив;
					ПараметрыОповещения.Добавить("ОткрытьФормуНастройкиПодключенияМодуля");
					ПараметрыОповещения.Добавить(ЭтотОбъект);
					
					ОписаниеОповещения = Новый("ОписаниеОповещения", ПараметрыОповещения);
					ПоказатьПредупреждение(ОписаниеОповещения, "Не удалось открыть обработку проверьте настройки запуска модуля в настройках подключения.", , "Контур.EDI");
					
				Иначе     
					
					Предупреждение("Не удалось открыть обработку проверьте настройки запуска модуля в настройках подключения.", , "Контур.EDI");
                    ОткрытьФормуНастройкиПодключенияМодуля();
					
				КонецЕсли; 
				
			КонецЕсли;
			
		ИначеЕсли РасположениеМодуля = "Расширение" Тогда
			
			ОткрытьФорму("Обработка." + ПутьКМодулю + ".Форма");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиПодключенияМодуля(ДопПараметры = Неопределено) Экспорт
	
	ОткрытьФорму("ОбщаяФорма.КонтурEDI_НастройкаПодключенияМодуля");		
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьРасположениеАвтоматически(ИнформацияЗапускаМодуля)

	Если НЕ КонтурСтандарт_ВерсияСовместимостиНеНижеУказанной("8.3.20") 
		И КонтурСтандарт_ВерсияСовместимостиНеНижеУказанной("8.3.8") Тогда
		
		РасширениеКонфигурации = Метаданные.Справочники.КонтурEDI_Сообщения.РасширениеКонфигурации();
		
		Если НЕ РасширениеКонфигурации = Неопределено
			И НЕ Метаданные.Обработки.Найти("КонтурEDI") = Неопределено Тогда
			
			ИнформацияЗапускаМодуля.РасположениеМодуля = "Расширение";
			ИнформацияЗапускаМодуля.ПутьКМодулю = "КонтурEDI";
			
			ЗаписатьДополнительныйРеквизитEDI(Неопределено, "РасположениеМодуляEDI", ИнформацияЗапускаМодуля.РасположениеМодуля);
			ЗаписатьДополнительныйРеквизитEDI(Неопределено, "ПутьКМодулюEDI", ИнформацияЗапускаМодуля.ПутьКМодулю);
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДополнительныйРеквизитEDI(Объект, Свойство, Значение) 
	
	МенеджерЗаписи = РегистрыСведений.КонтурEDI_ДополнительныеРеквизиты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Свойство = Свойство;
	МенеджерЗаписи.Значение = Значение;
	МенеджерЗаписи.Записать(); 	
	
КонецПроцедуры

&НаСервере
Функция ИнформацияЗапускаМодуля()
	
	ИнформацияЗапускаМодуля = Новый Структура("РасположениеМодуля, ПутьКМодулю"); 
	
	ИнформацияЗапускаМодуля.РасположениеМодуля = ПолучитьЗначениеДополнительногоРеквизита(Неопределено, "РасположениеМодуляEDI");	
	ИнформацияЗапускаМодуля.ПутьКМодулю 	   = ПолучитьЗначениеДополнительногоРеквизита(Неопределено, "ПутьКМодулюEDI");	
	
	Если НЕ (ЗначениеЗаполнено(ИнформацияЗапускаМодуля.РасположениеМодуля) 
			И ЗначениеЗаполнено(ИнформацияЗапускаМодуля.ПутьКМодулю))  Тогда
		
		ОпределитьРасположениеАвтоматически(ИнформацияЗапускаМодуля);		
		
	КонецЕсли;
	
	Возврат ИнформацияЗапускаМодуля;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеДополнительногоРеквизита(ПараметрОбъект, ПараметрСвойство)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ПараметрОбъект);
	Запрос.УстановитьПараметр("Свойство", ПараметрСвойство);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурEDI_ДополнительныеРеквизиты.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
	               |ГДЕ
	               |	КонтурEDI_ДополнительныеРеквизиты.Объект = &Объект
	               |	И КонтурEDI_ДополнительныеРеквизиты.Свойство = &Свойство";
	
	Результат = Запрос.Выполнить();	
	
	Если Результат.Пустой() Тогда
		
		ЗначениеДопРеквизита = Неопределено;
		
	Иначе
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗначениеДопРеквизита = Выборка.Значение;
		
	КонецЕсли;
	
	Возврат ЗначениеДопРеквизита;
	
КонецФункции

&НаСервере 
Функция ПроверитьПодключитьОбработкуEDI(ПутьКМодулю)
	
	ИмяОбработки = "";
	
	Если ЭтоАдресВременногоХранилища(ПутьКМодулю) Тогда
		
		ОписаниеЗащитыОтОпасныхДействий = Новый("ОписаниеЗащитыОтОпасныхДействий");
		ОписаниеЗащитыОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		
		ИмяОбработки = ВнешниеОбработки.Подключить(ПутьКМодулю, , Ложь, ОписаниеЗащитыОтОпасныхДействий);  
		
	Иначе      
		
		Попытка
			
			ДополнительныеОтчетыИОбработки = Неопределено;
			
		Исключение    
			
			ИмяОбработки = ДополнительныеОтчетыИОбработки.ПодключитьВнешнююОбработку(ПутьКМодулю);
			
		КонецПопытки;	
		
	КонецЕсли;
	
	Возврат ИмяОбработки;
	
КонецФункции

&НаСервере
Функция КонтурСтандарт_ВерсияСовместимостиНеНижеУказанной(Версия)
	
	ВерсияРежимаСовместимости = Метаданные.РежимСовместимости;	
	
	Если ВерсияРежимаСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать Тогда 
		
		СистемнаяИнформация = Новый СистемнаяИнформация;
		ВерсияПриложения = СистемнаяИнформация.ВерсияПриложения;
		
		Возврат НомерВерсииЧислом(ВерсияПриложения) >= НомерВерсииЧислом(Версия); 
		
	КонецЕсли;
	
	ВерсияРежимаСовместимости = СтрЗаменить(ВерсияРежимаСовместимости, "Версия", "");
	ВерсияРежимаСовместимости = СтрЗаменить(ВерсияРежимаСовместимости, "Version", "");
	ВерсияРежимаСовместимости = СтрЗаменить(ВерсияРежимаСовместимости, "_", ".");
	
	Возврат (НомерВерсииЧислом(ВерсияРежимаСовместимости) >= НомерВерсииЧислом(Версия));
	

КонецФункции

&НаСервере
Функция НомерВерсииЧислом(СтрокаВерсии)

	Фрагменты = КонтурСтандарт_СтрРазделить(СтрокаВерсии, ".", Ложь);
	Для Счетчик = Фрагменты.Количество() По 4 Цикл
		Фрагменты.Добавить("0");
	КонецЦикла;
	Результат = Число(Фрагменты[0]) * 100 * 1000 + Число(Фрагменты[1]) * 1000 + Число(Фрагменты[2]);
	
	Возврат Результат; 
	
КонецФункции

&НаСервере
Функция КонтурСтандарт_СтрРазделить(Строка, Разделитель, ВключатьПустые = Истина) 
	
	Попытка     
		
		Результат = Вычислить("СтрРазделить(Строка, Разделитель, ВключатьПустые)");	
		
	Исключение  
		
		Результат = КонтурСтандарт_СтрРазделить_Совместимость(Строка, Разделитель, ВключатьПустые);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КонтурСтандарт_СтрРазделить_Совместимость(Строка, Разделитель, ВключатьПустые = Истина)
	
	ПропускатьПустыеСтроки = НЕ ВключатьПустые;	
	Результат = Новый Массив;
	
	НачалоСтроки = 1;
	
	Для Позиция = 1 По СтрДлина(Строка) Цикл 
		Символ = Сред(Строка, Позиция, 1);
		Если Найти(Разделитель, Символ) > 0 Тогда
			Результат.Добавить(Сред(Строка, НачалоСтроки, Позиция - НачалоСтроки));	
			НачалоСтроки = Позиция + 1;
		КонецЕсли;
	КонецЦикла;
	
	Значение = Сред(Строка, НачалоСтроки, Позиция - НачалоСтроки);
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Значение) Тогда
		Результат.Добавить(Значение);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция МодальностьЗапрещена()
	
	МодальностьЗапрещена = Ложь;
	
	Попытка
		Если НЕ Метаданные.РежимИспользованияМодальности = Метаданные.СвойстваОбъектов.РежимИспользованияМодальности.Использовать Тогда 
			МодальностьЗапрещена = Истина;
		КонецЕсли;
	Исключение
		_ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат МодальностьЗапрещена;
	
КонецФункции