
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьРасположенияОбработки();	
	ИнформацияЗапускаОбработки();
	
	МодальностьЗапрещена = МодальностьЗапрещена();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьРеквизитПутьКМодулю();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасположенияОбработки()

	СписокРасположенияМодуля = Элементы.РасположениеМодуля.СписокВыбора;
    ЕстьСправочникДопОбработок = ЕстьСправочникДопОбработокСервер();
	
	Если ЕстьСправочникДопОбработок Тогда
		СписокРасположенияМодуля.Добавить("Справочник", "В справочнике дополнительных обработок");
	КонецЕсли; 
	
	СписокРасположенияМодуля.Добавить("Расширение", "В составе конфигурации");	
	СписокРасположенияМодуля.Добавить("Файл", "На этом компьютере или сетевой папке");
	
КонецПроцедуры

&НаСервере
Процедура ИнформацияЗапускаОбработки()

	РасположениеМодуля 	= ПолучитьЗначениеДополнительногоРеквизита(Неопределено, "РасположениеМодуляEDI");	
	ПутьКМодулю 		= ПолучитьЗначениеДополнительногоРеквизита(Неопределено, "ПутьКМодулюEDI");	

	Если НЕ ЗначениеЗаполнено(РасположениеМодуля) Тогда
		
		РасположениеМодуля = "Справочник"; 
		
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере       
Функция ПолучитьЗначениеДополнительногоРеквизита(ПараметрОбъект, ПараметрСвойство)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ПараметрОбъект);
	Запрос.УстановитьПараметр("Свойство", ПараметрСвойство);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурEDI_ДополнительныеРеквизиты.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
	               |ГДЕ
	               |	КонтурEDI_ДополнительныеРеквизиты.Объект = &Объект
	               |	И КонтурEDI_ДополнительныеРеквизиты.Свойство = &Свойство";
	
	Результат = Запрос.Выполнить();	
	
	Если Результат.Пустой() Тогда
		
		ЗначениеДопРеквизита = Неопределено;
		
	Иначе
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗначениеДопРеквизита = Выборка.Значение;
		
	КонецЕсли;
	
	Возврат ЗначениеДопРеквизита;
	
КонецФункции
		
&НаСервере
Процедура СохранитьНастройкиНаСервере()

	МенеджерЗаписи = РегистрыСведений.КонтурEDI_ДополнительныеРеквизиты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Неопределено;
	МенеджерЗаписи.Свойство = "РасположениеМодуляEDI";
	МенеджерЗаписи.Значение = РасположениеМодуля;
	МенеджерЗаписи.Записать(); 
	
	МенеджерЗаписи = РегистрыСведений.КонтурEDI_ДополнительныеРеквизиты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Неопределено;
	МенеджерЗаписи.Свойство = "ПутьКМодулюEDI";
	МенеджерЗаписи.Значение = ПутьКМодулю;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СохранитьНастройкиНаСервере();
	ПоказатьОповещениеПользователя("Настройки успешно сохранены");
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРеквизитПутьКМодулю()
	
	Если РасположениеМодуля = "Справочник" Тогда
		Элементы.ПутьКМодулю.Заголовок = "Ссылка";
		                 
		Если ЕстьСправочникДопОбработок Тогда
			Элементы.ПутьКМодулю.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДополнительныеОтчетыИОбработки");
		КонецЕсли;
		
	ИначеЕсли РасположениеМодуля = "Расширение" Тогда
		
		Элементы.ПутьКМодулю.ОграничениеТипа = Новый ОписаниеТипов("Строка");		
		Элементы.ПутьКМодулю.Заголовок = "Обработка";
		
	ИначеЕсли РасположениеМодуля = "Файл" Тогда
		
		Элементы.ПутьКМодулю.ОграничениеТипа = Новый ОписаниеТипов("Строка");		
		Элементы.ПутьКМодулю.Заголовок = "Путь к файлу";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКМодулюНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПутьКМодулюНачалоВыбораФрагмент();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПутьКМодулюНачалоВыбораФрагмент()

	Если РасположениеМодуля = "Файл" Тогда
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок = "Выберите файл";
		Диалог.ПолноеИмяФайла = ""; 
		Диалог.Фильтр = "epf (*.epf)|*.epf"; 
		Диалог.МножественныйВыбор = Ложь;	
		
		Если Диалог.Выбрать() Тогда
			
			ПутьКМодулю = Диалог.ПолноеИмяФайла;
			
		КонецЕсли;
		
	ИначеЕсли РасположениеМодуля = "Справочник"
		ИЛИ РасположениеМодуля = "Расширение" Тогда
		
		Если РасположениеМодуля = "Справочник" Тогда	
			СписокОбработок = СписокОбработокСправочника(); 	
		Иначе 
			СписокОбработок = СписокОбработокКонфигурации();	
		КонецЕсли;   
		
		Если МодальностьЗапрещена Тогда
			
			ПараметрыОповещения = Новый Массив;
			ПараметрыОповещения.Добавить("ПутьКМодулюНачалоВыбораЗавершение");
			ПараметрыОповещения.Добавить(ЭтаФорма);
			
			ОписаниеОповещения = Новый("ОписаниеОповещения", ПараметрыОповещения);
			
			СписокОбработок.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите обработку Контур.EDI", Элементы.ПутьКМодулю); 
			
		Иначе      
			             
			ВыбранныйЭлемент = СписокОбработок.ВыбратьЭлемент("Выберите обработку Контур.EDI", Элементы.ПутьКМодулю);
			ПутьКМодулюНачалоВыбораЗавершение(ВыбранныйЭлемент);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПутьКМодулюНачалоВыбораЗавершение(Результат, ДопПараметры = Неопределено) Экспорт

	Если Результат <> Неопределено Тогда
		ПутьКМодулю = Результат.Значение;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СписокОбработокСправочника()
	
	СписокОбработок = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка,
	               |	ДополнительныеОтчетыИОбработки.Наименование КАК Наименование,
	               |	ДополнительныеОтчетыИОбработки.Версия КАК Версия,
	               |	ДополнительныеОтчетыИОбработки.Публикация КАК Публикация
	               |ИЗ
	               |	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	               |ГДЕ
	               |	НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления
	               |	И ДополнительныеОтчетыИОбработки.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка)";

	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
			
		ТаблицаОбработок = Результат.Выгрузить();
		
		Для Каждого ТекОбработка Из ТаблицаОбработок Цикл
			
			СписокОбработок.Добавить(ТекОбработка.Ссылка, ТекОбработка.Наименование + " v." + ТекОбработка.Версия + " ("+ТекОбработка.Публикация + ")", , БиблиотекаКартинок.СправочникОбъект);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СписокОбработок;
	
КонецФункции

&НаСервере
Функция СписокОбработокКонфигурации()

	СписокОбработокКонфигурации = Новый СписокЗначений;
	Для Каждого Обработка Из Метаданные.Обработки Цикл		
		СписокОбработокКонфигурации.Добавить(Обработка.Имя,,,БиблиотекаКартинок.Обработка);
	КонецЦикла;

	Возврат СписокОбработокКонфигурации;

КонецФункции

&НаСервере
Функция ЕстьСправочникДопОбработокСервер()

	Возврат (НЕ Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") = Неопределено);

КонецФункции

&НаКлиенте
Процедура РасположениеМодуляПриИзменении(Элемент)
	
	Элементы.ПутьКМодулю.ОграничениеТипа = Новый ОписаниеТипов("");
	ПутьКМодулю = Неопределено;
	
	ОбновитьРеквизитПутьКМодулю();
	ПутьКМодулюНачалоВыбораФрагмент();
	
КонецПроцедуры   

&НаСервере
Функция МодальностьЗапрещена()
	
	МодальностьЗапрещена = Ложь;
	
	Попытка
		Если НЕ Метаданные.РежимИспользованияМодальности = Метаданные.СвойстваОбъектов.РежимИспользованияМодальности.Использовать Тогда 
			МодальностьЗапрещена = Истина;
		КонецЕсли;
	Исключение
		_ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат МодальностьЗапрещена;
	
КонецФункции

