&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	МодальностьЗапрещена = Параметры.МодальностьЗапрещена;
	РольПользователяEDI = МодульОбъекта().ПараметрыПользователяEDI.РольПользователяEDI;
	
	УстановитьВидимостьДоступностьЭлементов(); 	
	УстановитьТекстКоличествоСообщенийДляУдаленияСервер();
	ЗаполнитьСписокПартнеровСервер();

КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалить(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если КоличествоСообщенийДляУдаления = 0
		И НЕ КоличествоСообщенийПосчитано Тогда
		ПосчитатьКоличествоСообщений();
	КонецЕсли;
	
	Если КоличествоСообщенийДляУдаления = 0 Тогда
		ТекстПредупреждения = "За выбранный период не найдено сообщений для удаления.";
		
		Если МодальностьЗапрещена Тогда 
			Выполнить("ПоказатьПредупреждение(, ТекстПредупреждения, , ""Контур.EDI"")");
		Иначе
			Предупреждение(ТекстПредупреждения, , "Контур.EDI");
		КонецЕсли;
	Иначе
		ТекстВопроса = "За выбранный период найдено сообщений для удаления: " + КоличествоСообщенийДляУдаления
						+ Символы.ПС + "Вы уверены, что хотите продолжить удаление?";
		КнопкиВопроса = Новый СписокЗначений;
		КнопкиВопроса.Добавить("Да, удалить сообщения");
		КнопкиВопроса.Добавить("Нет");
		ДопПараметрДляПередачиВОбработчик = Неопределено;
		РезультатВопроса = Неопределено;
		
		Если МодальностьЗапрещена Тогда
			Выполнить("ПоказатьВопрос(Новый ОписаниеОповещения(""ОбработчикСогласияУдаленияСообщений"", ЭтаФорма, ДопПараметрДляПередачиВОбработчик), ТекстВопроса, КнопкиВопроса,,,""EDI.Контур"")");
		Иначе
			РезультатВопроса = Вопрос(ТекстВопроса, КнопкиВопроса,,,"EDI.Контур");
			ОбработчикСогласияУдаленияСообщений(РезультатВопроса, ДопПараметрДляПередачиВОбработчик);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСогласияУдаленияСообщений(РезультатВопроса, ДопПараметрОбработчика = Неопределено) Экспорт
	
	Если РезультатВопроса = "Да, удалить сообщения" Тогда
		
		МодульОбъектаКлиент().ОткрытьФормуПроверкиПароляУчетнойЗаписи(Неопределено, Истина, "ОбработчикПроверкиПароляДляУдаленияСообщений", ЭтаФорма); 

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПроверкиПароляДляУдаленияСообщений(РезультатПроверкиПароля, ДопПараметрОбработчика = Неопределено) Экспорт
	
	Если РезультатПроверкиПароля = Истина Тогда
		ОбработчикПродолженияУдаленияСообщений();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработчикПродолженияУдаленияСообщений()

	Состояние("Выполняется удаление сообщений (" + КоличествоСообщенийДляУдаления + ") за период" 
				+ ?(ЗначениеЗаполнено(НачалоПериода), " с " + Формат(НачалоПериода, "ДЛФ=Д"), "") 
				+ " по " + Формат(КонецПериода, "ДЛФ=Д"));
				
	КоличествоСообщенийУдалено = УдалитьСообщенияСервер(НачалоПериода, КонецПериода, Партнер);
	ТекстПредупреждения = "Завершено удаление сообщений: "  + КоличествоСообщенийУдалено;
	
	Если МодальностьЗапрещена Тогда 
		Выполнить("ПоказатьПредупреждение(, ТекстПредупреждения, , ""Контур.EDI"")");
	Иначе
		Предупреждение(ТекстПредупреждения, , "Контур.EDI");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УдалитьСообщенияСервер(НачалоПериода, КонецПериода, Партнер)
	
	КоличествоСообщенийУдалено = МодульОбъекта().УдалитьСообщения_КонтурEDI(НачалоПериода, КонецПериода, Партнер);
	КоличествоСообщенийДляУдаления = КоличествоСообщенийДляУдаления - КоличествоСообщенийУдалено;
	УстановитьТекстКоличествоСообщенийДляУдаленияСервер();
	
	Возврат КоличествоСообщенийУдалено;
	
КонецФункции

&НаКлиенте
Процедура КомандаПосчитать(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ПосчитатьКоличествоСообщений();

КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьКоличествоСообщений()
	
	Состояние("Расчет количества сообщений для удаления");
	ПосчитатьКоличествоСообщенийДляУдаленияСервер(НачалоПериода, КонецПериода, Партнер);
	КоличествоСообщенийПосчитано = Истина;
	УстановитьТекстКоличествоСообщенийДляУдаления();

КонецПроцедуры

&НаСервере
Процедура ПосчитатьКоличествоСообщенийДляУдаленияСервер(НачалоПериода, КонецПериода, Партнер)

	КоличествоСообщенийДляУдаления = МодульОбъекта().ПосчитатьКоличествоСообщенийДляУдаления(НачалоПериода, КонецПериода, Партнер);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()

	Если НЕ РольПользователяEDI = "ПолныеПрава" Тогда
		
		Элементы.НадписьПредупреждениеПраваПользователяEDI.Видимость = Истина;
		Элементы.КнопкаУдалить.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстКоличествоСообщенийДляУдаления()
	
	Если КоличествоСообщенийДляУдаления = 0 
		И НЕ КоличествоСообщенийПосчитано Тогда
		Элементы.КоличествоСообщенийДляУдаления.Формат = "ЧН='не посчитано'";
	ИначеЕсли КоличествоСообщенийДляУдаления = 0
		И КоличествоСообщенийПосчитано Тогда
		Элементы.КоличествоСообщенийДляУдаления.Формат = "ЧН='0'";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстКоличествоСообщенийДляУдаленияСервер()
	
	Если КоличествоСообщенийДляУдаления = 0 
		И НЕ КоличествоСообщенийПосчитано Тогда
		Элементы.КоличествоСообщенийДляУдаления.Формат = "ЧН='не посчитано'";
	ИначеЕсли КоличествоСообщенийДляУдаления = 0
		И КоличествоСообщенийПосчитано Тогда
		Элементы.КоличествоСообщенийДляУдаления.Формат = "ЧН='0'";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьКоличествоСообщенийДляУдаления()
	
	КоличествоСообщенийДляУдаления = 0;
	КоличествоСообщенийПосчитано = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	Если НачалоПериода > КонецПериода
		И ЗначениеЗаполнено(КонецПериода) Тогда 
		НачалоПериода = КонецПериода;
	КонецЕсли;
	
	СброситьКоличествоСообщенийДляУдаления();
	УстановитьТекстКоличествоСообщенийДляУдаления();
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	Если НачалоПериода > КонецПериода Тогда 
		КонецПериода = НачалоПериода;
	КонецЕсли;
	
	СброситьКоличествоСообщенийДляУдаления();
	УстановитьТекстКоличествоСообщенийДляУдаления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "Сервис_УдалениеСообщенийУправляемая");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "Сервис_УдалениеСообщенийУправляемая");
		
	КонецЕсли
	
КонецПроцедуры
                                       
&НаСервере
Процедура ЗаполнитьСписокПартнеровСервер()
	
	МассивПартнеров = МодульОбъекта().ПолучитьСписокЭлементовСправочника("Партнеры").ВыгрузитьКолонку("Ссылка");
	
	Элементы.Партнер.СписокВыбора.ЗагрузитьЗначения(МассивПартнеров);

КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	СброситьКоличествоСообщенийДляУдаления();
	УстановитьТекстКоличествоСообщенийДляУдаления();
	
КонецПроцедуры

