&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;


// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер"		, Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика"	, Объект.ПараметрыКлиентСерверМетрика);
	
	АдресСообщения = Параметры.АдресСообщения;
	АдресКодовМаркировкиТоваров = Параметры.АдресКодовМаркировкиТоваров;
	АдресРасхождений = Параметры.АдресРасхождений;
	СтрокаПозиционирования = Параметры.СтрокаПозиционирования;
	КодыМаркировкиОтредактированыВручную = Параметры.КодыМаркировкиОтредактированыВручную;
	ИмяКолонкиКодовВСообщении = Параметры.ИмяКолонкиКодовВСообщении;
	ПросмотрРасхождений = Параметры.ПросмотрРасхождений;
	ТолькоПросмотрКодов = Параметры.ТолькоПросмотр ИЛИ ПросмотрРасхождений; 
	СкрытьУпаковки = Параметры.СкрытьУпаковки;
	
	Если Не ЗначениеЗаполнено(ИмяКолонкиКодовВСообщении) Тогда
		ИмяКолонкиКодовВСообщении = "КодыМаркировки";
	КонецЕсли;
	
	Заголовок = Заголовок + СтрЗаменить(НРег(ИмяКолонкиКодовВСообщении), "кодымаркировки", " ");
	
	НастроитьЭлементыФормы();
	ЗаполнитьДанныеФормы();
	
	Если Объект.ПараметрыКлиентСервер.ТекущийВариантИнтерфейса = "Версия8_5" Тогда
		АдаптироватьФормуПодИнтерфейс85();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьФормуПодИнтерфейс85()
	
	Элементы.КодыМаркировки.РежимВыделения = РежимВыделенияТаблицы.Одиночный;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "Сервис_КодыМаркировкиУправляемая");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()
	
	ЗаполнитьДеревоНаФорме();
	
	Если ПросмотрРасхождений Тогда
		ЗаполнитьДеревьяРасхождений();
	КонецЕсли;
	
	СпозиционироватьсяНаСтрокеТовара(СтрокаПозиционирования);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревьяРасхождений()
	
	ПолноеДерево = РеквизитФормыВЗначение("КодыМаркировки");
	ДеревоВсехКодов = ПоместитьВоВременноеХранилище(ПолноеДерево, УникальныйИдентификатор);
	
	ТаблицаРасхожденийКодовМаркировки = Неопределено;
	
	Если ЭтоАдресВременногоХранилища(АдресРасхождений) Тогда
		ТаблицаРасхожденийКодовМаркировки = ПолучитьИзВременногоХранилища(АдресРасхождений);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТаблицаРасхожденийКодовМаркировки) Тогда
		ДеревоРасхождений = ДеревоВсехКодов;
		Возврат;
	КонецЕсли;
	
	ТаблицаРасхожденийКодовМаркировки.ЗаполнитьЗначения(Ложь, "Обработан");
	
	СтруктураПоискаСтрокиРасхождений = Новый Структура;
	СтруктураПоискаСтрокиРасхождений.Вставить("НомерСтроки");
	СтруктураПоискаСтрокиРасхождений.Вставить("Наименование");
	СтруктураПоискаСтрокиРасхождений.Вставить("Номенклатура");
	СтруктураПоискаСтрокиРасхождений.Вставить("ХарактеристикаНоменклатуры");
	СтруктураПоискаСтрокиРасхождений.Вставить("ЕдиницаИзмерения");
	СтруктураПоискаСтрокиРасхождений.Вставить("СерияНоменклатуры");
	СтруктураПоискаСтрокиРасхождений.Вставить("Артикул");
	СтруктураПоискаСтрокиРасхождений.Вставить("Обработан", Ложь);

	КопияДерева = ПолноеДерево.Скопировать();
	Для каждого Строка Из КопияДерева.Строки Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоискаСтрокиРасхождений, Строка);
		СтрокиСРасхождениями = ТаблицаРасхожденийКодовМаркировки.НайтиСтроки(СтруктураПоискаСтрокиРасхождений);
		
		Для каждого СтрокаРасхождений Из СтрокиСРасхождениями Цикл
			
			Если СтрокаРасхождений.ЕстьВПриемке = Истина Тогда
			
				СтрокаКода = Строка.Строки.Найти(СтрокаРасхождений.Код, "Код");
				Если Не СтрокаКода = Неопределено Тогда
					
					СтрокаКода.ОписаниеРасхождения = "Нет в документе об отгрузке";
					СтрокаКода.ЕстьРасхождение = Истина;
					СтрокаРасхождений.Обработан = Истина;
					Строка.ЕстьРасхождение = Истина;
					
				КонецЕсли;
				
			Иначе
				
				НоваяСтрокаКода = Строка.Строки.Добавить();
				НоваяСтрокаКода.Код = СтрокаРасхождений.Код;
				НоваяСтрокаКода.Вид = СтрокаРасхождений.Вид;
				НоваяСтрокаКода.ПредставлениеКода = СтрокаРасхождений.Код;
				НоваяСтрокаКода.ОписаниеРасхождения = "Нет в уведомлении о приемке";
				НоваяСтрокаКода.Картинка = КартинкаДляВидаКода(СтрокаРасхождений.Вид);
				НоваяСтрокаКода.НомерСтроки = Строка.НомерСтроки;
				НоваяСтрокаКода.НомерУпаковки = Строка.НомерУпаковки;
				НоваяСтрокаКода.СоставУпаковки = Строка.СоставУпаковки;
				НоваяСтрокаКода.ЕстьРасхождение = Истина;
				
				СтрокаРасхождений.Обработан = Истина;
				Строка.ЕстьРасхождение = Истина;
				
			КонецЕсли;
						
		КонецЦикла;
		
	КонецЦикла;
	
	НеобработанныеСтроки = ТаблицаРасхожденийКодовМаркировки.НайтиСтроки(Новый Структура("Обработан", Ложь));
	СвойстваТовара = "НомерСтроки,Номенклатура,Наименование,Артикул,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,СерияНоменклатуры";

	Для каждого Строка Из НеобработанныеСтроки Цикл
		
		СтрокаДерева = КопияДерева.Строки.Найти(Строка.НомерСтроки, "НомерСтроки");
		Если СтрокаДерева = Неопределено Тогда
			СтрокаДерева = КопияДерева.Строки.Добавить();
		    ЗаполнитьЗначенияСвойств(СтрокаДерева, Строка, СвойстваТовара);
		КонецЕсли;
		
		НоваяСтрокаКода = СтрокаДерева.Строки.Добавить();
		НоваяСтрокаКода.Код = Строка.Код;
		НоваяСтрокаКода.Вид = Строка.Вид;
		НоваяСтрокаКода.ПредставлениеКода = Строка.Код;
		НоваяСтрокаКода.ОписаниеРасхождения = "Нет в уведомлении о приемке";
		НоваяСтрокаКода.НомерСтроки = СтрокаДерева.НомерСтроки;
		НоваяСтрокаКода.НомерУпаковки = СтрокаДерева.НомерУпаковки;
		НоваяСтрокаКода.СоставУпаковки = СтрокаДерева.СоставУпаковки;
		НоваяСтрокаКода.ЕстьРасхождение = Истина;
		
		СтрокаДерева.ЕстьРасхождение = Истина;
		
	КонецЦикла;
	
	ДеревоРасхождений = ПоместитьВоВременноеХранилище(КопияДерева, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьДеревоИзХранилища(АдресВХранилище, НомерАктивнойСтроки = Неопределено)
	
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		ДеревоКодов = ПолучитьИзВременногоХранилища(АдресВХранилище);
		ЗначениеВРеквизитФормы(ДеревоКодов, "КодыМаркировки");
	КонецЕсли;
	
	Если Не НомерАктивнойСтроки = Неопределено Тогда
		СпозиционироватьсяНаСтрокеТовара(НомерАктивнойСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Если ТолькоПросмотрКодов Тогда
		Элементы.ФормаПодменюЗагрузить.Видимость = Ложь;
		Элементы.КодыМаркировки.ТолькоПросмотр = Истина;
		Элементы.ФормаСохранитьИЗакрыть.Заголовок = "Закрыть";
	КонецЕсли;
	
	Если ПросмотрРасхождений Тогда
		Элементы.КодыМаркировкиПоказыватьРасхождения.Видимость = Истина;
		Элементы.КодыМаркировкиОписаниеРасхождения.Видимость = Истина;
	КонецЕсли;
	
	Если СкрытьУпаковки Тогда
		Элементы.КодыМаркировкиСоставУпаковки.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.КодыМаркировкиВид.СписокВыбора.Очистить();
	ВидыКодовМаркироки = МодульОбъекта().ПолучитьСписокЗначенийПеречисленияEDI("ВидыКодовМаркировки");
	
	Для каждого ВидКодаМаркировки Из ВидыКодовМаркироки Цикл
		Элементы.КодыМаркировкиВид.СписокВыбора.Добавить(ВидКодаМаркировки.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СпозиционироватьсяНаСтрокеТовара(НомерСтроки)
	
	Если Не ЗначениеЗаполнено(НомерСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыПервогоУровня = КодыМаркировки.ПолучитьЭлементы();
	ИдентификаторСтроки = Неопределено;
	
	Для каждого Строка Из ЭлементыПервогоУровня Цикл
	
		Если Строка.НомерСтроки = НомерСтроки Тогда
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Элементы.КодыМаркировки.ТекущаяСтрока = ИдентификаторСтроки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоНаФорме()
	
	КодыМаркировки.ПолучитьЭлементы().Очистить();
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресКодовМаркировкиТоваров) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКодовМаркировки = ПолучитьИзВременногоХранилища(АдресКодовМаркировкиТоваров);
	
	Если НЕ ТипЗнч(ТаблицаКодовМаркировки) = Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваТовара = "НомерСтроки,Наименование,Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,СерияНоменклатуры,Артикул";
	
	ТаблицаПоАналитике = ТаблицаКодовМаркировки.Скопировать(, СвойстваТовара);
	ТаблицаПоАналитике.Свернуть(СвойстваТовара);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("НомерСтроки");
	СтруктураПоиска.Вставить("Наименование");
	СтруктураПоиска.Вставить("Номенклатура");
	СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры");
	СтруктураПоиска.Вставить("ЕдиницаИзмерения");
	СтруктураПоиска.Вставить("СерияНоменклатуры");
	СтруктураПоиска.Вставить("Артикул");
	
	Для каждого СтрокаАналитики Из ТаблицаПоАналитике Цикл
		
		УровеньТовара = КодыМаркировки.ПолучитьЭлементы().Добавить();
		
		ЗаполнитьЗначенияСвойств(УровеньТовара, СтрокаАналитики, СвойстваТовара);
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, УровеньТовара); 
		
		УровеньТовара.ПредставлениеНомераСтроки = СтрокаАналитики.НомерСтроки;
		
		НайденныеСтроки = ТаблицаКодовМаркировки.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Если Не ЗначениеЗаполнено(НайденнаяСтрока.Код) 
				И Не ЗначениеЗаполнено(НайденнаяСтрока.Вид) Тогда
				Продолжить;
			КонецЕсли;
			
			УровеньКодаМаркировки = УровеньТовара.ПолучитьЭлементы().Добавить();
			УровеньКодаМаркировки.Код = НайденнаяСтрока.Код;
			УровеньКодаМаркировки.Вид = НайденнаяСтрока.Вид;
			УровеньКодаМаркировки.ПредставлениеКода = НайденнаяСтрока.Код;
			УровеньКодаМаркировки.Картинка = КартинкаДляВидаКода(НайденнаяСтрока.Вид);
			УровеньКодаМаркировки.НомерСтроки = СтрокаАналитики.НомерСтроки;
			УровеньКодаМаркировки.НомерУпаковки = НайденнаяСтрока.НомерУпаковки;
			УровеньКодаМаркировки.СоставУпаковки = НайденнаяСтрока.СоставУпаковки;
			
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция КартинкаДляВидаКода(ВидКода)
	
	СоответствиеКартинок = Новый Соответствие;
	СоответствиеКартинок.Вставить("Транспортный"	, 1);
	СоответствиеКартинок.Вставить("Групповой"		, 2);
	СоответствиеКартинок.Вставить("Набор"			, 3);
	СоответствиеКартинок.Вставить("Индивидуальный"	, 4);
	
	ИндексКартинки = СоответствиеКартинок[ВидКода];
	
	Если ИндексКартинки = Неопределено Тогда
		ИндексКартинки = 0;
	КонецЕсли;	
	
	Возврат ИндексКартинки;
	
КонецФункции

&НаКлиенте
Процедура КодыМаркировкиВидПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.КодыМаркировки.ТекущиеДанные;
	ТекущиеДанные.Картинка = КартинкаДляВидаКода(ТекущиеДанные.Вид);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	РезультатРедактирования = Новый Структура;
	РезультатРедактирования.Вставить("КодыМаркировкиОтредактированыВручную", КодыМаркировкиОтредактированыВручную);
	РезультатРедактирования.Вставить("РазвернутаяТаблицаКодовМаркировки", ПодготовитьРезультатРедактирования());
	
	ЭтаФорма.Закрыть(РезультатРедактирования);
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьРезультатРедактирования()
	
	РезультатРедактирования = Новый Массив;
	
	Для каждого СтрокаНоменклатуры Из КодыМаркировки.ПолучитьЭлементы() Цикл
		Для каждого СтрокаКодаМаркировки Из СтрокаНоменклатуры.ПолучитьЭлементы() Цикл
			
			ЗаписьРезультата = Новый Структура;
			ЗаписьРезультата.Вставить("НомерСтроки", СтрокаНоменклатуры.НомерСтроки);
			ЗаписьРезультата.Вставить("НомерУпаковки", СтрокаКодаМаркировки.НомерУпаковки);
			ЗаписьРезультата.Вставить("КодМаркировки", СтрЗаменить(СтрокаКодаМаркировки.Код, Символ(29), ""));
			ЗаписьРезультата.Вставить("ВидКодаМаркировки", СтрокаКодаМаркировки.Вид);
			
			РезультатРедактирования.Добавить(ЗаписьРезультата);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат РезультатРедактирования;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоИсточника(Команда)
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("УниверсальнаяФормаЗагрузкиИзТабличногоДокументаУправляемая",
												 Неопределено,
												 ПараметрыЗагрузкиИзВнешнегоИсточника(),
												 ЭтаФорма,
												 "ОбработчикЗагрузкиДанныхИзВнешнегоИсточника",
												 ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗагрузкиДанныхИзВнешнегоИсточника(РезультатЗагрузки, ДопПараметры) Экспорт
	
	Если РезультатЗагрузки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.КодыМаркировки.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Код) Тогда
		НомерСтрокиТоваров = ТекущиеДанные.НомерСтроки;
	Иначе
		НомерСтрокиТоваров = ТекущиеДанные.ПолучитьРодителя().НомерСтроки;
	КонецЕсли;
	
	ЗагрузитьКодыВДерево(РезультатЗагрузки, НомерСтрокиТоваров);
	
	СтрокаТоваровСДобавленнымиКодами = Неопределено;
	Для каждого СтрокаТоваров Из КодыМаркировки.ПолучитьЭлементы() Цикл
		
		Если СтрокаТоваров.НомерСтроки = НомерСтрокиТоваров Тогда
			СтрокаТоваровСДобавленнымиКодами = СтрокаТоваров;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не СтрокаТоваровСДобавленнымиКодами = Неопределено Тогда
		
		КоллекцияКодов = СтрокаТоваровСДобавленнымиКодами.ПолучитьЭлементы();
		ПоследнийКод = КоллекцияКодов.Получить(КоллекцияКодов.Количество() - 1);
		Элементы.КодыМаркировки.ТекущаяСтрока = ПоследнийКод.ПолучитьИдентификатор();
		
	КонецЕсли;
	
	КодыМаркировкиОтредактированыВручную = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКодыВДерево(ТаблицаКодовМаркировки, НомерСтрокиТоваров)
	
	ДанныеДерева = РеквизитФормыВЗначение("КодыМаркировки");
	
	Для каждого СтрокаНоменклатуры Из ДанныеДерева.Строки Цикл
		
		Если СтрокаНоменклатуры.НомерСтроки = НомерСтрокиТоваров Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ДоступныеВидыКодовМаркировки = Новый Массив;
	
	Для каждого ЭлементПеречисления Из МодульОбъекта().ПолучитьСписокЗначенийПеречисленияEDI("ВидыКодовМаркировки") Цикл
		ДоступныеВидыКодовМаркировки.Добавить(НРег(ЭлементПеречисления.Представление));
	КонецЦикла;
	
	Для каждого ДанныеКодаМаркировки Из ТаблицаКодовМаркировки Цикл
		
		КодМаркировки = ДанныеКодаМаркировки.КодМаркировки;
		
		Если Не СтрокаНоменклатуры.Строки.Найти(КодМаркировки, "Код") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйКодМаркировки = СтрокаНоменклатуры.Строки.Добавить();
		НовыйКодМаркировки.Код = КодМаркировки;
		НовыйКодМаркировки.ПредставлениеКода = КодМаркировки;
		
		Если ДоступныеВидыКодовМаркировки.Найти(НРег(ДанныеКодаМаркировки.ВидКодаМаркировки)) = Неопределено Тогда
			НовыйКодМаркировки.Вид = "Индивидуальный";
		Иначе
			НовыйКодМаркировки.Вид = ТРег(ДанныеКодаМаркировки.ВидКодаМаркировки);
		КонецЕсли;
		
		НовыйКодМаркировки.Картинка = КартинкаДляВидаКода(НовыйКодМаркировки.Вид);
		НовыйКодМаркировки.НомерСтроки = СтрокаНоменклатуры.НомерСтроки;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДанныеДерева,"КодыМаркировки");
	
КонецПроцедуры

&НаСервере
Функция ПараметрыЗагрузкиИзВнешнегоИсточника()
	
	ОписаниеТаблицыКодов = МодульОбъекта().ОписаниеТаблицыКодовМаркировкиДляЗагрузки();
	АдресВХТаблицы = ПоместитьВоВременноеХранилище(ОписаниеТаблицыКодов, ЭтаФорма.УникальныйИдентификатор);
	
	ПараметрыФормыЗагрузки = Новый Структура;
	ПараметрыФормыЗагрузки.Вставить("КолонкиВнешнейТаблицыАдресВХ", АдресВХТаблицы);
		
	Возврат ПараметрыФормыЗагрузки;
	
КонецФункции

&НаКлиенте
Процедура СвернутьВсе(Команда)
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	СвернутьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	РазвернутьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево()
	
	Для каждого СтрокаДерева Из КодыМаркировки.ПолучитьЭлементы() Цикл
		Элементы.КодыМаркировки.Развернуть(СтрокаДерева.ПолучитьИдентификатор(),Истина);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево()
	
	Для каждого СтрокаДерева Из КодыМаркировки.ПолучитьЭлементы() Цикл
		Элементы.КодыМаркировки.Свернуть(СтрокаДерева.ПолучитьИдентификатор());	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если ТолькоПросмотрКодов Тогда
		Возврат;
	КонецЕсли;

	СтрокиКУдалению = Новый Массив;
	
	ВыделенныеСтрокиКодыМаркировки = МодульОбъектаКлиент().ВыделенныеСтрокиТаблицыФормы_КонтурEDI(Элементы.КодыМаркировки);
		
	Для каждого ИдентификаторСтроки Из ВыделенныеСтрокиКодыМаркировки Цикл
		
		СтрокаДерева = КодыМаркировки.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если СтрокаДерева.ПолучитьРодителя() = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиКУдалению.Добавить(СтрокаДерева);
		
	КонецЦикла;
	
	Если СтрокиКУдалению.Количество() > 0 Тогда
		
		КодыМаркировкиОтредактированыВручную = Истина;
		
	КонецЕсли;
	
	Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		СтрокаКУдалению.ПолучитьРодителя().ПолучитьЭлементы().Удалить(СтрокаКУдалению);
	КонецЦикла;
	
	ВыделенныеСтрокиКодыМаркировки = МодульОбъектаКлиент().ВыделенныеСтрокиТаблицыФормы_КонтурEDI(Элементы.КодыМаркировки);	
	ВыделенныеСтрокиКодыМаркировки.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзДокумента1С(Команда)
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ЗагрузитьИзДокумента1СНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзДокумента1СНаСервере()
	
	Если Не ЭтоАдресВременногоХранилища(АдресСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	Сообщение = ПолучитьИзВременногоХранилища(АдресСообщения);
	КопияСообщения = МодульОбъекта().ПолучитьКопиюСообщения(Сообщение);
	
	МодульОбъекта().ДополнитьСообщениеКодамиМаркировки(КопияСообщения, Новый Структура);
	МодульОбъекта().ДозаполнитьАртикулКодПолноеНаименованиеВТаблицеТоваров(КопияСообщения.Товары);
	
	Если МодульОбъекта().ПеременнаяСодержитСвойство(КопияСообщения, "ТранспортныеУпаковки") Тогда
		ТранспортныеУпаковки = КопияСообщения.ТранспортныеУпаковки;
	Иначе
		ТранспортныеУпаковки = Новый ДеревоЗначений;
	КонецЕсли;
	
	ТаблицаКодов = МодульОбъекта().РазвернутаяТаблицаКодовМаркировки_КонтурEDI(КопияСообщения.Товары, ТранспортныеУпаковки, Истина, ИмяКолонкиКодовВСообщении);
	АдресКодовМаркировкиТоваров = ПоместитьВоВременноеХранилище(ТаблицаКодов, ЭтаФорма.УникальныйИдентификатор);
	
	ЗаполнитьДанныеФормы();	

	КодыМаркировкиОтредактированыВручную = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования Тогда
		КодыМаркировкиОтредактированыВручную = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьРасхождения(Команда)
	
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	АктивнаяСтрокаАналитики = Элементы.КодыМаркировки.ТекущиеДанные.ПолучитьРодителя();
	Если АктивнаяСтрокаАналитики = Неопределено Тогда
		АктивнаяСтрокаАналитики = Элементы.КодыМаркировки.ТекущиеДанные;
	КонецЕсли;
	
	НомерАктивнойСтроки = АктивнаяСтрокаАналитики.НомерСтроки;
	
	Кнопка = Элементы.КодыМаркировкиПоказыватьРасхождения;
	Кнопка.Пометка = Не Кнопка.Пометка;
	
	Если Кнопка.Пометка Тогда
		ВосстановитьДеревоИзХранилища(ДеревоРасхождений, НомерАктивнойСтроки);
	Иначе
		ВосстановитьДеревоИзХранилища(ДеревоВсехКодов, НомерАктивнойСтроки);
	КонецЕсли;
	
	РазвернутьДерево();
	
КонецПроцедуры
