
&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаКлиенте
Перем МодульОбъектаКлиент;

&НаКлиенте
Перем МодульОбменКлиент;

&НаКлиенте
Перем КэшОсновногоМодуля;


&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция ОсновнойМодуль() Экспорт
	
	Если КэшОсновногоМодуля = Неопределено Тогда 
		КэшОсновногоМодуля = ВладелецФормы;
	КонецЕсли;
	
	Возврат КэшОсновногоМодуля;
	
КонецФункции

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта = Неопределено Тогда
		КэшМодуляОбъекта = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	ПутьКФорме = ПутьКФормеМодуляКлиента();
	
	Результат = ОткрытьФорму(ПутьКФорме);
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбменКлиент()
	
	Если ТипЗнч(МодульОбменКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбменКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбменКлиент = ОсновнаяФорма.МодульОбменКлиент();
		Возврат МодульОбменКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", Объект.ПараметрыКлиентСервер);
	
	ПредставлениеСертификата = "";
	Параметры.Свойство("ПредставлениеСертификата", ПредставлениеСертификата);
	Параметры.Свойство("ДанныеАвторизации", ДанныеАвторизации);
	Параметры.Свойство("ИдентификаторОрганизацииДиадок", ИдентификаторОрганизацииДиадок);
	Параметры.Свойство("ИдентификаторПользователя", ИдентификаторПользователя);
	Параметры.Свойство("ИдентификаторЯщикаДиадок", ИдентификаторЯщикаДиадок);
	
	Элементы.ПредставлениеСертификата.Заголовок = "Сертификат: " + ПредставлениеСертификата;
	
КонецПроцедуры

&НаКлиенте
Процедура Интерфейс_ВыбранФайлДоверенности(ПолноеИмяФайла)
	
	Элементы.КартинкаВыборФайлаДоверенности.Видимость = Ложь;
	Элементы.НадписьИмяФайлаДоверенности.Заголовок = ПолноеИмяФайла;
	Элементы.ГруппаВыбранныйФайлДоверенности.Видимость = Истина;
	
	Интерфейс_ДоверенностьНеПривязана();
	
	ВыбраныОбаФайла = ЗначениеЗаполнено(ДвоичныеДанныеДоверенности) И ЗначениеЗаполнено(ДвоичныеДанныеПодписи);

	Элементы.Выбрать.Доступность = ВыбраныОбаФайла И ДоверенностьЗарегистрированна;
	Элементы.НадписьЗарегистрироватьДоверенность.Доступность = ВыбраныОбаФайла;
	
	Элементы.КартинкаПустойЧекБокс_Зарегистировать.Видимость = Истина;
	Элементы.КартинкаОжидание_Зарегистрировать.Видимость = Ложь;
	Элементы.КартинкаГалкаЧекБокс_Зарегистрировать.Видимость = Ложь; 
	
КонецПроцедуры

&НаКлиенте
Процедура Интерфейс_ВыбранФайлПодписи(ПолноеИмяФайла)
	
	Элементы.КартинкаВыборФайлаПодписи.Видимость = Ложь;
	Элементы.НадписьИмяФайлаПодписи.Заголовок = ПолноеИмяФайла;
	Элементы.ГруппаВыбранныйФайлПодписи.Видимость = Истина;     
	
	Интерфейс_ДоверенностьНеПривязана();
	
	ВыбраныОбаФайла = ЗначениеЗаполнено(ДвоичныеДанныеДоверенности) И ЗначениеЗаполнено(ДвоичныеДанныеПодписи);

	Элементы.Выбрать.Доступность = ВыбраныОбаФайла И ДоверенностьЗарегистрированна;
	Элементы.НадписьЗарегистрироватьДоверенность.Доступность = ВыбраныОбаФайла;
	
	Элементы.КартинкаПустойЧекБокс_Зарегистировать.Видимость = Истина;
	Элементы.КартинкаОжидание_Зарегистрировать.Видимость = Ложь;
	Элементы.КартинкаГалкаЧекБокс_Зарегистрировать.Видимость = Ложь;  
	
КонецПроцедуры

&НаКлиенте
Процедура Интерфейс_ДоверенностьУспешноПривязана()
	
	Элементы.КартинкаПустойЧекБокс_Привязать.Видимость = Ложь;
	Элементы.КартинкаГалкаЧекБокс_Привязать.Видимость = Истина;
	Элементы.НадписьПривязатьДоверенность.Заголовок = "Доверенность привязана к сотруднику";
	Элементы.НадписьПривязатьДоверенность.Гиперссылка = Ложь;  
	
КонецПроцедуры

&НаКлиенте
Процедура Интерфейс_ДоверенностьНеПривязана()
	
	Элементы.НадписьПривязатьДоверенность.Доступность = ДоверенностьЗарегистрированна;
	
	Элементы.КартинкаПустойЧекБокс_Привязать.Видимость = Истина;
	Элементы.КартинкаГалкаЧекБокс_Привязать.Видимость = Ложь;
	Элементы.НадписьПривязатьДоверенность.Заголовок = "Привязать доверенность к сотруднику в Диадок";
	Элементы.НадписьПривязатьДоверенность.Гиперссылка = Истина;  
	
КонецПроцедуры

&НаКлиенте
Процедура Интерфейс_ФайлДоверенностиНеВыбран()
	
	Элементы.КартинкаВыборФайлаДоверенности.Видимость = Истина;
	Элементы.НадписьИмяФайлаДоверенности.Заголовок = "Не выбран";
	Элементы.ГруппаВыбранныйФайлДоверенности.Видимость = Ложь;

	Элементы.Выбрать.Доступность = Ложь;
	Элементы.НадписьЗарегистрироватьДоверенность.Доступность = Ложь;
	
	Интерфейс_ДоверенностьНеПривязана();
	
КонецПроцедуры

&НаКлиенте
Процедура Интерфейс_ФайлПодписиНеВыбран()
	
	Элементы.КартинкаВыборФайлаПодписи.Видимость = Истина;
	Элементы.НадписьИмяФайлаПодписи.Заголовок = "Не выбран";
	Элементы.ГруппаВыбранныйФайлПодписи.Видимость = Ложь;
	
	Элементы.Выбрать.Доступность = Ложь;
	Элементы.НадписьЗарегистрироватьДоверенность.Доступность = Ложь;
	
	Интерфейс_ДоверенностьНеПривязана();
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаВыборФайлаДоверенностиНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ИмяОбработчика 		  = "ПослеВыбораФайлаДоверенности";
	КонтекстОбработчика   = ЭтаФорма;
	ПараметрыОбработчика  = Новый Структура;
	МножественныйВыбор	  = Ложь;
	Фильтр 				  = "Файл доверенности (*.xml)|*.xml";
	ЗаголовокВыбораФайла  = "Выберите файл доверенности"; 
	РежимДиалога 		  = РежимДиалогаВыбораФайла.Открытие; 
	ПолучаемыеФайлы 	  = Неопределено;
	
	МодульОбъектаКлиент().ОткрытьДиалогВыбораФайла_КонтурEDI(ИмяОбработчика,
															КонтекстОбработчика,
															ПараметрыОбработчика,
															МножественныйВыбор,
															Фильтр,
															ЗаголовокВыбораФайла,
															РежимДиалога,
															ПолучаемыеФайлы);
															
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаДоверенности(ВыбранныеФайлы, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Или ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ВыбранныйФайл = ВыбранныеФайлы[0];
	 
	Если ТипЗнч(ВыбранныйФайл) = Тип("ОписаниеПереданногоФайла") Тогда
		ПолноеИмя = ВыбранныйФайл.ПолноеИмя;
	ИначеЕсли ТипЗнч(ВыбранныйФайл) = Тип("ОписаниеПередаваемогоФайла") Тогда
		ПолноеИмя = ВыбранныйФайл.Имя; 
	КонецЕсли;

	ДвоичныеДанныеДоверенности = ПолучитьИзВременногоХранилища(ВыбранныйФайл.Хранение);
	
	ДоверенностьЗарегистрированна = Ложь;
	TaskId = "";
	
	Интерфейс_ВыбранФайлДоверенности(ПолноеИмя);
	
КонецПроцедуры

&НаСервере
Функция ИнформацияОДоверенностиИзXML(ТекстXML)
	
	Возврат МодульОбъекта().ИнформацияОДоверенностиИзXML(ТекстXML);
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораФайлаПодписи(ВыбранныеФайлы, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Или ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйФайл = ВыбранныеФайлы[0];
	 
	Если ТипЗнч(ВыбранныйФайл) = Тип("ОписаниеПереданногоФайла") Тогда
		ПолноеИмя = ВыбранныйФайл.ПолноеИмя;
	ИначеЕсли ТипЗнч(ВыбранныйФайл) = Тип("ОписаниеПередаваемогоФайла") Тогда
		ПолноеИмя = ВыбранныйФайл.Имя; 
	КонецЕсли;

	ДвоичныеДанныеПодписи = ПолучитьИзВременногоХранилища(ВыбранныйФайл.Хранение);
	
	ДоверенностьЗарегистрированна = Ложь;
	TaskId = "";
	
	Интерфейс_ВыбранФайлПодписи(ПолноеИмя);
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаВыборФайлаПодписиНажатие(Элемент)                
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ИмяОбработчика 		  = "ПослеВыбораФайлаПодписи";
	КонтекстОбработчика   = ЭтаФорма;
	ПараметрыОбработчика  = Новый Структура;
	МножественныйВыбор	  = Ложь;
	Фильтр 				  = "Файл подписи (*.sig;*.sgn;*.sign;*.p7s)|*.sig;*.sgn;*.sign;*.p7s";
	ЗаголовокВыбораФайла  = "Выберите файл подписи"; 
	РежимДиалога 		  = РежимДиалогаВыбораФайла.Открытие; 
	ПолучаемыеФайлы 	  = Неопределено;
	
	МодульОбъектаКлиент().ОткрытьДиалогВыбораФайла_КонтурEDI(ИмяОбработчика,
															КонтекстОбработчика,
															ПараметрыОбработчика,
															МножественныйВыбор,
															Фильтр,
															ЗаголовокВыбораФайла,
															РежимДиалога,
															ПолучаемыеФайлы);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаКрестикДоверенностьНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Доверенность = Неопределено;
	ДвоичныеДанныеДоверенности = Неопределено;
	ДоверенностьЗарегистрированна = Ложь;
	Интерфейс_ФайлДоверенностиНеВыбран();
	СнятьПометку_ЗарегистированВФНС();
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаКрестикПодписьНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ДвоичныеДанныеПодписи = Неопределено;
	ДоверенностьЗарегистрированна = Ложь;
	Интерфейс_ФайлПодписиНеВыбран();
	СнятьПометку_ЗарегистированВФНС();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ЭтаФорма.Закрыть(Доверенность);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ЭтаФорма.Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьЗарегистрироватьДоверенностьНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Элементы.КартинкаПустойЧекБокс_Зарегистировать.Видимость = Ложь;
	Элементы.КартинкаОжидание_Зарегистрировать.Видимость = Истина;
	
	ПодключитьОбработчикОжидания("ЗарегистироватьДоверенность", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистироватьДоверенность() Экспорт
	
	МашиночитаемаяДоверенностьДляРегистрации = МодульОбъектаКлиент().КонтурДиадокAPI_СоздатьПоСхеме("PowerOfAttorneyToRegister", Истина);
	
	МашиночитаемаяДоверенностьДляРегистрации.СоставнойИдентификатор.РегистрационныеНомер = "";
	МашиночитаемаяДоверенностьДляРегистрации.СоставнойИдентификатор.ИННДоверителя = "";
	МашиночитаемаяДоверенностьДляРегистрации.СоставнойИдентификатор.ИННПредставителя = "";
	МашиночитаемаяДоверенностьДляРегистрации.СодержимоеФайлаДоверенностиИПодписи.ФайлДоверенности.Контент = Base64Строка(ДвоичныеДанныеДоверенности);
	МашиночитаемаяДоверенностьДляРегистрации.СодержимоеФайлаДоверенностиИПодписи.ФайлПодписи.Контент = Base64Строка(ДвоичныеДанныеПодписи);
	
	РезультатАсинхроногоМетода = МодульОбменКлиент().ЗарегистрироватьДоверенность(ДанныеАвторизации, ИдентификаторЯщикаДиадок, МашиночитаемаяДоверенностьДляРегистрации);
	
	TaskId = РезультатАсинхроногоМетода.Идентификатор;
	
	ПодключитьОбработчикОжидания("ПроверитьРегистрациюДоверенности", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРегистрациюДоверенности() Экспорт
	
	РезультатРегистрацииМашиночитаемойДоверенности = МодульОбменКлиент().ПроверитьРегистрациюДоверенности(ДанныеАвторизации, ИдентификаторЯщикаДиадок, TaskId);
	
	Если Врег(РезультатРегистрацииМашиночитаемойДоверенности.СтатусВыполненияОперации) = "DONE"
		И Врег(РезультатРегистрацииМашиночитаемойДоверенности.СтатусМашиночитаемойДоверенности.Статус) = "ACTIVE" Тогда
		
		ОтключитьОбработчикОжидания("ПроверитьРегистрациюДоверенности");
		
		Элементы.КартинкаОжидание_Зарегистрировать.Видимость = Ложь;
		Элементы.КартинкаГалкаЧекБокс_Зарегистрировать.Видимость = Истина;
		Элементы.Выбрать.Доступность = Истина;

		Элементы.НадписьЗарегистрироватьДоверенность.Заголовок = "Успешно зарегистрирована";
		Элементы.НадписьЗарегистрироватьДоверенность.Гиперссылка = Ложь;
		
		Элементы.НадписьПривязатьДоверенность.Доступность = Истина;
		
		ДоверенностьЗарегистрированна = Истина;
		
		Доверенность = РезультатРегистрацииМашиночитаемойДоверенности.МашиночитаемаяДоверенность;
		Доверенность.ДатаНачала = МодульОбъектаКлиент().КонтурСтандарт_Ticks_to_Date(Доверенность.ДатаНачала.КоличествоТиков); 	
		Доверенность.СрокДействия = МодульОбъектаКлиент().КонтурСтандарт_Ticks_to_Date(Доверенность.СрокДействия.КоличествоТиков);

	ИначеЕсли НЕ ((Врег(РезультатРегистрацииМашиночитаемойДоверенности.СтатусВыполненияОперации) = "QUEUED")
			Или (Врег(РезультатРегистрацииМашиночитаемойДоверенности.СтатусВыполненияОперации) = "PROCESSING")) Тогда
		
		ОтключитьОбработчикОжидания("ПроверитьРегистрациюДоверенности");
		
		Элементы.КартинкаОжидание_Зарегистрировать.Видимость = Ложь;
		Элементы.КартинкаПустойЧекБокс_Зарегистировать.Видимость = Истина;
		Элементы.Выбрать.Доступность = Ложь;
		
		Элементы.НадписьЗарегистрироватьДоверенность.Заголовок = "Зарегистрировать доверенность";
		Элементы.НадписьЗарегистрироватьДоверенность.Гиперссылка = Истина;
		
		Элементы.НадписьПривязатьДоверенность.Доступность = Ложь;
		
		ДоверенностьЗарегистрированна = Ложь; 
		
		Текст = "Не удалось зарегистрировать доверенность по причине:
				|Статус: " + Врег(РезультатРегистрацииМашиночитаемойДоверенности.СтатусВыполненияОперации) + "
				|Статус доверенности: " + Врег(РезультатРегистрацииМашиночитаемойДоверенности.СтатусМашиночитаемойДоверенности.Статус) + "
				|Ошибки:";
				
				Для Каждого Ошибка из РезультатРегистрацииМашиночитаемойДоверенности.Ошибки Цикл
					
					Текст = Текст + Символы.ПС + Символы.Таб + "" + Ошибка.Код + " - " + Ошибка.Текст;
					
				КонецЦикла;
		
		
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(Текст);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометку_ЗарегистированВФНС()
	
	Элементы.КартинкаПустойЧекБокс_Зарегистировать.Видимость = Истина;
	Элементы.КартинкаОжидание_Зарегистрировать.Видимость = Ложь;
	Элементы.КартинкаГалкаЧекБокс_Зарегистрировать.Видимость = Ложь; 
	Элементы.НадписьЗарегистрироватьДоверенность.Доступность = ЗначениеЗаполнено(ДвоичныеДанныеДоверенности) И ЗначениеЗаполнено(ДвоичныеДанныеПодписи);	
	Элементы.НадписьЗарегистрироватьДоверенность.Заголовок = "Зарегистрировать доверенность";
	Элементы.НадписьЗарегистрироватьДоверенность.Гиперссылка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПривязатьДоверенностьНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	МашиночитаемаяДоверенностьПривязаннаяКСотруднику = МодульОбменКлиент().ПривязкаМЧДСотруднику(ДанныеАвторизации, ИдентификаторЯщикаДиадок, ИдентификаторПользователя, Доверенность.СоставнойИдентификатор);
	
	Интерфейс_ДоверенностьУспешноПривязана(); 
	
КонецПроцедуры




