&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокСертификатов();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСертификатов()

	Для каждого Строка Из Параметры.МассивСертификатов Цикл
	
		НоваяСтрока = СписокСертификатов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 	
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьТелефонУЦНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ЗапуститьПриложение("callto:+78005000508");
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьТелефонТПEDIНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ЗапуститьПриложение("callto:+78005003351");
	
КонецПроцедуры
