&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

&НаКлиенте
Перем ПиктограммыВидовКодов;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер"		, Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика"	, Объект.ПараметрыКлиентСерверМетрика);
	
	АдресТаблицыКодов = Параметры.АдресКодовМаркировкиТоваров;
	АдресДереваУпаковок = Параметры.АдресДереваУпаковок;
	ТолькоПросмотрФормы = Параметры.ТолькоПросмотр;
	
	НастроитьЭлементыФормы();
	ЗаполнитьТаблицыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "Сервис_КодыМаркировкиВУпаковкахУправляемая");
	
	ПеренумероватьСтрокиКодовМаркировки();
	РассчитатьКоличествоКодовМаркировки();
	ЗаполнитьПиктограммыВидовКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	РезультатРедактирования = ПодготовитьРезультатРедактирования();
	Закрыть(РезультатРедактирования);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Если ТолькоПросмотрФормы Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

//Работа с данными

&НаСервере
Процедура ЗаполнитьТаблицыФормы()
	
	ЗаполнитьНераспределенныеКоды();
	ЗаполнитьТаблицуУпаковок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНераспределенныеКоды()
	
	Если Не ЭтоАдресВременногоХранилища(АдресТаблицыКодов) Тогда
		Возврат;
	КонецЕсли;
	
	РазвернутаяТаблицаКодов = ПолучитьИзВременногоХранилища(АдресТаблицыКодов);
	ДеревоНераспределенныхКодов = РеквизитФормыВЗначение("КодыМаркировкиТоваров");
	
	МодульОбъекта().ЗаполнитьДеревоНераспределенныхКодовМаркировки(ДеревоНераспределенныхКодов, РазвернутаяТаблицаКодов);
	
	ЗначениеВРеквизитФормы(ДеревоНераспределенныхКодов, "КодыМаркировкиТоваров");
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуУпаковок()
	
	Если Не ЭтоАдресВременногоХранилища(АдресТаблицыКодов) 
		ИЛИ	Не ЭтоАдресВременногоХранилища(АдресДереваУпаковок) Тогда
		Возврат;
	КонецЕсли;
	
	РазвернутаяТаблицаКодов = ПолучитьИзВременногоХранилища(АдресТаблицыКодов);
	ДеревоУпаковок = ПолучитьИзВременногоХранилища(АдресДереваУпаковок);
	ДеревоРаспределенныхКодов = РеквизитФормыВЗначение("КодыМаркировкиВУпаковках");
	
	МодульОбъекта().ЗаполнитьДеревоРаспределенныхКодовМаркировки(ДеревоРаспределенныхКодов, ДеревоУпаковок, РазвернутаяТаблицаКодов);
	
	ЗначениеВРеквизитФормы(ДеревоРаспределенныхКодов, "КодыМаркировкиВУпаковках");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренумероватьСтрокиКодовМаркировки()
	
	Для каждого СтрокаТовара Из КодыМаркировкиТоваров.ПолучитьЭлементы() Цикл
		
		ПорядковыйНомер = 1;
		Для каждого СтрокаКода Из СтрокаТовара.ПолучитьЭлементы() Цикл
			СтрокаКода.ПредставлениеСтроки = Формат(ПорядковыйНомер, "ЧГ=; ЧФ='Ч. '") + СтрокаКода.КодМаркировки;
			ПорядковыйНомер = ПорядковыйНомер + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого СтрокаУпаковки Из КодыМаркировкиВУпаковках.ПолучитьЭлементы() Цикл
		Для каждого СтрокаТовара Из СтрокаУпаковки.ПолучитьЭлементы() Цикл
			
			ПорядковыйНомер = 1;
			Для каждого СтрокаКода Из СтрокаТовара.ПолучитьЭлементы() Цикл
				СтрокаКода.ПредставлениеСтроки = Формат(ПорядковыйНомер, "ЧГ=; ЧФ='Ч. '") + СтрокаКода.КодМаркировки;
				ПорядковыйНомер = ПорядковыйНомер + 1;
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличествоКодовМаркировки()
	
	Для каждого СтрокаТовара Из КодыМаркировкиТоваров.ПолучитьЭлементы() Цикл
		
		СтрокаТовара.КоличествоКодовМаркировки = СтрокаТовара.ПолучитьЭлементы().Количество();
		
	КонецЦикла;
	
	Для каждого СтрокаУпаковки Из КодыМаркировкиВУпаковках.ПолучитьЭлементы() Цикл
		
		КоличествоВУпаковке = 0;
		
		Для каждого СтрокаТовара Из СтрокаУпаковки.ПолучитьЭлементы() Цикл
			СтрокаТовара.КоличествоКодов = СтрокаТовара.ПолучитьЭлементы().Количество();
			КоличествоВУпаковке = КоличествоВУпаковке + СтрокаТовара.КоличествоКодов;
		КонецЦикла;
		
		СтрокаУпаковки.КоличествоКодов = КоличествоВУпаковке;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьРезультатРедактирования()
	
	РезультатРедактирования = Новый Массив;
	
	Для каждого СтрокаТовара Из КодыМаркировкиТоваров.ПолучитьЭлементы() Цикл
		Для каждого КодМаркировки Из СтрокаТовара.ПолучитьЭлементы() Цикл
			
			ЗаписьРезультата = Новый Структура;
			ЗаписьРезультата.Вставить("НомерСтроки", СтрокаТовара.НомерСтроки);
			ЗаписьРезультата.Вставить("НомерУпаковки", Неопределено);
			ЗаписьРезультата.Вставить("КодМаркировки", КодМаркировки.КодМаркировки);
			ЗаписьРезультата.Вставить("ВидКодаМаркировки", КодМаркировки.ВидКода);
			
			РезультатРедактирования.Добавить(ЗаписьРезультата);
			
		КонецЦикла;
	КонецЦикла;
	
	Для каждого СтрокаУпаковки Из КодыМаркировкиВУпаковках.ПолучитьЭлементы() Цикл
		Для каждого СтрокаТовара Из СтрокаУпаковки.ПолучитьЭлементы() Цикл
			Для каждого КодМаркировки Из СтрокаТовара.ПолучитьЭлементы() Цикл
				
				ЗаписьРезультата = Новый Структура;
				ЗаписьРезультата.Вставить("НомерСтроки", СтрокаТовара.НомерСтроки);
				ЗаписьРезультата.Вставить("НомерУпаковки", СтрокаУпаковки.НомерУпаковки);
			    ЗаписьРезультата.Вставить("КодМаркировки", КодМаркировки.КодМаркировки);
				ЗаписьРезультата.Вставить("ВидКодаМаркировки", КодМаркировки.ВидКода);
				
				РезультатРедактирования.Добавить(ЗаписьРезультата);
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат РезультатРедактирования;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПиктограммыВидовКодов()
	
	СтрокиКодовТоваров = РазвернутьСтрокиДоКодовМаркировкиРекурсивно(КодыМаркировкиТоваров.ПолучитьЭлементы());
	СтрокиКодовУпаковок = РазвернутьСтрокиДоКодовМаркировкиРекурсивно(КодыМаркировкиВУпаковках.ПолучитьЭлементы());
	
	Для каждого СтрокаКода Из СтрокиКодовТоваров Цикл
		СтрокаКода.КартинкаВида = КартинкаДляВидаКода(СтрокаКода.ВидКода);
	КонецЦикла;
	
	Для каждого СтрокаКода Из СтрокиКодовУпаковок Цикл
		СтрокаКода.КартинкаВида = КартинкаДляВидаКода(СтрокаКода.ВидКода);
	КонецЦикла;
	
КонецПроцедуры

//Команды работы с таблицами

&НаКлиенте
Процедура КодыМаркировкиВУпаковкахПередУдалением(Элемент, Отказ)
	
	ДанныеВыделенныхСтрок = ДанныеВыделенныхСтрок(Элементы.КодыМаркировкиВУпаковках, КодыМаркировкиВУпаковках);
	ПеренестиКодыМаркировкиВТовары(ДанныеВыделенныхСтрок);
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиВУпаковкахПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеТовары(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	РазвернутьДерево("КодыМаркировкиТоваров");
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсеТовары(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	СвернутьДерево("КодыМаркировкиТоваров");
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеУпаковки(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	РазвернутьДерево("КодыМаркировкиВУпаковках");
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсеУпаковки(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	СвернутьДерево("КодыМаркировкиВУпаковках");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВправо(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ДанныеВыделенныхСтрок = ДанныеВыделенныхСтрок(Элементы.КодыМаркировкиТоваров, КодыМаркировкиТоваров);
	ПеренестиКодыМаркировкиВУпаковки(ДанныеВыделенныхСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВсеВправо(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ДанныеВыделенныхСтрок = ДанныеВыделенныхСтрок(Элементы.КодыМаркировкиТоваров, КодыМаркировкиТоваров);
	
	МассивРаспределяемыхКодов = КоллекцияСтрокВМассив(ДанныеВыделенныхСтрок);	
	МассивРаспределяемыхКодов = РазвернутьСтрокиДоКодовМаркировкиРекурсивно(МассивРаспределяемыхКодов);
	
	РаспределяемыеКодыВРазереТоваров = Новый Соответствие;
	
	Для каждого СтрокаКода Из МассивРаспределяемыхКодов Цикл
		
		МассивСтрокКодов = РаспределяемыеКодыВРазереТоваров.Получить(СтрокаКода.НомерСтроки);
		Если МассивСтрокКодов = Неопределено Тогда
			МассивСтрокКодов = Новый Массив;
			РаспределяемыеКодыВРазереТоваров.Вставить(СтрокаКода.НомерСтроки, МассивСтрокКодов);
		КонецЕсли;
		
		МассивСтрокКодов.Добавить(СтрокаКода);
		
	КонецЦикла;
	
	Для каждого СтрокаУпаковки Из КодыМаркировкиВУпаковках.ПолучитьЭлементы() Цикл
		
		ПодобранныеКоды = Новый Массив;
		
		Для каждого СтрокаТовара Из СтрокаУпаковки.ПолучитьЭлементы() Цикл
			
			НеобходимоеКоличествоКодов = Цел(СтрокаТовара.КоличествоТовара - СтрокаТовара.КоличествоКодов);
			Если НеобходимоеКоличествоКодов <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокиНераспределенныхКодов = РаспределяемыеКодыВРазереТоваров.Получить(СтрокаТовара.НомерСтроки);
			
			Если СтрокиНераспределенныхКодов = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			УдаляемыеСтроки = Новый Массив;
			
			Для каждого РаспределяемыйКод Из СтрокиНераспределенныхКодов Цикл
				
				Если НеобходимоеКоличествоКодов <= 0 Тогда
					Прервать;
				КонецЕсли;
				
				ПодобранныеКоды.Добавить(РаспределяемыйКод);
				УдаляемыеСтроки.Добавить(РаспределяемыйКод);
				
				НеобходимоеКоличествоКодов = НеобходимоеКоличествоКодов - 1;
				
			КонецЦикла;
			
			Для каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
				
				ИндексСтроки = СтрокиНераспределенныхКодов.Найти(УдаляемаяСтрока);
				Если Не ИндексСтроки = Неопределено Тогда
					СтрокиНераспределенныхКодов.Удалить(ИндексСтроки);
				КонецЕсли;
				
			КонецЦикла;
	
		КонецЦикла;
		
		Если ПодобранныеКоды.Количество() > 0 Тогда
			ПеренестиКодыМаркировкиВУпаковки(ПодобранныеКоды, СтрокаУпаковки.НомерУпаковки, Истина);
		КонецЕсли;
				
	КонецЦикла;

	ПеренумероватьСтрокиКодовМаркировки();
	РассчитатьКоличествоКодовМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВлево(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ДанныеВыделенныхСтрок = ДанныеВыделенныхСтрок(Элементы.КодыМаркировкиВУпаковках, КодыМаркировкиВУпаковках);
	ПеренестиКодыМаркировкиВТовары(ДанныеВыделенныхСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВсеВлево(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ПеренестиКодыМаркировкиВТовары(КодыМаркировкиВУпаковках.ПолучитьЭлементы());
	
КонецПроцедуры

//Процедуры переноса кодов между таблицами

&НаКлиенте
Процедура ПеренестиКодыМаркировкиВУпаковки(СтрокиКодовМаркировки, НомерУпаковки = Неопределено, МассовоеДействие = Ложь)
	
	МассивСтрокКодов = КоллекцияСтрокВМассив(СтрокиКодовМаркировки);
	
	Если НомерУпаковки = Неопределено Тогда
		
		ИдентификаторТекущейСтроки = Элементы.КодыМаркировкиВУпаковках.ТекущаяСтрока;
		
		Если ИдентификаторТекущейСтроки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущаяСтрокаУпаковки = КодыМаркировкиВУпаковках.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		
		Если ТекущаяСтрокаУпаковки = Неопределено Тогда
			Возврат;
		Иначе
			НомерУпаковки = ТекущаяСтрокаУпаковки.НомерУпаковки;
		КонецЕсли;
		
	КонецЕсли;                        
	
	СтрокаУпаковки = НайтиЭлементКоллекцииПоДанным(КодыМаркировкиВУпаковках.ПолучитьЭлементы(), "НомерУпаковки", НомерУпаковки);
	
	Если СтрокаУпаковки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрокКодов = ОтфильтроватьКодыМаркировкиПоТоварамУпаковки(МассивСтрокКодов, СтрокаУпаковки.ПолучитьЭлементы());
	МассивСтрокКодов = РазвернутьСтрокиДоКодовМаркировкиРекурсивно(МассивСтрокКодов);
	
	РазнестиКодыМаркировкиПоТоварамУпаковки(МассивСтрокКодов, СтрокаУпаковки);
	УдалитьСтрокиКодовИзДерева(МассивСтрокКодов);
	
	Если Не МассовоеДействие Тогда
		ПеренумероватьСтрокиКодовМаркировки();
		РассчитатьКоличествоКодовМаркировки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиКодыМаркировкиВТовары(СтрокиКодовМаркировки)
	
	МассивСтрокКодов = КоллекцияСтрокВМассив(СтрокиКодовМаркировки);
	МассивСтрокКодов = РазвернутьСтрокиДоКодовМаркировкиРекурсивно(МассивСтрокКодов);
	
	РазнестиКодыМаркировкиПоТоварам(МассивСтрокКодов);
	УдалитьСтрокиКодовИзДерева(МассивСтрокКодов);

	ПеренумероватьСтрокиКодовМаркировки();
	РассчитатьКоличествоКодовМаркировки();
	
КонецПроцедуры

&НаКлиенте
Функция ОтфильтроватьКодыМаркировкиПоТоварамУпаковки(МассивСтрокКодов, СтрокиТоваровУпаковки)
	
	ОтфильтрованныеСтрокиКодовМаркировки = Новый Массив;
	
	НомераСтрокТовараВУпаковке = Новый Массив;
	Для каждого СтрокаТовара Из СтрокиТоваровУпаковки Цикл
		НомераСтрокТовараВУпаковке.Добавить(СтрокаТовара.НомерСтроки);
	КонецЦикла;
	
	Для каждого СтрокаДляОбработки Из МассивСтрокКодов Цикл
		Если НЕ НомераСтрокТовараВУпаковке.Найти(СтрокаДляОбработки.НомерСтроки) = Неопределено Тогда
			ОтфильтрованныеСтрокиКодовМаркировки.Добавить(СтрокаДляОбработки);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтфильтрованныеСтрокиКодовМаркировки;
	
КонецФункции

&НаКлиенте
Функция РазвернутьСтрокиДоКодовМаркировкиРекурсивно(МассивСтрокКодов)
	
	РазвернутыеСтроки = Новый Массив;
	
	Для каждого СтрокаДляОбработки Из МассивСтрокКодов Цикл
		
		Если ЗначениеЗаполнено(СтрокаДляОбработки.КодМаркировки) Тогда
			РазвернутыеСтроки.Добавить(СтрокаДляОбработки);
		Иначе
			ВложенныеСтроки = РазвернутьСтрокиДоКодовМаркировкиРекурсивно(СтрокаДляОбработки.ПолучитьЭлементы());
			Для каждого СтрокаКодаМаркировки Из ВложенныеСтроки Цикл
				РазвернутыеСтроки.Добавить(СтрокаКодаМаркировки);
			КонецЦикла;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат СвернутьМассив(РазвернутыеСтроки);
	
КонецФункции

&НаКлиенте
Процедура РазнестиКодыМаркировкиПоТоварам(МассивСтрокКодов)
	
	КэшСтрокТоваров = Новый Соответствие;
	
	Для каждого СтрокаКодаИзУпаковок Из МассивСтрокКодов Цикл
		
		СтрокаТовара = КэшСтрокТоваров.Получить(СтрокаКодаИзУпаковок.НомерСтроки);
		Если СтрокаТовара = Неопределено Тогда
			
			СтрокаТовара = НайтиЭлементКоллекцииПоДанным(КодыМаркировкиТоваров.ПолучитьЭлементы(), "НомерСтроки", СтрокаКодаИзУпаковок.НомерСтроки);
			КэшСтрокТоваров.Вставить(СтрокаКодаИзУпаковок.НомерСтроки, СтрокаТовара);
			
		КонецЕсли;
		
		СтрокаКодаИзТоваров = СтрокаТовара.ПолучитьЭлементы().Добавить();
		СтрокаКодаИзТоваров.КодМаркировки = СтрокаКодаИзУпаковок.КодМаркировки;
		СтрокаКодаИзТоваров.ВидКода = СтрокаКодаИзУпаковок.ВидКода;
		СтрокаКодаИзТоваров.КартинкаВида = КартинкаДляВидаКода(СтрокаКодаИзТоваров.ВидКода);
		СтрокаКодаИзТоваров.НомерСтроки = СтрокаТовара.НомерСтроки;		
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазнестиКодыМаркировкиПоТоварамУпаковки(МассивСтрокКодов, СтрокаУпаковки)
	
	КэшСтрокТоваровВУпаковке = Новый Соответствие;
	
	Если МассивСтрокКодов.Количество() > 0 Тогда
		ВыделенныеСтрокиКодыМаркировкиВУпаковках = МодульОбъектаКлиент().ВыделенныеСтрокиТаблицыФормы_КонтурEDI(Элементы.КодыМаркировкиВУпаковках);
		ВыделенныеСтрокиКодыМаркировкиВУпаковках.Очистить();
	КонецЕсли;
	
	Для каждого СтрокаКодаИзТоваров Из МассивСтрокКодов Цикл
		
		СтрокаТоваров = КэшСтрокТоваровВУпаковке.Получить(СтрокаКодаИзТоваров.НомерСтроки);
		
		Если СтрокаТоваров = Неопределено Тогда
			
			СтрокаТоваров = НайтиЭлементКоллекцииПоДанным(СтрокаУпаковки.ПолучитьЭлементы(), "НомерСтроки", СтрокаКодаИзТоваров.НомерСтроки);
			КэшСтрокТоваровВУпаковке.Вставить(СтрокаКодаИзТоваров.НомерСтроки, СтрокаТоваров);
			
		КонецЕсли;
		
		СтрокаКодаИзУпаковок = СтрокаТоваров.ПолучитьЭлементы().Добавить();
		СтрокаКодаИзУпаковок.НомерСтроки = СтрокаТоваров.НомерСтроки;
		СтрокаКодаИзУпаковок.НомерУпаковки = СтрокаТоваров.НомерУпаковки;
		СтрокаКодаИзУпаковок.КодМаркировки = СтрокаКодаИзТоваров.КодМаркировки;
		СтрокаКодаИзУпаковок.ВидКода = СтрокаКодаИзТоваров.ВидКода;
		СтрокаКодаИзУпаковок.КартинкаВида = КартинкаДляВидаКода(СтрокаКодаИзУпаковок.ВидКода);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиКодовИзДерева(КоллекцияСтрок)
	
	Для каждого Строка Из КоллекцияСтрок Цикл
		Строка.ПолучитьРодителя().ПолучитьЭлементы().Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

//Общего назначения клиент

&НаКлиенте
Функция КартинкаДляВидаКода(ВидКода)
	
	Если ПиктограммыВидовКодов = Неопределено Тогда
			
		ПиктограммыВидовКодов = Новый Соответствие;
		ПиктограммыВидовКодов.Вставить("Транспортный"	, 1);
		ПиктограммыВидовКодов.Вставить("Групповой"		, 2);
		ПиктограммыВидовКодов.Вставить("Набор"			, 3);
		ПиктограммыВидовКодов.Вставить("Индивидуальный"	, 4);
		
	КонецЕсли;
	
	ИндексКартинки = ПиктограммыВидовКодов[ВидКода];
	
	Если ИндексКартинки = Неопределено Тогда
		ИндексКартинки = 0;
	КонецЕсли;	
	
	Возврат ИндексКартинки;
	
КонецФункции

&НаКлиенте
Процедура РазвернутьДерево(ИмяДерева)
	
	Для каждого СтрокаТоваров Из ЭтаФорма[ИмяДерева].ПолучитьЭлементы() Цикл
		Элементы[ИмяДерева].Развернуть(СтрокаТоваров.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(ИмяДерева)
	
	Для каждого СтрокаТоваров Из ЭтаФорма[ИмяДерева].ПолучитьЭлементы() Цикл
		Элементы[ИмяДерева].Свернуть(СтрокаТоваров.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте 
Функция ДанныеВыделенныхСтрок(ЭлементФормы, ДанныеФормы)
	
	ДанныеВыделенныхСтрок = Новый Массив;
	
	ВыделенныеСтрокиКодыМаркировкиВУпаковках = МодульОбъектаКлиент().ВыделенныеСтрокиТаблицыФормы_КонтурEDI(ЭлементФормы);
	
	Для каждого Идентификатор Из ВыделенныеСтрокиКодыМаркировкиВУпаковках Цикл
		ДанныеВыделенныхСтрок.Добавить(ДанныеФормы.НайтиПоИдентификатору(Идентификатор));                                                 
	КонецЦикла;
	
	Возврат ДанныеВыделенныхСтрок;
	
КонецФункции

&НаКлиенте
Функция СвернутьМассив(ИсходныйМассив)
	
	СвернутыйМассив = Новый Массив;
	
	Для каждого ЭлементМассива Из ИсходныйМассив Цикл
		
		Если СвернутыйМассив.Найти(ЭлементМассива) = Неопределено Тогда
			СвернутыйМассив.Добавить(ЭлементМассива);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СвернутыйМассив;
		
КонецФункции

&НаКлиенте                                                                                                                             
Функция КоллекцияСтрокВМассив(КоллекцияСтрок)
	
	Если ТипЗнч(КоллекцияСтрок) = Тип("Массив") Тогда
		Возврат КоллекцияСтрок;
	КонецЕсли;
	
	Массив = Новый Массив;
	
	Для каждого Строка Из КоллекцияСтрок Цикл
		Массив.Добавить(Строка);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Функция НайтиЭлементКоллекцииПоДанным(Коллекция, ИмяПоля, Значение)
	
	Для каждого ЭлементКоллекции Из Коллекция Цикл
		
		Если ЭлементКоллекции[ИмяПоля] = Значение Тогда
			Возврат ЭлементКоллекции;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

//Перетаскивание

&НаКлиенте
Процедура КодыМаркировкиТоваровНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ПеретаскиваемыеСтроки = ПараметрыПеретаскивания.Значение;
	                                                                                                                                         
	Если Не ТипЗнч(ПеретаскиваемыеСтроки) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	НомераСтрокТоваров = Новый Массив;
	
	ДанныеПеретаскиваемыхСтрок = Новый Массив;
	Для каждого Идентификатор Из ПеретаскиваемыеСтроки Цикл
		ДанныеПеретаскиваемыхСтрок.Добавить(КодыМаркировкиТоваров.НайтиПоИдентификатору(Идентификатор));
	КонецЦикла;
	
	Для каждого Строка Из ДанныеПеретаскиваемыхСтрок Цикл
		
		Если НомераСтрокТоваров.Найти(Строка.НомерСтроки) = Неопределено Тогда
			НомераСтрокТоваров.Добавить(Строка.НомерСтроки);
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураПеретаскивания = Новый Структура;
	СтруктураПеретаскивания.Вставить("НомераСтрокТоваров", НомераСтрокТоваров);
	СтруктураПеретаскивания.Вставить("ПеретаскиваемыеСтроки", ДанныеПеретаскиваемыхСтрок);
	
	ПараметрыПеретаскивания.Значение = СтруктураПеретаскивания;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиТоваровПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Структура")
		И ПараметрыПеретаскивания.Значение.Свойство("СтрокиУпаковок") Тогда                                                   
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиТоваровПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если Не ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Структура")
		ИЛИ Не ПараметрыПеретаскивания.Значение.Свойство("СтрокиУпаковок") Тогда
		Возврат;
	КонецЕсли;

	ПеренестиКодыМаркировкиВТовары(ПараметрыПеретаскивания.Значение.СтрокиУпаковок);

КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиВУпаковкахНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ДанныеПеретаскиваемыхСтрок = Новый Массив;
	Для каждого Идентификатор Из ПараметрыПеретаскивания.Значение Цикл
		ДанныеПеретаскиваемыхСтрок.Добавить(КодыМаркировкиВУпаковках.НайтиПоИдентификатору(Идентификатор));
	КонецЦикла;
	
	СтруктураПеретаскивания = Новый Структура;
	СтруктураПеретаскивания.Вставить("СтрокиУпаковок", ДанныеПеретаскиваемыхСтрок);
	
	ПараметрыПеретаскивания.Значение = СтруктураПеретаскивания;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиВУпаковкахПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	
	Если Строка = Неопределено Тогда                              
		Возврат;
	КонецЕсли;                                                           
	
	Если Не ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПроверяемойСтроки = КодыМаркировкиВУпаковках.НайтиПоИдентификатору(Строка);
	НомерУпаковки = ДанныеПроверяемойСтроки.НомерУпаковки;
	СтрокаУпаковки = НайтиЭлементКоллекцииПоДанным(КодыМаркировкиВУпаковках.ПолучитьЭлементы(), "НомерУпаковки", НомерУпаковки);                      
	
	Если СтрокаУпаковки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомераПеретаскиваемыхСтрокТоваров = ПараметрыПеретаскивания.Значение.НомераСтрокТоваров;
	
	Для каждого НомерСтроки Из НомераПеретаскиваемыхСтрокТоваров Цикл
		
		Если Не НайтиЭлементКоллекцииПоДанным(СтрокаУпаковки.ПолучитьЭлементы(), "НомерСтроки", НомерСтроки) = Неопределено Тогда
			ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
			Возврат;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиВУпаковкахПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если Не ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаУпаковки = КодыМаркировкиВУпаковках.НайтиПоИдентификатору(Строка);
	ПеренестиКодыМаркировкиВУпаковки(ПараметрыПеретаскивания.Значение.ПеретаскиваемыеСтроки, СтрокаУпаковки.НомерУпаковки);

КонецПроцедуры
