&НаСервере
Перем МодульОбъекта;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули();
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);

	СтруктураПредложенияПродления = Параметры.СтруктураПредложенияПродления; 
	
	ЭтаФорма.Заголовок = СтруктураПредложенияПродления.ЗаголовокФормы;	
	
	Для Каждого Элемент Из СтруктураПредложенияПродления.ПредложенияПродления Цикл
		ПредложенияПродления.Добавить(Элемент.ПредложениеПродления, Элемент.ТипПредложения);
	КонецЦикла;

	ЗаполнитьФормуПредложенияПродления();

	Пользователь = МодульОбъекта().ПолучитьТекущегоПользователя1С();
	
	МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(Пользователь, "MD5ПредложенияПродления", СтруктураПредложенияПродления.MD5);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "ПредложенияПродленияУправляемая");

	ОсновнаяФорма().ДеактивироватьКнопкуПредложенияПродления();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуПредложенияПродления()
	
	ЦветПримечания = Новый Цвет(205, 237, 255);
	ЦветФонаКнопки = Новый Цвет(61, 61, 61);
	ЦветТекстаКноки = Новый Цвет(255, 255, 255);
		
	НомерЭлемента = 0;
	
	Для Каждого Элемент Из ПредложенияПродления Цикл

		ТипПП = Элемент.Представление;
		СтруктураПП = Элемент.Значение;

		НомерЭлемента = НомерЭлемента + 1;			

		Если НомерЭлемента > 1 Тогда
			ПараметрыЭлемента = Новый Структура("Высота,Ширина", 1, 50);
			МодульОбъекта().ДобавитьНаФормуРазделитель(ЭтаФорма, "ПредложениеПродления" + НомерЭлемента + "Разделитель", ПараметрыЭлемента);
		КонецЕсли;
		
		ПараметрыЭлемента = Новый Структура("Заголовок", СтруктураПП.Наименование);
		Надпись = МодульОбъекта().ДобавитьНаФормуНадпись(ЭтаФорма, "ПредложениеПродления" + НомерЭлемента + "Наименование", ПараметрыЭлемента);
		Надпись.Шрифт = Новый Шрифт(Надпись.Шрифт, , , Истина);
		
		ПараметрыЭлемента = Новый Структура("Заголовок", СтруктураПП.Предложение);
		МодульОбъекта().ДобавитьНаФормуНадпись(ЭтаФорма, "ПредложениеПродления" + НомерЭлемента + "Предложение", ПараметрыЭлемента);

		Если ТипПП = "Пакет" И ЗначениеЗаполнено(СтруктураПП.Примечание) Тогда
			
			ПараметрыЭлемента = Новый Структура("Отображение, ОтображатьЗаголовок, ЦветФона, Группировка", 
			ОтображениеОбычнойГруппы.Нет, Ложь, ЦветПримечания, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
			
			Группа = МодульОбъекта().ДобавитьНаФормуГруппу(ЭтаФорма, "ПредложениеПродления" + НомерЭлемента + "Информация", ПараметрыЭлемента);

			ПараметрыЭлемента = Новый Структура("Картинка", Элементы.КартинкаИнформация.Картинка);
			МодульОбъекта().ДобавитьНаФормуКартинку(ЭтаФорма, "ПредложениеПродления" + НомерЭлемента + "Картинка", ПараметрыЭлемента, Группа);
			
			ПараметрыЭлемента = Новый Структура("Заголовок", СтруктураПП.Примечание);
			МодульОбъекта().ДобавитьНаФормуНадпись(ЭтаФорма, "ПредложениеПродления" + НомерЭлемента + "Примечание", ПараметрыЭлемента, Группа);
		
		КонецЕсли;
				
		ПараметрыКоманды = Новый Структура("Действие", "НажатиеКнопки");
		Команда = МодульОбъекта().ДобавитьНаФормуКоманду(ЭтаФорма, "ПредложениеПродления_" + НомерЭлемента, ПараметрыКоманды);
		
		ПараметрыЭлемента = Новый Структура;
		ПараметрыЭлемента.Вставить("ИмяКоманды"	, Команда.Имя);
		ПараметрыЭлемента.Вставить("Заголовок"	, СтруктураПП.ЗаголовокКнопки);
		ПараметрыЭлемента.Вставить("ЦветФона"	, ЦветФонаКнопки);
		ПараметрыЭлемента.Вставить("ЦветТекста"	, ЦветТекстаКноки);
				
		Если МодульОбъекта().КонтурСтандарт_ВерсияРежимСовместимостиНеНижеУказанной("8.3.8") Тогда
			
			ПараметрыЭлемента.Вставить("Отображение"		, ОтображениеКнопки.КартинкаИТекст);		
			ПараметрыЭлемента.Вставить("Картинка"			, Элементы.КартинкаСтрелка.Картинка);			
			ПараметрыЭлемента.Вставить("ПоложениеКартинки"	, Вычислить("ПоложениеКартинкиКнопкиФормы.Право"));
			
		КонецЕсли;
				
		МодульОбъекта().ДобавитьНаФормуКнопку(ЭтаФорма, "ПредложениеПродления_" + НомерЭлемента, ПараметрыЭлемента);
	
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопки(Команда)
	
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             

	Номер = Число(Сред(Команда.Имя, Найти(Команда.Имя, "_")+1));
	
	СтруктураПП = ПредложенияПродления[Номер - 1].Значение;
	
	ЗапуститьПриложение(СтруктураПП.СсылкаДляОплаты);
	
КонецПроцедуры

