// Контур EDI - Регламентное задание для выполнения обмена с севером

Процедура ВыполнениеОбмена_КонтурEDI() Экспорт
    
    // 1. Если модуль сохранен в справочнике "Внешние обработки"
    // подставьте свой код
	//КодОбработкиВСправочнике = "000000001";
	//ХранилищеОбработки = Справочники.ВнешниеОбработки.НайтиПоКоду(КодОбработкиВСправочнике);
	//ИмяВременногоФайла = ПолучитьИмяВременногоФайла("epf");
	//ХранилищеОбработки.ХранилищеВнешнейОбработки.Получить().Записать(ИмяВременногоФайла);
	//БезопасныйРежим = Ложь;
	//ОбъектОбработки = ВнешниеОбработки.Создать(ИмяВременногоФайла, БезопасныйРежим);
	
    // 2. Если модуль сохранен как файл на диске
    // внимание: данный путь должен быть доступен учетной записи, 
    // под которой запущен сервер 1С:Предприятие.
	//ПолноеИмяФайла = "\\fileserver\share KonturEDI.epf";
	//БезопасныйРежим = Ложь;
	//ОбъектОбработки = ВнешниеОбработки.Создать(ПолноеИмяФайла, БезопасныйРежим);
    
	// 3. Если модуль встроен в конфигурацию
    ОбъектОбработки = Обработки.КонтурEDI.Создать();
	
    // Общая часть
    ОбъектОбработки.ФоновоеЗадание_ВыполнитьОбмен();
    ОбъектОбработки = Неопределено;
	
	// если модуль сохранен в справочнике "Внешние обработки"
    //УдалитьФайлы(ИмяВременногоФайла);
    
КонецПроцедуры