&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " " + Параметры.Заголовок;
	КонецЕсли;
	
	Параметры.Свойство("ПодробнаяИнформация", ПодробнаяИнформация);	
	
	Если Параметры.Свойство("ПодробнаяИнформацияТабличныйДокумент", ПодробнаяИнформацияТабличныйДокумент) Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТабличныйДокумент;
		
		СвернутьГруппировкиСтрок();
		
		УровеньГруппировокПриОткрытии = 0;
		Если Параметры.Свойство("УровеньГруппировокПриОткрытии") Тогда
			УровеньГруппировокПриОткрытии = Параметры.УровеньГруппировокПриОткрытии;
		КонецЕсли;
		
		ПодробнаяИнформацияТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(УровеньГруппировокПриОткрытии);
		
	Иначе
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТекстовыйДокумент;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СвернутьГруппировкиСтрок()
	
	КоличествоУровней = ПодробнаяИнформацияТабличныйДокумент.КоличествоУровнейГруппировокСтрок();
	                                                 
	Для УровеньГруппировки = 0 По КоличествоУровней - 1 Цикл
		
		ПодробнаяИнформацияТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(КоличествоУровней - УровеньГруппировки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Скопировать(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Буфер = Новый COMОбъект("htmlfile"); 
	Буфер.ParentWindow.ClipboardData.Setdata("Text", ПодробнаяИнформация); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробнаяИнформацияТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если Область.Гиперссылка = Истина И ЗначениеЗаполнено(Область.Расшифровка) Тогда
		ЗапуститьПриложение(Область.Расшифровка); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробнаяИнформацияТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
