
&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

&НаКлиенте
Перем СоединениеДД;

&НаКлиенте
Перем мРабочийКаталог;

&НаКлиенте
Перем КэшИННЯщикаДиадок;

&НаКлиенте
Перем Токены;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
				Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если Не ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
	
	ОсновнаяФорма = Неопределено;
	ИдентификаторОсновнойФормы = ЭтаФорма.Объект.ПараметрыКлиентСервер.IDОсновнойФормы;
	
	Попытка
		ОткрытыеОкнаКлиентскогоПриложения = ПолучитьОкна();
		Для каждого ОкноКлиентскогоПриложения Из ОткрытыеОкнаКлиентскогоПриложения Цикл
			
			Для каждого ФормаОкна Из ОкноКлиентскогоПриложения.Содержимое Цикл
				Если ФормаОкна.УникальныйИдентификатор = ИдентификаторОсновнойФормы Тогда
					ОсновнаяФорма = ФормаОкна;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Не ОсновнаяФорма = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		ОсновнаяФорма = Неопределено;
	КонецПопытки;
		
	Возврат ОсновнаяФорма;
	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

&НаКлиенте
Функция МодульОбменКлиент()
	
	Возврат ЭтаФорма;
	
КонецФункции

&НаКлиенте
Процедура ПоместитьВоВХ(Имя,Значение)
	
	ПоместитьВоВременноеХранилище(Значение, Объект.ПараметрыКлиентСервер.АдресаВХ[Имя]);
	
КонецПроцедуры

&НаКлиенте
Функция ИзвлечьИзВХ(Имя)
	
	АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ[Имя];
	
	Если Не ЭтоАдресВременногоХранилища(АдресВХ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПолучитьИзВременногоХранилища(АдресВХ);
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
		
	ЗаполнитьТаблицуАвторизацииПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Форма не предусмотрена для интерактивного показа пользователю
	Этаформа.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьПереданныеСообщения() Экспорт //переданные в ВХ 
	
	СформироватьСчетаФактурыНаПодписание();
	СброситьПроверкиДанныхАвторизации();
	СпроситьНедостающиеСертификатыДляПодписиИПодписатьСчетаФактуры();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФоновыйРежим(Режим = Истина) Экспорт
	
	ФоновыйРежим = Режим;
	
КонецПроцедуры	

// Для перехода на версию 4.03.019.01

&НаКлиенте
Процедура ПроставитьСрокДействияСертификатов() Экспорт
	
	МассивСертификатовДляОбновления = ПолучитьМассивСертификатовДляОбновленияСервер();
	
	Для каждого Сертификат Из МассивСертификатовДляОбновления Цикл
		
		Если Сертификат.Расположение = "сервер" Тогда
			ДанныеАвторизацииСертификата = ПолучитьСтруктуруДанныхАвторизации();
			ДанныеАвторизацииСертификата.Отпечаток = Сертификат.Отпечаток;
			ДанныеАвторизацииСертификата.Расположение = Сертификат.Расположение;
			РеквизитыСертификата = ПолучитьРеквизитыСертификатаНаСервере(ДанныеАвторизацииСертификата);
		Иначе	
			РеквизитыСертификата = ПолучитьРеквизитыСертификатаНаКлиенте(Сертификат.Отпечаток);
		КонецЕсли;	
		
		Если РеквизитыСертификата = Неопределено Тогда
			// Не смогли прочитать реквизиты, попробуем в другой раз
			Возврат;
		КонецЕсли;
		Сертификат.СертификатДействуетПо = РеквизитыСертификата.ОкончаниеПериодаДействия;
	КонецЦикла;
	
	СохранитьСрокДействияСертификатовСервер(МассивСертификатовДляОбновления);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСертификатовДляОбновленияСервер()
	
	МассивСертификатовДляОбновления = Новый Массив;
	
	ВсеСохраненныеСертификаты = МодульОбъекта().ПолучитьТаблицуСохраненныхСертификатов();
	НайденныеСтроки = ВсеСохраненныеСертификаты.НайтиСтроки(Новый Структура("СертификатДействуетПо", Дата(1, 1, 1)));
	
	Для каждого Строка Из НайденныеСтроки Цикл
		
		СертификатСтруктура = Новый Структура("Ссылка, Отпечаток, Расположение, СертификатДействуетПо", 
		Строка.Ссылка, 
		Строка.Отпечаток,
		Строка.Расположение,
		Строка.СертификатДействуетПо);
		МассивСертификатовДляОбновления.Добавить(СертификатСтруктура);
		
	КонецЦикла;
	
	Возврат МассивСертификатовДляОбновления;
	
КонецФункции // ПолучитьМассивСертификатовДляСохраненияСервер()

&НаСервере
Процедура СохранитьСрокДействияСертификатовСервер(МассивСертификатовДляОбновления)
	
	Для каждого Сертификат Из МассивСертификатовДляОбновления Цикл
		
		МодульОбъекта().ЗаписатьДопРеквизитСправочника_КонтурEDI(Сертификат.Ссылка, "СертификатДействуетПо", Сертификат.СертификатДействуетПо);
		
	КонецЦикла;
	
	МодульОбъекта().УстановитьКонстантуEDI("СрокДействияСертификатовПроставлен", Истина);
	
КонецПроцедуры

// Для перехода на версию 4.03.019.01


//Вспомогательные
&НаСервере
Процедура СформироватьСчетаФактурыНаПодписание()
	
	//соберем идентификаторы СФ которые будем подписывать
	СчетаФактурыНаПодписание.Загрузить(МодульОбъекта().ПолучитьТаблицуСчетовФактурНаПодписание(МодульОбъекта().ИзвлечьИзВХ("Диадок_МассивСообщенийДляПодписания")));
	ЗаполнитьТаблицуАвторизацииПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура СпроситьНедостающиеСертификатыДляПодписиИПодписатьСчетаФактуры() //возможен неоднократный вызов для простановки сертифткатов
	
	ТекОрганизация = Неопределено;
	
	Для Каждого СтрокаСЧФ Из СчетаФактурыНаПодписание Цикл // СчетаФактурыНаПодписание отсортированы по Организации в методе ПолучитьТаблицуСчетовФактурНаПодписание
		
		Если СобытиеСертификаты_НазначитьСертификат(СтрокаСЧФ).Переопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекОрганизация <> СтрокаСЧФ.Организация Тогда
			
			ТекОрганизация = СтрокаСЧФ.Организация;
			ИнициализироватьДанныеАвторизации(ТекОрганизация);
			ОбновитьДанныеАвторизации("ТипАвторизации", "Сертификат"); 
			
			Если ПропускСертификатаПоОрганизации(ТекОрганизация) Тогда
				// по какой-то причине не удалось выбрать сертификат или не прошли проверку с сертификатом
				Продолжить; 
			КонецЕсли;
			
			Если НЕ МожемПодписатьДокументыСертификатом(ТекОрганизация, ДанныеАвторизации, "СпроситьНедостающиеСертификатыДляПодписиИПодписатьСчетаФактуры()") Тогда
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	// Все сертификаты выбраны (или не выбраны, если пользователь отказался выбирать)
	
	ПодписатьСчетаФактуры();
	СброситьПарольКонтейнераДанныхАвторизации();
	
КонецПроцедуры

&НаКлиенте
Функция СобытиеСертификаты_НазначитьСертификат(СтрокаСчетаФактурыНаПодписание)
	
	Результат = Новый Структура;
	Результат.Вставить("Организация", СтрокаСчетаФактурыНаПодписание.Организация);
	Результат.Вставить("СообщениеСсылка", СтрокаСчетаФактурыНаПодписание.Ссылка);
	Результат.Вставить("Сертификат", Новый Структура("Отпечаток, Расположение, Пароль",, "клиент", ""));
	Результат.Вставить("Доверенность", Новый Структура("РегистрационныйНомер, Доверитель, ИспользоватьПоУмолчанию",,, Ложь));
	Результат.Вставить("ДвоичныеДанныеДоверенности", Неопределено); 
	Результат.Вставить("ДвоичныеДанныеПодписи", Неопределено);
	
	СтандартнаяОбработкаEDI = Истина;
	ОсновнаяФорма().ОбработкаСобытияПодключаемогоМодуляКлиент("Сертификаты_НазначитьСертификат", СтандартнаяОбработкаEDI, Результат);
	
	Результат.Вставить("Переопределено", СтандартнаяОбработкаEDI = Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МожемПодписатьДокументыСертификатом(Организация, ДанныеАвторизации, ФинальныйОбработчик)
	
	Если НЕ СертификатПоОрганизацииНазначен(Организация) Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОбъектПараметрыКлиентСервер", Объект.ПараметрыКлиентСервер);
		ПараметрыФормы.Вставить("Организация", Организация);
		ПараметрыФормы.Вставить("ПоказыватьФлагЗапомнитьВыбор", Истина);
		
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Действие", 				"ВыборСертификата");
		ДопПараметры.Вставить("Организация", 			Организация);
		ДопПараметры.Вставить("Отпечаток",   			"");
		ДопПараметры.Вставить("Расположение",   		"");
		ДопПараметры.Вставить("СертификатДействуетПо",  Дата(1, 1, 1));
		ДопПараметры.Вставить("ЗапомнитьВыбор", 		Ложь);
		ДопПараметры.Вставить("НомерПопытки", 			1);
		ДопПараметры.Вставить("Успешно", 				Ложь);
		ДопПараметры.Вставить("ОписаниеОшибки", 		"");
		ДопПараметры.Вставить("ФинальныйОбработчик", 	ФинальныйОбработчик);
		ДопПараметры.Вставить("ИгнорируемыеОшибкиДоверенности", "");
		
		ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры); 
		
		Если Не ФоновыйРежим Тогда
			МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ФормаВыбора_СертификатДоверенность_Управляемая", , ПараметрыФормы, ЭтаФорма, "ПослеВыбораСертификатДоверенность", ЭтаФорма, ДопПараметры);
		КонецЕсли;
		
		Возврат Ложь; //не готовы подписывать, сначала надо выбрать сертификат
		
	ИначеЕсли ДанныеАвторизации.СертификатПроверен = Ложь Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Действие",	 			"ПроверкаПодписания");
		ДопПараметры.Вставить("Организация", 			ДанныеАвторизации.Организация);
		ДопПараметры.Вставить("Отпечаток",   			ДанныеАвторизации.Отпечаток);
		ДопПараметры.Вставить("Расположение",   		ДанныеАвторизации.Расположение);
		ДопПараметры.Вставить("СертификатДействуетПо",  ДанныеАвторизации.СертификатДействуетПо);
		ДопПараметры.Вставить("ЗапомнитьВыбор", 		Ложь);
		ДопПараметры.Вставить("НомерПопытки", 			1);
		ДопПараметры.Вставить("Успешно", 				Ложь);
		ДопПараметры.Вставить("ОписаниеОшибки", 		"");
		ДопПараметры.Вставить("ФинальныйОбработчик", 	ФинальныйОбработчик);
		ДопПараметры.Вставить("Доверенность", 			ДанныеАвторизации.Доверенность);
		ДопПараметры.Вставить("СвойстваСертификата", 	ДанныеАвторизации.СвойстваСертификата);
		ДопПараметры.Вставить("ИгнорируемыеОшибкиДоверенности", ДанныеАвторизации.ИгнорируемыеОшибкиДоверенности);
		
		ОбработчикВыбораСертификата(ДанныеАвторизации.ПарольКонтейнера, ДопПараметры);
		
		Возврат Ложь; //не готовы подписывать, сначала надо проверить сертификат
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеАвторизации.Доверенность) И НЕ ДанныеАвторизации.ВалидацияДоверенностиПройдена Тогда
		
		Возврат Ложь; //не готовы подписывать, доверенность не прошла валидацию		
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции 

&НаКлиенте
Процедура ПослеВыбораСертификатДоверенность(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		ОбработчикВыбораСертификата(ВыбранноеЗначение.ФинальныйОбработчик, ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСертификата(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ДопПараметры.Действие = "ВыборСертификата" Тогда
		
		Если ВыбранноеЗначение = Неопределено Тогда
			
			// пользователь отказался от выбора сертификата
			ОбновитьДанныеАвторизации("СертификатПроверен", 			Истина);
			ОбновитьДанныеАвторизации("ВалидацияСертификатаПройдена", 	Ложь);
			ДопПараметры.Вставить("ОписаниеОшибки", "Выбор сертификата отменен");
			ВыполнитьКомандуФинальногоОбработчикаВыбораСертификата(ДопПараметры.ФинальныйОбработчик, ДопПараметры);
			
		Иначе
			
			ИнициализироватьДанныеАвторизации(ВыбранноеЗначение.Организация);
			СброситьДанныеАвторизацииСертификата();
			
			ОбновитьДанныеАвторизации("ТипАвторизации", "Сертификат"); 
			ОбновитьДанныеАвторизации("Расположение", ВыбранноеЗначение.Расположение);
			
			ДопПараметры.Вставить("Действие",				"ПроверкаПодписания");
			ДопПараметры.Вставить("Организация",  			ВыбранноеЗначение.Организация);
			ДопПараметры.Вставить("Отпечаток",  			ВыбранноеЗначение.Отпечаток);
			ДопПараметры.Вставить("Расположение",  			ВыбранноеЗначение.Расположение);
			ДопПараметры.Вставить("СертификатДействуетПо",  ВыбранноеЗначение.СертификатДействуетПо);
			ДопПараметры.Вставить("ЗапомнитьВыбор", 		ВыбранноеЗначение.ЗапомнитьВыбор);
			ДопПараметры.Вставить("НомерПопытки", 			1);
			ДопПараметры.Вставить("Успешно", 				Ложь);
			ДопПараметры.Вставить("ОписаниеОшибки", 		"");
			ДопПараметры.Вставить("РеквизитыСертификата", 	ВыбранноеЗначение.РеквизитыСертификата); 
			
			ОбработчикВыбораСертификата(ДанныеАвторизации.ПарольКонтейнера, ДопПараметры);
			
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли ДопПараметры.Действие = "ПроверкаПодписания" Тогда
		
		Если ВыбранноеЗначение = Неопределено Тогда
			
			// пользователь отказался от выбора сертификата
			ОбновитьДанныеАвторизации("СертификатПроверен", 			Истина);
			ОбновитьДанныеАвторизации("ВалидацияСертификатаПройдена", 	Ложь);
			ДопПараметры.Вставить("ОписаниеОшибки", "Ввод пароля отменен");
			ВыполнитьКомандуФинальногоОбработчикаВыбораСертификата(ДопПараметры.ФинальныйОбработчик, ДопПараметры);
			
		Иначе
			
			ОбработчикПроверкиПодписанияСертификатом(ВыбранноеЗначение, ДопПараметры);
			
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли ДопПараметры.Действие = "ПовторныйВыборСертификата" Тогда
		
		// выбор сертификата завершился ошибкой, предложим выбрать еще раз
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОбъектПараметрыКлиентСервер", 	Объект.ПараметрыКлиентСервер);
		ПараметрыФормы.Вставить("Организация", 					ДопПараметры.Организация);
		
		РеквизитыСертификата = Неопределено;
		ДопПараметры.Свойство("РеквизитыСертификата", РеквизитыСертификата);
		ПараметрыФормы.Вставить("Сертификат", 					РеквизитыСертификата);
		
		Если Найти(ДопПараметры.ФинальныйОбработчик, "СпроситьНедостающиеСертификатыДляПодписиИПодписатьСчетаФактуры()") > 0 Тогда
			ПараметрыФормы.Вставить("ПоказыватьФлагЗапомнитьВыбор", Истина);
		КонецЕсли;
		
		ДопПараметры.Вставить("Действие", 				"ВыборСертификата");
		ДопПараметры.Вставить("НомерПопытки", 			1);
		
		МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сертификаты_СписокУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикВыбораСертификата", ЭтаФорма, ДопПараметры);
		
		Возврат;
		
	ИначеЕсли ДопПараметры.Действие = "ПроверкаСертификатаВФНС" Тогда
		
		ОбработчикПроверкиСертификатаВФНС(ДопПараметры);
		Возврат;
		
	ИначеЕсли ДопПараметры.Действие = "ПроверкаНеобходимостиМЧД" Тогда
		
		ОбработчикПроверкиНеобходимостиМЧД(ДопПараметры);
		Возврат;
		
	ИначеЕсли ДопПараметры.Действие = "ВыборМЧД" Тогда
		
		ОбработчикВыбораМЧД(ДопПараметры);
		Возврат;
		
	ИначеЕсли ДопПараметры.Действие = "ВалидацияМЧД" Тогда
		
		ОбработчикВалидацииМЧД(ВыбранноеЗначение, ДопПараметры);
		Возврат;		
		
	ИначеЕсли ДопПараметры.Действие = "ЗавершениеПроверки" Тогда
		
		Если ЗначениеЗаполнено(ДанныеАвторизации.Доверенность) И Не ДанныеАвторизации.ВалидацияДоверенностиПройдена
			И ДопПараметры.Свойство("ОшибкиДоверенности") И ДопПараметры.ОшибкиДоверенности = ДопПараметры.ИгнорируемыеОшибкиДоверенности Тогда
			ОбновитьДанныеАвторизации("ВалидацияДоверенностиПройдена", Истина);
		КонецЕсли;	
		
		ВыполнитьКомандуФинальногоОбработчикаВыбораСертификата(ДопПараметры.ФинальныйОбработчик, ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция ДоверенностьПоУмолчанию(ДанныеАвторизации) Экспорт
	
	ИдентификаторОрганизацииДиадок = ИдентификаторОрганизацииДиадок_Сервер(ДанныеАвторизации);
	ИдентификаторЯщикаДиадок = ИдентификаторЯщикаДиадок(ДанныеАвторизации, ИдентификаторОрганизацииДиадок);               
	ИдентификаторПользователя = ОписаниеПользователяДиадок(ДанныеАвторизации).UserId;
	
	СписокДоверенностей = ПолучитьСписокМЧДСотрудника(ДанныеАвторизации, ИдентификаторЯщикаДиадок, ИдентификаторПользователя);
	
	Для Каждого СтруктураДоверенности Из СписокДоверенностей Цикл 
		Если СтруктураДоверенности.ПоУмолчанию = Истина Тогда
			Возврат СтруктураДоверенности.МашиночитаемаяДоверенность;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикВыбораМЧД(ДопПараметры) Экспорт
	
	ИдентификаторОрганизацииДиадок = ИдентификаторОрганизацииДиадок_Сервер(ДанныеАвторизации);
	ИдентификаторЯщикаДиадок = ИдентификаторЯщикаДиадок(ДанныеАвторизации, ИдентификаторОрганизацииДиадок);               
	ИдентификаторПользователя = ОписаниеПользователяДиадок(ДанныеАвторизации).UserId;
	
	СписокДоверенностей = ПолучитьСписокМЧДСотрудника(ДанныеАвторизации, ИдентификаторЯщикаДиадок, ИдентификаторПользователя);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокДоверенностей", СписокДоверенностей);
	ПараметрыФормы.Вставить("ДанныеАвторизации", ДанныеАвторизации);
	ПараметрыФормы.Вставить("ИдентификаторОрганизацииДиадок", ИдентификаторОрганизацииДиадок);
	ПараметрыФормы.Вставить("ИдентификаторЯщикаДиадок", ИдентификаторЯщикаДиадок);
	ПараметрыФормы.Вставить("ИдентификаторПользователя", ИдентификаторПользователя);
	ПараметрыФормы.Вставить("ОбъектПараметрыКлиентСервер", Объект.ПараметрыКлиентСервер);
	
	Если ДопПараметры.Свойство("РеквизитыСертификата") Тогда
		ПараметрыФормы.Вставить("РеквизитыСертификата", ДопПараметры.РеквизитыСертификата);
	КонецЕсли;
	
	Если ДопПараметры.Свойство("Контекст") И ДопПараметры.Контекст = "ФормаВыбора" Тогда
		ПараметрыФормы.Вставить("Контекст", "ФормаВыбора");
	КонецЕсли;
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ДоверенностиСписок_Управляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикВалидацииМЧД", ЭтаФорма, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВалидацииМЧД(Доверенность, ДопПараметры) Экспорт
	
	ДопПараметры.Вставить("Доверенность", Доверенность);	
	
	ПараметрыКонтекста = Новый Структура;
	ПараметрыКонтекста.Вставить("Доверенность", Доверенность);
	ПараметрыКонтекста.Вставить("ОшибкиДоверенности", "");
	ПараметрыКонтекста.Вставить("ДопПараметры", ДопПараметры);
	
	Если Доверенность = Неопределено Тогда
		Оповестить("ПослеВыбораДоверенности", ПараметрыКонтекста, ЭтаФорма); 
		Возврат;
	КонецЕсли;
	
	ИдентификаторОрганизацииДиадок = ИдентификаторОрганизацииДиадок_Сервер(ДанныеАвторизации);
	ИдентификаторЯщикаДиадок = ИдентификаторЯщикаДиадок(ДанныеАвторизации, ИдентификаторОрганизацииДиадок); 
		
	РезультатПроверкиМашиночитаемойДоверенности = ПредварительнаяПроверкаМЧД(ДанныеАвторизации, ИдентификаторЯщикаДиадок, Доверенность.СоставнойИдентификатор, Неопределено);

	Ошибки = ОшибкиВалидацииМЧД(РезультатПроверкиМашиночитаемойДоверенности);
	
	Если Не ПустаяСтрока(Ошибки) Тогда
		
		ПараметрыКонтекста.Вставить("ОшибкиДоверенности", Ошибки);
		
		ОбновитьДанныеАвторизации("ВалидацияДоверенностиПройдена", Ошибки = ДопПараметры.ИгнорируемыеОшибкиДоверенности);
		
		ДопПараметры.Вставить("ОшибкиДоверенности", Ошибки);
		
	Иначе
		
		ОбновитьДанныеАвторизации("ВалидацияДоверенностиПройдена", Истина);
		
		ДопПараметры.Вставить("ОшибкиДоверенности", "");
		
	КонецЕсли;
	
	ОбновитьДанныеАвторизации("Доверенность", Доверенность);		
	Оповестить("ПослеВыбораДоверенности", ПараметрыКонтекста, ЭтаФорма); 
	
	ФормаОткрыта = ДопПараметры.Свойство("Форма_СертификатыДоверенности_Открыта") И ДопПараметры.Форма_СертификатыДоверенности_Открыта = Истина; 
	
	Если ДанныеАвторизации.ВалидацияДоверенностиПройдена И Не ФормаОткрыта Тогда
		ДопПараметры.Вставить("Действие", "ЗавершениеПроверки");
	Иначе
		ДопПараметры.Вставить("Действие", "ПроверкаНеобходимостиМЧД");	
	КонецЕсли;
	
	ОбработчикВыбораСертификата(Неопределено, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Функция ОшибкиВалидацииМЧД(РезультатПроверкиМашиночитаемойДоверенности)
	
	Ошибки = "";
	
	ТекстОшибки = РезультатПроверкиМашиночитаемойДоверенности.СтатусПроверки.ОшибкаОперации.Текст;
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		Ошибки = " - " + ТекстОшибки + Символы.ПС;	
	КонецЕсли;	
	
	Если РезультатПроверкиМашиночитаемойДоверенности.СтатусПроверки.ПротоколВалидации.РезультатПроверкиВалидации.Количество() > 0 Тогда
		Для Каждого РезультатПроверкиВалидации Из РезультатПроверкиМашиночитаемойДоверенности.СтатусПроверки.ПротоколВалидации.РезультатПроверкиВалидации Цикл
			
			ТекстОшибки = РезультатПроверкиВалидации.Ошибка.Текст;
			Если Не ПустаяСтрока(ТекстОшибки) Тогда
				Ошибки = Ошибки + " - " + ТекстОшибки + Символы.ПС;	
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
	Если ПустаяСтрока(Ошибки) И РезультатПроверкиМашиночитаемойДоверенности.СтатусПроверки.Ошибки.Количество() > 0 Тогда
		
		ПараметрыФормы = Новый Структура;
		
		Для Каждого Ошибка Из РезультатПроверкиМашиночитаемойДоверенности.СтатусПроверки.Ошибки Цикл // устарело
			
			Ошибки = Ошибки + " - " + Ошибка.Текст + Символы.ПС;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(Ошибки) Тогда
		
		Ошибки = РезультатПроверкиМашиночитаемойДоверенности.СтатусПроверки.ТекстСтатуса + "
		|
		|" + Ошибки;
		
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции

&НаКлиенте
Функция ПривязкаМЧДСотруднику(ДанныеАвторизации, ИдентификаторЯщика, ИдентификаторПользователя, СоставнойИдентификаторМЧД) Экспорт
	
	PowerOfAttorneyFullId = МодульОбъектаКлиент().КонтурДиадокAPI_Привести("PowerOfAttorneyFullId", СоставнойИдентификаторМЧД);
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_ПривязатьСотрудникаКДоверенности(ДанныеАвторизацииДиадок, ИдентификаторЯщика, ИдентификаторПользователя, PowerOfAttorneyFullId, Истина);
	
	Возврат Результат;
		
КонецФункции

&НаКлиенте
Функция ЗарегистрироватьДоверенность(ДанныеАвторизации, ИдентификаторЯщика, МашиночитаемаяДоверенностьДляРегистрации) Экспорт
	
	PowerOfAttorneyToRegister = МодульОбъектаКлиент().КонтурДиадокAPI_Привести("PowerOfAttorneyToRegister", МашиночитаемаяДоверенностьДляРегистрации);
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_ЗарегистрироватьДоверенность(ДанныеАвторизацииДиадок, ИдентификаторЯщика, PowerOfAttorneyToRegister, Истина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПроверитьРегистрациюДоверенности(ДанныеАвторизации, ИдентификаторЯщика, TaskId) Экспорт
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_ПроверитьРегистрациюДоверенности(ДанныеАвторизацииДиадок, ИдентификаторЯщика, TaskId, Истина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПредварительнаяПроверкаМЧД(ДанныеАвторизации, ИдентификаторЯщика, СоставнойИдентификаторМЧД, Сертификат) Экспорт
	
	СоставнойИдентификатор = МодульОбъектаКлиент().КонтурДиадокAPI_Привести("PowerOfAttorneyFullId", СоставнойИдентификаторМЧД); 
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	
	РезультатПроверкиМашиночитаемойДоверенности = МодульОбъектаКлиент().КонтурДиадокAPI_ПредварительнаяПроверкаДоверенности(ДанныеАвторизацииДиадок, ИдентификаторЯщика, СоставнойИдентификатор, ДанныеАвторизацииДиадок.Отпечаток, Истина);

	Возврат РезультатПроверкиМашиночитаемойДоверенности;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокМЧДСотрудника(ДанныеАвторизации, ИдентификаторЯщикаДиадок, ИдентификаторПользователя, ТолькоАктуальные = Истина) Экспорт
	     
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	СписокМЧДСотрудника = МодульОбъектаКлиент().КонтурДиадокAPI_ДоверенностиПользователя(ДанныеАвторизацииДиадок, ИдентификаторЯщикаДиадок, ИдентификаторПользователя, ТолькоАктуальные, Истина);
	
	МашиночитаемыеДоверенностиСотрудника = СписокМЧДСотрудника.МашиночитаемыеДоверенности;
	
	Для Каждого ТекущаяМЧД Из МашиночитаемыеДоверенностиСотрудника Цикл
		МашиночитаемаяДоверенностьСотрудника = ТекущаяМЧД.МашиночитаемаяДоверенность;
		МашиночитаемаяДоверенностьСотрудника.ДатаНачала = МодульОбъектаКлиент().КонтурСтандарт_Ticks_to_Date(МашиночитаемаяДоверенностьСотрудника.ДатаНачала.КоличествоТиков); 	
		МашиночитаемаяДоверенностьСотрудника.СрокДействия = МодульОбъектаКлиент().КонтурСтандарт_Ticks_to_Date(МашиночитаемаяДоверенностьСотрудника.СрокДействия.КоличествоТиков); 				
	КонецЦикла;
	
	Возврат МашиночитаемыеДоверенностиСотрудника;
	
КонецФункции

Функция ПеременнаяСодержитСвойство(Переменная, ИмяСвойства, Свойство = Неопределено, СвойствоЗаполнено = Ложь) Экспорт
	
	GUIDПроверка = Новый УникальныйИдентификатор;
	
	СтруктураПроверка = Новый Структура;
	СтруктураПроверка.Вставить(ИмяСвойства, GUIDПроверка);
	
	ЗаполнитьЗначенияСвойств(СтруктураПроверка, Переменная);
	
	
	Если СтруктураПроверка[ИмяСвойства] = GUIDПроверка Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Свойство = Переменная[ИмяСвойства];
		
		Если СвойствоЗаполнено = Истина Тогда
			
			Возврат ЗначениеЗаполнено(Свойство);
			
		Иначе
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;		
	
КонецФункции

&НаКлиенте
Функция TimeStampToDate(TimeStamp)
	Возврат Дата('00010101')+ TimeStamp / 10000000;
КонецФункции

&НаКлиенте
Функция Новый_Доверенность() Экспорт
	
	Новый_Доверенность = Новый Структура;
	Новый_Доверенность.Вставить("Идентификатор");
	Новый_Доверенность.Вставить("НаименованиеОрганизации");
	Новый_Доверенность.Вставить("ИННОрганизации");
	Новый_Доверенность.Вставить("КППОрганизации");
	Новый_Доверенность.Вставить("ДатаВыдачи");
	Новый_Доверенность.Вставить("СрокДействия");
	Новый_Доверенность.Вставить("ДоверенноеЛицоФамилия");
	Новый_Доверенность.Вставить("ДоверенноеЛицоИмя");
	Новый_Доверенность.Вставить("ДоверенноеЛицоОтчество");
	Новый_Доверенность.Вставить("ДоверенноеЛицоФИО");  
	
	Новый_Доверенность.Вставить("КраткоеПредставление");
	Новый_Доверенность.Вставить("ПолноеПредставление"); 
	
	Новый_Доверенность.Вставить("ДвоичныеДанныеДоверенности");
	Новый_Доверенность.Вставить("ДвоичныеДанныеПодписи");
	
	Возврат Новый_Доверенность;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикПроверкиНеобходимостиМЧД(ДопПараметры)
	
	ПараметрыКонтекста = Новый Структура;
	ПараметрыКонтекста.Вставить("ДопПараметры");	
	ПараметрыКонтекста.Вставить("Доверенность");
	ПараметрыКонтекста.Вставить("ТребуетсяДоверенность");
	ПараметрыКонтекста.Вставить("Сертификат");	
	
	Если ДанныеАвторизации.Расположение = "сервер" Тогда
		РеквизитыСертификата = ПолучитьРеквизитыСертификатаНаСервере(ДанныеАвторизации);
	Иначе	
		РеквизитыСертификата = ПолучитьРеквизитыСертификатаНаКлиенте(ДанныеАвторизации.Отпечаток);
	КонецЕсли;
	
	ПараметрыКонтекста.Сертификат = РеквизитыСертификата;
	
	ДоверенностьНазначена = Ложь;
	
	Если ДопПараметры.Свойство("Доверенность") И ЗначениеЗаполнено(ДопПараметры.Доверенность) Тогда
		ПараметрыКонтекста.Доверенность = ДопПараметры.Доверенность;
		ДоверенностьНазначена = Истина;
	КонецЕсли;
	
	ТребуетсяДоверенность = ДляСертификатаНеобходимаДоверенность(ДанныеАвторизации);
	
	ПараметрыКонтекста.ТребуетсяДоверенность = ТребуетсяДоверенность;
	ПараметрыКонтекста.ДопПараметры = ДопПараметры;
	
	Если НЕ ДоверенностьНазначена И ТребуетсяДоверенность = Истина Тогда
		ДоверенностьПоУмолчанию = ДоверенностьПоУмолчанию(ДанныеАвторизации);
		Если ДоверенностьПоУмолчанию <> Неопределено Тогда
			ДопПараметры.Вставить("Доверенность", ДоверенностьПоУмолчанию);
			ОбновитьДанныеАвторизации("Доверенность", ДоверенностьПоУмолчанию);
			ПараметрыКонтекста.Доверенность = ДопПараметры.Доверенность;
			
			ДопПараметры.Вставить("Действие",	"ВалидацияМЧД");		
			ОбработчикВыбораСертификата(ДоверенностьПоУмолчанию, ДопПараметры);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	ФормаОткрыта = ДопПараметры.Свойство("Форма_СертификатыДоверенности_Открыта") И ДопПараметры.Форма_СертификатыДоверенности_Открыта = Истина; 
	НадоОткрытьФорму = (ДопПараметры.Свойство("Контекст") И ДопПараметры.Контекст = "Форма_ОбщиеНастройки") 
	ИЛИ (НЕ ДоверенностьНазначена И ТребуетсяДоверенность <> Ложь И ДоверенностьПоУмолчанию = Неопределено)
	ИЛИ (ДоверенностьНазначена И НЕ ДанныеАвторизации.ВалидацияДоверенностиПройдена);
	
	Если ФормаОткрыта Тогда
		
		Оповестить("ПослеПроверкиСертификата", ПараметрыКонтекста, ЭтаФорма);
		
	ИначеЕсли НадоОткрытьФорму И Не ФоновыйРежим Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОбъектПараметрыКлиентСервер", 	Объект.ПараметрыКлиентСервер);
		ПараметрыФормы.Вставить("Организация", 					ДанныеАвторизации.Организация);
		ПараметрыФормы.Вставить("ПоказыватьФлагЗапомнитьВыбор", Истина);
		ПараметрыФормы.Вставить("Сертификат", 					РеквизитыСертификата);
		ПараметрыФормы.Вставить("ТребуетсяДоверенность", 		ПараметрыКонтекста.ТребуетсяДоверенность);
		ПараметрыФормы.Вставить("Доверенность", 				ПараметрыКонтекста.Доверенность);
		
		ПараметрыФормы.Вставить("ДопПараметры", 				ДопПараметры); 
		
		Если ДопПараметры.Свойство("ОшибкиДоверенности") Тогда
			ПараметрыФормы.Вставить("ОшибкиДоверенности", 		ДопПараметры.ОшибкиДоверенности);
		КонецЕсли;	
		
		МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ФормаВыбора_СертификатДоверенность_Управляемая", , ПараметрыФормы, ЭтаФорма, "ПослеВыбораСертификатДоверенность", ЭтаФорма, ДопПараметры);
		
		Оповестить("ПослеПроверкиСертификата", ПараметрыКонтекста, ЭтаФорма);
		
	Иначе
		ДопПараметры.Вставить("Действие", "ЗавершениеПроверки");		
		ОбработчикВыбораСертификата(Неопределено, ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СертификатКвалифицированный(ДанныеАвторизации) Экспорт
	
	Результат = Неопределено;
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	
	Попытка
		ИдентификаторОрганизацииДиадок = ИдентификаторОрганизацииДиадок_Сервер(ДанныеАвторизации);
		ИдентификаторЯщикаДиадок = ИдентификаторЯщикаДиадок(ДанныеАвторизации, ИдентификаторОрганизацииДиадок);
		Ответ = МодульОбъектаКлиент().КонтурДиадокAPI_ПроверкаКвалифицированностиСертификата(ДанныеАвторизацииДиадок, ИдентификаторЯщикаДиадок, ДанныеАвторизацииДиадок.Отпечаток);	
		Результат = Ответ.IsValid;	
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ТекстСообщения = МодульОбъектаКлиент().КонтурСтандарт_СтрШаблон_("По организации ""%1"" не удалось проверить сертификат на квалифицированность по причине:%2%3", Строка(ДанныеАвторизации.Организация), Символы.ПС, ОписаниеОшибки);		
		МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(ТекстСообщения, УникальныйИдентификатор);
	КонецПопытки;
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДляСертификатаНеобходимаДоверенность(ДанныеАвторизации) Экспорт
	
	Результат = Ложь;
	
	ИдентификаторОрганизацииДиадок = ИдентификаторОрганизацииДиадок_Сервер(ДанныеАвторизации);
	ИдентификаторЯщикаДиадок = ИдентификаторЯщикаДиадок(ДанныеАвторизации, ИдентификаторОрганизацииДиадок);
	
	Попытка
		ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
		СертификатыДиадок = МодульОбъектаКлиент().КонтурДиадокAPI_ИнформацияОСертификатах(ДанныеАвторизацииДиадок, ИдентификаторЯщикаДиадок);
	Исключение
		_ОписаниеОшибки = ОписаниеОшибки();
		ТекстСообщения = "Не удалось получить информацию о необходимости доверенности для сертификата по причине: 
		|" + _ОписаниеОшибки;
		МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(ТекстСообщения);
		
		Возврат "Неопределено"; // внимание, функция возвращает не только булево 
		
	КонецПопытки;

	DiadocOrgInn = ПолучитьЗначениеСвойстваОбъектаEDI_Сервер(ДанныеАвторизации.Организация, "DiadocOrgInn");
	
	Для Каждого СертификатДиадок Из СертификатыДиадок.Certificates Цикл
		
		Результат = (Врег(ДанныеАвторизации.Отпечаток) = Врег(СертификатДиадок.Thumbprint) И СертификатДиадок.Inn <> DiadocOrgInn);
		
		Если Результат Тогда
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикПроверкиСертификатаВФНС(ДопПараметры)
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	
	ИдентификаторОрганизацииДиадок = ИдентификаторОрганизацииДиадок_Сервер(ДанныеАвторизации);
	ИдентификаторЯщикаДиадок = ИдентификаторЯщикаДиадок(ДанныеАвторизации, ИдентификаторОрганизацииДиадок);
	
	Попытка
		РезультатПроверки = МодульОбъектаКлиент().КонтурДиадокAPI_СертификатИспользуетсяДляПодписания(ДанныеАвторизацииДиадок, ИдентификаторЯщикаДиадок, ДанныеАвторизацииДиадок.Отпечаток);
	Исключение       
		ОписаниеОшибки = ОписаниеОшибки();
		Если Найти(ОписаниеОшибки, "is not registered in FNS") > 0 Тогда
			Ответ = МодульОбъектаКлиент().КонтурДиадокAPI_ЗарегистрироватьСертификатФНС(ДанныеАвторизацииДиадок, ИдентификаторЯщикаДиадок, ДанныеАвторизацииДиадок.Отпечаток);
		КонецЕсли;
	КонецПопытки;
	
	// доверенность назначена	
	Если ДопПараметры.Свойство("Доверенность") И ЗначениеЗаполнено(ДопПараметры.Доверенность) Тогда
		
		ДопПараметры.Вставить("Действие",	"ВалидацияМЧД");		
		ОбработчикВыбораСертификата(ДопПараметры.Доверенность, ДопПараметры);
		
	Иначе
		
		ДопПараметры.Вставить("Действие",	"ПроверкаНеобходимостиМЧД");		
		ОбработчикВыбораСертификата(Неопределено, ДопПараметры);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ОписаниеПользователяДиадок(ДанныеАвторизации)     
   
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_ИнформацияТекущегоПользователя(ДанныеАвторизацииДиадок);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИдентификаторЯщикаДиадок(ДанныеАвторизации, ИдентификаторОрганизацииДиадок)
	
	Организация = ДанныеАвторизации.Организация;	
	DiadocBoxId = ПолучитьЗначениеСвойстваОбъектаEDI_Сервер(Организация, "DiadocBoxId");
	
	Если НЕ ЗначениеЗаполнено(DiadocBoxId) Тогда
		
		ОписаниеОрганизации = ОписаниеОрганизацииДиадок(ДанныеАвторизации, ИдентификаторОрганизацииДиадок);
		DiadocBoxId = ОписаниеОрганизации.Boxes[0].BoxId;
		УстановитьЗначениеСвойстваОбъекта_Сервер(Организация, "DiadocBoxId", DiadocBoxId);		
		
	КонецЕсли;
	
	Возврат DiadocBoxId;	
	
КонецФункции


&НаСервере
Функция ПолучитьЗначениеСвойстваОбъектаEDI_Сервер(Объект_, ИмяСвойства)
	Возврат МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Объект_, ИмяСвойства); 
КонецФункции 

&НаСервере
Процедура УстановитьЗначениеСвойстваОбъекта_Сервер(Объект_, ИмяСвойства, Значение)
	МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(Объект_, ИмяСвойства, Значение); 
КонецПроцедуры

&НаКлиенте
Функция ОписаниеОрганизацииДиадок(ДанныеАвторизации, ИдентификаторОрганизацииДиадок)  
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_Организации(ДанныеАвторизацииДиадок, ИдентификаторОрганизацииДиадок);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИдентификаторОрганизацииДиадок_Сервер(ДанныеАвторизации)
	
	Результат = МодульОбъекта().ИдентификаторОрганизацииДиадок(ДанныеАвторизации.Организация);
	Если Результат = Неопределено Тогда
		ВызватьИсключение "Для организации " + Строка(ДанныеАвторизации.Организация) + " не настроена связка с diadoc.ru
		|обратитесь в техническую поддержку";		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИдентификаторЯщикаДиадок_Сервер(ДанныеАвторизации, ИдентификаторОрганизацииДиадок)
	
	Возврат МодульОбъекта().ИдентификаторЯщикаДиадок(ДанныеАвторизации, ИдентификаторОрганизацииДиадок);
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьКомандуФинальногоОбработчикаВыбораСертификата(ТекстКоманды, ДопПараметры)
	
	Если Найти(ТекстКоманды, "Оповестить_") > 0 Тогда
		ИмяСобытия = Сред(ТекстКоманды, 12);
		Оповестить(ИмяСобытия, ДопПараметры);
	Иначе
		Если ДопПараметры.Успешно = Ложь Тогда
			МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(ДопПараметры.ОписаниеОшибки);
		КонецЕсли;
		
		Выполнить(ТекстКоманды);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСертификатПоУмолчаниюСервер(ДанныеСертификата)
	
	МодульОбъекта().СохранитьСертификатПоУмолчанию(ДанныеСертификата);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработчикПроверкиПодписанияСертификатом(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Состояние("Проверка сертификата...");
	
	ПарольКонтейнера = "";
	СохранитьПароль = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ПарольКонтейнера = ВыбранноеЗначение.ПолеВвода;
		СохранитьПароль = ВыбранноеЗначение.Флаг;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		ПарольКонтейнера = ВыбранноеЗначение;
	КонецЕсли;
	
	РезультатПроверки = ПроверитьВыбранныйСертификат(ДопПараметры.Организация, ДопПараметры.Отпечаток, ДопПараметры.Расположение, ДопПараметры.СертификатДействуетПо, ПарольКонтейнера);
	
	Если РезультатПроверки.Успешно = Ложь
		И ОшибкаНеправильныйПарольКонтейнера(РезультатПроверки.ОписаниеОшибки)
		И ДопПараметры.НомерПопытки = 1 Тогда
		
		ПарольКонтейнера = ПолучитьПарольКонтейнераСертификатаСервер(ДопПараметры.Организация, ДопПараметры.Отпечаток);
		РезультатПроверки = ПроверитьВыбранныйСертификат(ДопПараметры.Организация, ДопПараметры.Отпечаток, ДопПараметры.Расположение, ДопПараметры.СертификатДействуетПо, ПарольКонтейнера);
		
	КонецЕсли;
	
	ОбновитьДанныеАвторизации("СертификатПроверен", Истина);
	
	Если РезультатПроверки.Успешно = Истина Тогда
		
		ДопПараметры.Успешно = Истина;
		ОбновитьДанныеАвторизации("ВалидацияСертификатаПройдена", 	Истина);
		ОбновитьДанныеАвторизации("ПарольКонтейнера", 				ПарольКонтейнера);
		
		Если Не ЗначениеЗаполнено(ДанныеАвторизации.Отпечаток) Тогда
			// могли только что выбрать сертификат через форму
			ОбновитьДанныеАвторизации("Отпечаток", 				ДопПараметры.Отпечаток); 
			ОбновитьДанныеАвторизации("Расположение", 			ДопПараметры.Расположение);
			ОбновитьДанныеАвторизации("СертификатДействуетПо", 	ДопПараметры.СертификатДействуетПо);
		КонецЕсли;
		
		Если ДопПараметры.ЗапомнитьВыбор = Истина Тогда
			
			ДанныеСертификата = Новый Структура;
			ДанныеСертификата.Вставить("Организация", 			ДопПараметры.Организация);
			ДанныеСертификата.Вставить("Отпечаток", 			ДопПараметры.Отпечаток);
			ДанныеСертификата.Вставить("Расположение", 			ДопПараметры.Расположение);
			ДанныеСертификата.Вставить("СертификатДействуетПо", ДопПараметры.СертификатДействуетПо);
			ДанныеСертификата.Вставить("Доверенность", 			Неопределено);
			ДанныеСертификата.Вставить("ТребуетсяДоверенность", 			СвойствоСтруктуры(ДопПараметры, "ТребуетсяДоверенность", Неопределено));
			ДанныеСертификата.Вставить("ИгнорируемыеОшибкиДоверенности", 	СвойствоСтруктуры(ДопПараметры, "ИгнорируемыеОшибкиДоверенности", Неопределено));
			
			Если ДопПараметры.Свойство("СвойстваСертификата") Тогда
				ДанныеСертификата.Вставить("СвойстваСертификата", 	ДопПараметры.СвойстваСертификата); 
			Иначе
				ДанныеСертификата.Вставить("СвойстваСертификата", 	ДопПараметры.РеквизитыСертификата.СвойстваСертификата);
			КонецЕсли;
			
			СохранитьСертификатПоУмолчаниюСервер(ДанныеСертификата);
			
		КонецЕсли;
		
		ПарольКонтейнераСервер = ПолучитьПарольКонтейнераСертификатаСервер(ДопПараметры.Организация, ДопПараметры.Отпечаток);
		НужноСброситьПарольКонтейнераНаСервере = ЗначениеЗаполнено(ПарольКонтейнераСервер) И НЕ ЗначениеЗаполнено(ПарольКонтейнера);
		
		Если СохранитьПароль = Истина ИЛИ НужноСброситьПарольКонтейнераНаСервере Тогда
			
			ДанныеСертификата = Новый Структура;
			ДанныеСертификата.Вставить("Организация", 			ДопПараметры.Организация);
			ДанныеСертификата.Вставить("Отпечаток", 			ДопПараметры.Отпечаток);
			ДанныеСертификата.Вставить("Расположение", 			ДопПараметры.Расположение);
			ДанныеСертификата.Вставить("СертификатДействуетПо", ДопПараметры.СертификатДействуетПо);
			ДанныеСертификата.Вставить("ПарольКонтейнера", 		ПарольКонтейнера);
			ДанныеСертификата.Вставить("Доверенность", 			Неопределено);
			ДанныеСертификата.Вставить("ТребуетсяДоверенность", 			СвойствоСтруктуры(ДопПараметры, "ТребуетсяДоверенность", Неопределено));
			ДанныеСертификата.Вставить("ИгнорируемыеОшибкиДоверенности", 	СвойствоСтруктуры(ДопПараметры, "ИгнорируемыеОшибкиДоверенности", Неопределено));
			
			Если ДопПараметры.Свойство("СвойстваСертификата") Тогда
				ДанныеСертификата.Вставить("СвойстваСертификата", 	ДопПараметры.СвойстваСертификата); 
			Иначе
				ДанныеСертификата.Вставить("СвойстваСертификата", 	ДопПараметры.РеквизитыСертификата.СвойстваСертификата);
			КонецЕсли;
			
			СохранитьПараметрыСертификатаСервер(ДанныеСертификата);
			
		КонецЕсли;											
		
	Иначе
		
		ОбновитьДанныеАвторизации("ВалидацияСертификатаПройдена", Ложь);
		ДопПараметры.ОписаниеОшибки = РезультатПроверки.ОписаниеОшибки;
		
		Если ОшибкаДействиеОтмененоПользователем(РезультатПроверки.ОписаниеОшибки) Тогда
			ДопПараметры.ОписаниеОшибки = "Действие было отменено пользователем";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДопПараметры.СертификатДействуетПо) 
			И КонецДня(ДопПараметры.СертификатДействуетПо) < ТекущаяДата() Тогда
			ДопПараметры.ОписаниеОшибки = "Истек срок действия сертификата." + Символы.ПС + ДопПараметры.ОписаниеОшибки;				
		КонецЕсли;
		
		Если ОшибкаНеправильныйПарольКонтейнера(РезультатПроверки.ОписаниеОшибки) И Не ФоновыйРежим Тогда
			СпроситьПарольКонтейнера(ДопПараметры);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если РезультатПроверки.Успешно = Ложь
		Или Не СертификатПоОрганизацииНазначен(ДопПараметры.Организация) Тогда
		
		Если ФоновыйРежим Тогда
			Возврат;
		КонецЕсли;	
		
		ДопПараметры.Вставить("Действие",	"ПовторныйВыборСертификата");
		МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(ДопПараметры.ОписаниеОшибки);
		
		Если РезультатПроверки.ОписаниеОшибки = "Сертификат не является квалифицированным" Тогда
			
			МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сертификат_НеКвалифицированный_Управляемая", , , ЭтаФорма, "ОбработчикВыбораСертификата", ЭтаФорма, ДопПараметры);
			
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("ДопПараметры", ДопПараметры);
			ПараметрыОповещения.Вставить("Доверенность", Неопределено);
			ПараметрыОповещения.Вставить("ТребуетсяДоверенность", Ложь);
			ПараметрыОповещения.Вставить("Сертификат", Неопределено);
			
			ВыполнитьКомандуФинальногоОбработчикаВыбораСертификата("Оповестить_ПослеПроверкиСертификата", ПараметрыОповещения);
			Возврат;
		КонецЕсли;
		
	Иначе
		ДопПараметры.Вставить("Действие",	"ПроверкаСертификатаВФНС");
		
	КонецЕсли;
	
	ОбработчикВыбораСертификата(ВыбранноеЗначение, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Функция ОбработкаИсключенияТипМодуляКриптографии(ОписаниеОшибки, ДанныеСертификата)
	
	ОписаниеОшибкиНРег = НРег(ОписаниеОшибки);
	
	Если Найти(ОписаниеОшибкиНРег, НРег("Сертификат, связанный с закрытым ключом, указывает на модуль криптографии, отличный от текущего")) = 0 Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	ТипыМодуляКриптографии = МодульОбъектаКлиент().Криптография_ВариантыНастройкиПоТипуПлатформы();
	
	Для Каждого МодульКриптографии Из ТипыМодуляКриптографии Цикл
		
		Если Найти(ОписаниеОшибкиНРег, НРег(МодульКриптографии.ИмяМодуляКриптографии)) <> 0
			И Найти(ОписаниеОшибкиНРег, НРег(МодульКриптографии.ТипМодуляКриптографии)) <> 0 Тогда
			
			ОбновитьДанныеАвторизации("ИмяМодуляКриптографии", МодульКриптографии.ИмяМодуляКриптографии);
			ОбновитьДанныеАвторизации("ТипМодуляКриптографии", МодульКриптографии.ТипМодуляКриптографии);
			
			ДанныеСертификата.Вставить("ИмяМодуляКриптографии", МодульКриптографии.ИмяМодуляКриптографии);
			ДанныеСертификата.Вставить("ТипМодуляКриптографии", МодульКриптографии.ТипМодуляКриптографии);
			
			СохранитьПараметрыСертификатаСервер(ДанныеСертификата);
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ОшибкаНеправильныйПарольКонтейнера(ОписаниеОшибки = "")
	
	ШаблоныОшибокПароляКонтейнера = Новый Массив;
	ШаблоныОшибокПароляКонтейнера.Добавить("неправильный пароль доступа к закрытому ключу");
	ШаблоныОшибокПароляКонтейнера.Добавить("контекст был получен в ограниченном режиме");
	ШаблоныОшибокПароляКонтейнера.Добавить("incorrect access password to a private key");
	ШаблоныОшибокПароляКонтейнера.Добавить("ошибка при установке параметра модуля криптографии");
	ШаблоныОшибокПароляКонтейнера.Добавить("ошибка при расшифровании криптографических данных");
	
	ЭтоОшибкаПароляКонтейнера = Ложь;
	
	Для Каждого ШаблонОшибки Из ШаблоныОшибокПароляКонтейнера Цикл
		
		ЭтоОшибкаПароляКонтейнера = 
		Найти(Нрег(ОписаниеОшибки), ШаблонОшибки) <> 0;
		
		Если ЭтоОшибкаПароляКонтейнера Тогда
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЭтоОшибкаПароляКонтейнера;
	
КонецФункции 

&НаКлиенте
Функция ОшибкаДействиеОтмененоПользователем(ОписаниеОшибки = "")
	
	Если Найти(Нрег(ОписаниеОшибки), "0x8010006e") <> 0 
		ИЛИ Найти(Нрег(ОписаниеОшибки), "отменено пользователем") <> 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ОшибкаДействиеОтмененоПользователем()

&НаКлиенте
Функция ПолучитьТекстСообщенияДляВопросаОПароле(Отпечаток, Расположение)
	
	Если Расположение = "сервер" Тогда
		ДанныеАвторизацииСертификата = ПолучитьСтруктуруДанныхАвторизации();
		ДанныеАвторизацииСертификата.Отпечаток = Отпечаток;
		ДанныеАвторизацииСертификата.Расположение = Расположение;
		РеквизитыСертификата = ПолучитьРеквизитыСертификатаНаСервере(ДанныеАвторизацииСертификата);
	Иначе	
		РеквизитыСертификата = ПолучитьРеквизитыСертификатаНаКлиенте(Отпечаток);
	КонецЕсли;	
	
	// Подготовка заголовка и текста вопроса
	НаименованиеОрганизации = "";
	Если ЗначениеЗаполнено(РеквизитыСертификата.НаименованиеОрганизацииСубъекта) Тогда
		НаименованиеОрганизации = РеквизитыСертификата.НаименованиеОрганизацииСубъекта;
	ИначеЕсли ЗначениеЗаполнено(РеквизитыСертификата.НаименованиеСубъекта) Тогда
		НаименованиеОрганизации = РеквизитыСертификата.НаименованиеСубъекта;
	Иначе
		НаименованиеОрганизации = "<Не указано>";
	КонецЕсли;
	
	НаименованиеСубъекта = "";
	НаименованиеСубъекта = РеквизитыСертификата.НаименованиеСубъекта;
	Если НаименованиеСубъекта = НаименованиеОрганизации Тогда
		НаименованиеСубъекта = "";
	КонецЕсли;
	ОкончаниеПериодаДействия = Формат(РеквизитыСертификата.ОкончаниеПериодаДействия, "ДЛФ=Д");
	
	ТекстСообщения1 = НаименованиеОрганизации + Символы.ПС + ?(НаименованиеСубъекта = "", "", НаименованиеСубъекта + Символы.ПС ) 
	+ "Годен до " + ОкончаниеПериодаДействия;
	
	Возврат ТекстСообщения1;
	
КонецФункции // ()

&НаКлиенте
Процедура СпроситьПарольКонтейнера(ДопПараметры)
	
	// Подготовка параметров для заполнения универсальной формы ввода
	ПроизвольныеПараметры = Новый Структура;
	ПроизвольныеПараметры.Вставить("ТекстСообщения1", 		ПолучитьТекстСообщенияДляВопросаОПароле(ДопПараметры.Отпечаток, ДопПараметры.Расположение));
	ПроизвольныеПараметры.Вставить("ЗаголовокФормы", 		"Введите пароль");
	ПроизвольныеПараметры.Вставить("ФлагЗаголовок",			"Запомнить пароль");
	ПроизвольныеПараметры.Вставить("ФлагВидимость", 		Истина);
	ПроизвольныеПараметры.Вставить("ТекстСообщения1Цвет", 	Неопределено);
	ПроизвольныеПараметры.Вставить("ПолеВводаРежимПароля", 	Истина);
	
	Если ДопПараметры.НомерПопытки > 1 Тогда
		ТекстСообщения2 = "Неправильный пароль";
		ПроизвольныеПараметры.Вставить("ТекстСообщения2", 		ТекстСообщения2);
		ПроизвольныеПараметры.Вставить("ТекстСообщения2Цвет", 	WebЦвета.Красный);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПроизвольныеПараметры", ПроизвольныеПараметры);
	
	ДопПараметры.НомерПопытки = ДопПараметры.НомерПопытки + 1;
	ДопПараметры.ОписаниеОшибки = "";
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("УниверсальнаяФормаВводаУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикВыбораСертификата", ЭтаФорма, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Функция СертификатПоОрганизацииНазначен(Организация)
	
	Если ТаблицаАвторизации.Количество() = 0 Тогда 
		ЗаполнитьТаблицуАвторизацииПоУмолчанию();
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаАвторизации.НайтиСтроки(Новый Структура("Организация",Организация));
	Если НайденныеСтроки.Количество() = 1
		И ЗначениеЗаполнено(НайденныеСТроки[0].Отпечаток) Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьНазначенныйОрганизацииСертификат(Организация)
	
	НайденныеСтроки = ТаблицаАвторизации.НайтиСтроки(Новый Структура("Организация",Организация));
	Если НайденныеСтроки.Количество() = 1
		И ЗначениеЗаполнено(НайденныеСтроки[0].Отпечаток) Тогда 
		Возврат НайденныеСтроки[0].Отпечаток;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьДанныеАвторизации(Организация) Экспорт
	
	ДанныеАвторизации = ПолучитьСтруктуруДанныхАвторизации();
	
	Если ТаблицаАвторизации.Количество() = 0 Тогда 
		ЗаполнитьТаблицуАвторизацииПоУмолчанию();
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаАвторизации.НайтиСтроки(Новый Структура("Организация",Организация));
	
	Если НайденныеСтроки.Количество() = 1 Тогда
		ЗаполнитьЗначенияСвойств(ДанныеАвторизации, НайденныеСтроки[0]);
		Если ЗначениеЗаполнено(ДанныеАвторизации.Отпечаток) Тогда
			ДанныеАвторизации.ПарольКонтейнера = ПолучитьПарольКонтейнераСертификатаСервер(ДанныеАвторизации.Организация, ДанныеАвторизации.Отпечаток);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьДанныеАвторизацииСертификата()
	
	СтруктураДанныхАвторизации = ПолучитьСтруктуруДанныхАвторизации();
	
	СписокСвойств = "Отпечаток,Расположение,СертификатПроверен,СертификатДействуетПо," + 
	"ВалидацияСертификатаПройдена,ПарольКонтейнера,ТипМодуляКриптографии,ИмяМодуляКриптографии";
	ЗаполнитьЗначенияСвойств(ДанныеАвторизации, СтруктураДанныхАвторизации, СписокСвойств);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруДанныхАвторизации() Экспорт
	
	СтруктураДанныхАвторизации = Новый Структура;
	СтруктураДанныхАвторизации.Вставить("Организация", 						Неопределено);
	СтруктураДанныхАвторизации.Вставить("Отпечаток", 						"");
	СтруктураДанныхАвторизации.Вставить("Расположение", 					""); // "клиент" / "сервер"
	СтруктураДанныхАвторизации.Вставить("ЛогинДД", 							"");
	СтруктураДанныхАвторизации.Вставить("ПарольДД", 						"");
	СтруктураДанныхАвторизации.Вставить("ЛогинПарольДДПроверен", 			Ложь);
	СтруктураДанныхАвторизации.Вставить("СертификатПроверен", 				Ложь);
	СтруктураДанныхАвторизации.Вставить("СертификатДействуетПо", 			Дата(1, 1, 1));
	СтруктураДанныхАвторизации.Вставить("ВалидацияЛогинаПароляДДПройдена", 	Ложь);
	СтруктураДанныхАвторизации.Вставить("ВалидацияСертификатаПройдена", 	Ложь);
	СтруктураДанныхАвторизации.Вставить("ПарольКонтейнера", 				"");
	СтруктураДанныхАвторизации.Вставить("ТипАвторизации", 					"");
	СтруктураДанныхАвторизации.Вставить("ТипМодуляКриптографии",			0);
	СтруктураДанныхАвторизации.Вставить("ИмяМодуляКриптографии", 			"");
	СтруктураДанныхАвторизации.Вставить("Доверенность", 					Неопределено);
	СтруктураДанныхАвторизации.Вставить("СвойстваСертификата", 				Неопределено);
	СтруктураДанныхАвторизации.Вставить("ТребуетсяДоверенность", 			Ложь);
	СтруктураДанныхАвторизации.Вставить("ВалидацияДоверенностиПройдена", 	Ложь);
	СтруктураДанныхАвторизации.Вставить("ИгнорируемыеОшибкиДоверенности", 	"");
	
	Возврат СтруктураДанныхАвторизации;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДанныеАвторизации(Ключ, Значение)
	
	Если ДанныеАвторизации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим данные в структуре ДанныеАвторизации на форме
	ДанныеАвторизации[Ключ] = Значение;
	
	// Обновим данные в таблице ТаблицаАвторизации на форме
	НайденныеСтроки = ТаблицаАвторизации.НайтиСтроки(Новый Структура("Организация", ДанныеАвторизации.Организация));
	Если НайденныеСтроки.Количество() = 1 Тогда
		ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], ДанныеАвторизации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПропускСертификатаПоОрганизации(Организация)
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		// не знаем данные авторизации
		Возврат Истина;
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаАвторизации.НайтиСтроки(Новый Структура("Организация",Организация));
	Если НайденныеСтроки.Количество() = 1
		И НайденныеСтроки[0].СертификатПроверен = Истина
		И (НайденныеСтроки[0].ВалидацияСертификатаПройдена = Ложь 
		ИЛИ (ЗначениеЗаполнено(НайденныеСтроки[0].СертификатДействуетПо)
		И КонецДня(НайденныеСтроки[0].СертификатДействуетПо) < ТекущаяДата())) Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПропускЛогинаПароляДДПоОрганизации(Организация)
	
	НайденныеСтроки = ТаблицаАвторизации.НайтиСтроки(Новый Структура("Организация",Организация));
	Если НайденныеСтроки.Количество() = 1
		И НайденныеСтроки[0].ЛогинПарольДДПроверен = Истина
		И НайденныеСтроки[0].ВалидацияЛогинаПароляДДПройдена = Ложь Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуАвторизацииПоУмолчанию() //выбранные в качестве умолчаний
	
	ТаблицаАвторизации.Очистить();
	
	ОтборПоСертификатам = Новый Структура;
	ОтборПоСертификатам.Вставить("СертификатыПоУмолчанию", Истина);
	
	СертификатыПоУмолчанию = МодульОбъекта().ПолучитьТаблицуСохраненныхСертификатов(ОтборПоСертификатам);
	// Пока нет хранения логина пароля ДД в разрезе организации 
	// обойдем и заполним все строки ТаблицаАвторизации одинаковыми значениями
	СтруктураЛогинПарольДД = МодульОбъекта().ПолучитьСписокСвойствEDI("ЛогинСлужебныйДиадок,ПарольСлужебныйДиадок");
	
	Для Каждого СертПоУмолчанию Из СертификатыПоУмолчанию Цикл
		НоваяСтрока = ТаблицаАвторизации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СертПоУмолчанию);
		
		НоваяСтрока.ЛогинДД 	= СтруктураЛогинПарольДД.ЛогинСлужебныйДиадок;
		НоваяСтрока.ПарольДД 	= СтруктураЛогинПарольДД.ПарольСлужебныйДиадок;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНовыеИдентификаторыСчетовФактурИТребуемоеДействие()
	//В общем случае будут присутствовать не все идентификаторы
	//Могут быть БезНДС ники, у них есть только ТОРГ12.
	//Может быть УПД.
	
	СменитьСтатусСообщенияНаПодписанВДиадок=Ложь;
	
	Для каждого ПодписаннаяСчетФактура Из СчетаФактурыНаПодписание Цикл
		
		Если ЗначениеЗаполнено(ПодписаннаяСчетФактура.messageId_new) Тогда 
			МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(ПодписаннаяСчетФактура.Ссылка.Документ,"messageId",ПодписаннаяСчетФактура.messageId_new);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодписаннаяСчетФактура.torg12Id_new) Тогда 
			МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(ПодписаннаяСчетФактура.Ссылка.Документ,"torg12Id",ПодписаннаяСчетФактура.torg12Id_new);	
			СменитьСтатусСообщенияНаПодписанВДиадок=Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодписаннаяСчетФактура.invoiceId_new) Тогда 
			МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(ПодписаннаяСчетФактура.Ссылка.Документ,"invoiceId",ПодписаннаяСчетФактура.invoiceId_new);	
			СменитьСтатусСообщенияНаПодписанВДиадок=Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодписаннаяСчетФактура.UniversalTransferDocumentId_new) Тогда 
			МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(ПодписаннаяСчетФактура.Ссылка.Документ,"UniversalTransferDocumentId",ПодписаннаяСчетФактура.UniversalTransferDocumentId_new);	
			СменитьСтатусСообщенияНаПодписанВДиадок=Истина;
		КонецЕсли;
		
		Если СменитьСтатусСообщенияНаПодписанВДиадок ИЛИ ПодписаннаяСчетФактура.isDraft = Ложь  Тогда 
			
			СвойстваДляЗаписи = Новый Структура("isDraft, DraftOfDocumentPackageSignedByMe", ПодписаннаяСчетФактура.isDraft, Истина);
			
			МодульОбъекта().ЗаписатьДопРеквизитСправочника_КонтурEDI(ПодписаннаяСчетФактура.Ссылка, СвойстваДляЗаписи);
			
			МодульОбъекта().УстановитьСтатусСообщения(ПодписаннаяСчетФактура.Ссылка,  , "INVOIC", "ИсходящийПодписанВДиадок");
			
			МодульОбъекта().ПроставитьПризнакОтправкиALCRPT_ПослеПодписанияВДиадок(ПодписаннаяСчетФактура.Ссылка.Документ, ПодписаннаяСчетФактура.Ссылка.Партнер);
			
		Иначе
			СообщениеОбъект        = ПодписаннаяСчетФактура.Ссылка.ПолучитьОбъект();
			СообщениеОбъект.Статус = "Ожидает отправки";
			МодульОбъекта().СохранитьОбъектСообщения(СообщениеОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // УстановитьНовыеИдентификаторыСчетовФактур()

//Прикладные

&НаКлиенте
Функция ПроверитьВыбранныйСертификат(Организация, Отпечаток, Расположение, СертификатДействуетПо, ПарольКонтейнера = "")
	
	// Проверим, что можем подписать файл выбранным сертификатом
	Результат = ИнициализироватьСтруктуруРезультатаФункции();
	
	Если Не ЗначениеЗаполнено(Отпечаток) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИмяФайлаДляТеста = ПолучитьИмяВременногоФайла();
	ТестовыйФайл = Новый ТекстовыйДокумент;
	ТестовыйФайл.Записать(ИмяФайлаДляТеста);
	
	ДанныеСертификата = Новый Структура;
	ДанныеСертификата.Вставить("Организация", 			Организация);
	ДанныеСертификата.Вставить("Отпечаток", 			Отпечаток);
	ДанныеСертификата.Вставить("Расположение", 			Расположение);
	ДанныеСертификата.Вставить("СертификатДействуетПо", СертификатДействуетПо);
	
	ДанныеАвторизацииДляТеста = ПолучитьСтруктуруДанныхАвторизации();
	ДанныеАвторизацииДляТеста.Отпечаток = Отпечаток;
	ДанныеАвторизацииДляТеста.Расположение = Расположение;
	ДанныеАвторизацииДляТеста.ПарольКонтейнера = ПарольКонтейнера;
	
	АдресФайлаДляТеста = ПоместитьВоВременноеХранилище(ТестовыйФайл, ЭтаФорма.УникальныйИдентификатор);
	
	Для Сч = 1 По 2 Цикл
		
		Если Расположение = "сервер" Тогда
			РезультатПодписания = ПолучитьПодписьФайлаДокументаНаСервере(АдресФайлаДляТеста, ДанныеАвторизацииДляТеста);
		Иначе
			РезультатПодписания = ПолучитьПодписьФайлаДокументаНаКлиенте(ИмяФайлаДляТеста, Отпечаток, ПарольКонтейнера);
		КонецЕсли;	
		
		Если ОбработкаИсключенияТипМодуляКриптографии(РезультатПодписания.ОписаниеОшибки, ДанныеСертификата) Тогда
			ДанныеАвторизацииДляТеста.ИмяМодуляКриптографии = ДанныеСертификата.ИмяМодуляКриптографии;
			ДанныеАвторизацииДляТеста.ТипМодуляКриптографии = ДанныеСертификата.ТипМодуляКриптографии;
			Продолжить; // еще раз, уже с нужным типом модуля криптографии
		Иначе
			Прервать;
		КонецЕсли;		
		
	КонецЦикла;
	
	УдалитьФайлы(ИмяФайлаДляТеста);
	
	Если РезультатПодписания.Успешно Тогда
		
		ДанныеАвторизацииДляТеста.Организация =	Организация;
		ДанныеАвторизацииДляТеста.ТипАвторизации = "Сертификат";
		
		Если СертификатКвалифицированный(ДанныеАвторизацииДляТеста) = Ложь Тогда
			Результат.ОписаниеОшибки = "Сертификат не является квалифицированным";
			Результат.Успешно = Ложь;
		Иначе			
			Результат.Успешно = Истина;	
		КонецЕсли;
		
	Иначе
		
		Результат.ОписаниеОшибки = РезультатПодписания.ОписаниеОшибки;
		Результат.Успешно = РезультатПодписания.Успешно;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПроверитьЛогинПарольДД(ДанныеАвторизации)

	// Проверим, что можем авторизоваться с указанными данными
	Результат = ИнициализироватьСтруктуруРезультатаФункции();
	
	Если Не ЗначениеЗаполнено(ДанныеАвторизации.ЛогинДД) 
		ИЛИ Не ЗначениеЗаполнено(ДанныеАвторизации.ПарольДД) Тогда
		Результат.ОписаниеОшибки = "Не указаны логин или пароль для доступа в Диадок.";
		ОбновитьДанныеАвторизации("ЛогинПарольДДПроверен", Истина);
		Возврат Результат;
	КонецЕсли;
	
	ТипыАвторизации = МодульОбъектаКлиент().КонтурДиадокAPI_ТипыАвторизации();
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().КонтурДиадокAPI_НовыйДанныеАвторизации(ТипыАвторизации.ЛогинПароль);
	ДанныеАвторизацииДиадок.Логин = ДанныеАвторизации.ЛогинДД;
	ДанныеАвторизацииДиадок.Пароль = ДанныеАвторизации.ПарольДД;
	
	Попытка
		Ответ = МодульОбъектаКлиент().КонтурДиадокAPI_Авторизоваться(ДанныеАвторизацииДиадок);
		Результат.Успешно = Истина;
	Исключение
		Результат.ОписаниеОшибки = ОписаниеОшибки();	
	КонецПопытки;
	
	ОбновитьДанныеАвторизации("ЛогинПарольДДПроверен", Истина);
	ОбновитьДанныеАвторизации("ВалидацияЛогинаПароляДДПройдена", Результат.Успешно);
	
	Возврат Результат; 
	
КонецФункции

&НаКлиенте
Функция ПолучитьИнформациюОбМЧДДиадок(ДанныеАвторизации, ИдентификаторЯщикаДиадок, ИдентификаторСообщения, ИдентификаторМЧД) Экспорт
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_ИнформацияДоверенности(ДанныеАвторизацииДиадок, ИдентификаторЯщикаДиадок, ИдентификаторСообщения, ИдентификаторМЧД, Истина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция УзнатьСостояниепоСФ(ЗНАЧ Организация,ЗНАЧ BoxId,ЗНАЧ MessageId, ИдентификаторыДоверенностей = Неопределено) Экспорт
	
	СтруктураРезультата = ИнициализироватьСтруктуруРезультатаФункции();
	ИнициализироватьДанныеАвторизации(Организация);
	
	Если ДанныеАвторизации = Неопределено Тогда
		// не удалось получить данные авторизации
		Возврат СтруктураРезультата;
	КонецЕсли;
	
	Если (ПропускЛогинаПароляДДПоОрганизации(Организация)
		И Не СертификатПоОрганизацииНазначен(Организация))
		ИЛИ (ПропускЛогинаПароляДДПоОрганизации(Организация)
		И ПропускСертификатаПоОрганизации(Организация)) Тогда
		// не удалось авторизоваться с указанными данными
		Возврат СтруктураРезультата;
	КонецЕсли;
	
	Если СертификатПоОрганизацииНазначен(Организация)
		И Не ДанныеАвторизации.СертификатПроверен Тогда
		
		ОбновитьДанныеАвторизации("ТипАвторизации", "Сертификат");
		РезультатПроверкиСертификата = Новый Структура("Успешно, ОписаниеОшибки");
		
		ПарольКонтейнера = "";
		РезультатПроверки = ПроверитьВыбранныйСертификат(ДанныеАвторизации.Организация, ДанныеАвторизации.Отпечаток, ДанныеАвторизации.Расположение, ДанныеАвторизации.СертификатДействуетПо, ПарольКонтейнера);
		
		Если РезультатПроверки.Успешно = Ложь
			И ОшибкаНеправильныйПарольКонтейнера(РезультатПроверки.ОписаниеОшибки) Тогда
			
			ПарольКонтейнера = ПолучитьПарольКонтейнераСертификатаСервер(ДанныеАвторизации.Организация, ДанныеАвторизации.Отпечаток);
			РезультатПроверки = ПроверитьВыбранныйСертификат(ДанныеАвторизации.Организация, ДанныеАвторизации.Отпечаток, ДанныеАвторизации.Расположение, ДанныеАвторизации.СертификатДействуетПо, ПарольКонтейнера);
			
		КонецЕсли;
		
		ОбновитьДанныеАвторизации("СертификатПроверен", Истина);
		
		Если РезультатПроверки.Успешно = Истина Тогда
			ОбновитьДанныеАвторизации("ПарольКонтейнера", ПарольКонтейнера);
			ОбновитьДанныеАвторизации("ВалидацияСертификатаПройдена", Истина);
		Иначе
			ОбновитьДанныеАвторизации("ВалидацияСертификатаПройдена", Ложь);
		КонецЕсли;
		
		РезультатПроверкиСертификата.Успешно = РезультатПроверки.Успешно;
		РезультатПроверкиСертификата.ОписаниеОшибки = РезультатПроверки.ОписаниеОшибки;
		
	КонецЕсли; 
	
	Если Не (ДанныеАвторизации.СертификатПроверен = Истина И ДанныеАвторизации.ВалидацияСертификатаПройдена = Истина) Тогда
		
		ОбновитьДанныеАвторизации("ТипАвторизации", "ЛогинПароль");
		РезультатПроверкиЛогинаПароляДД = ПроверитьЛогинПарольДД(ДанныеАвторизации);
		
	КонецЕсли;
	
	Если ПропускЛогинаПароляДДПоОрганизации(Организация) Тогда 
		
		Если СертификатПоОрганизацииНазначен(Организация)
			И ПропускСертификатаПоОрганизации(Организация) Тогда
			
			СтруктураРезультата.ОписаниеОшибки = РезультатПроверкиСертификата.ОписаниеОшибки;
			
			Если ЗначениеЗаполнено(ДанныеАвторизации.СертификатДействуетПо)
				И КонецДня(ДанныеАвторизации.СертификатДействуетПо) < ТекущаяДата() Тогда
				СтруктураРезультата.ОписаниеОшибки = "Истек срок действия сертификата." + Символы.ПС + СтруктураРезультата.ОписаниеОшибки;
			КонецЕсли; 
			
			Возврат СтруктураРезультата;
			
		ИначеЕсли Не СертификатПоОрганизацииНазначен(Организация) Тогда
			
			СтруктураРезультата.ОписаниеОшибки = РезультатПроверкиЛогинаПароляДД.ОписаниеОшибки;
			Возврат СтруктураРезультата;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	СтруктураРезультата.Вставить("СтатусСФ","");    			//статусы подписей
	СтруктураРезультата.Вставить("СтатусТорг12","");
	СтруктураРезультата.Вставить("СтатусУПД","");
	
	СтруктураРезультата.Вставить("ФлагЗапросаУточненияСФ","");  //уточнений
	СтруктураРезультата.Вставить("ФлагЗапросаУточненияУПД",""); //или УКД
	
	СтруктураРезультата.Вставить("ФлагПодписанСРазногласиями", ""); //Код итога
	
	СтруктураРезультата.Вставить("СтатусАннулированияСФ","");   //аннулирований
	СтруктураРезультата.Вставить("СтатусАннулированияТорг12","");
	СтруктураРезультата.Вставить("СтатусАннулированияУПД","");
	
	СтруктураРезультата.Вставить("КомментарийКЗапросуУточнения","");  //комментариев
	СтруктураРезультата.Вставить("КомментарийКОтказуВПодписи","");
	СтруктураРезультата.Вставить("КомментарийКЗапросуАннулированияСФ","");
	СтруктураРезультата.Вставить("КомментарийКЗапросуАннулированияТорг12","");
	СтруктураРезультата.Вставить("КомментарийКЗапросуАннулированияУПД","");
	
	СтруктураДоверенностей = Новый Структура;
	СтруктураДоверенностей.Вставить("Входящие", Новый Массив);
	СтруктураДоверенностей.Вставить("Исходящие", Новый Массив);
	
	СтруктураРезультата.Вставить("МашиночитаемыеДоверенности", СтруктураДоверенностей);
	СтруктураРезультата.Вставить("ОшибкиПолученияМЧД", Новый Массив);
	
	Попытка
		Message = ПолучитьMessage(BoxId, MessageId, ДанныеАвторизации);        
		СтруктураРезультата.Успешно = Истина;
	Исключение
		СтруктураРезультата.Успешно = Ложь;
		Возврат СтруктураРезультата;
	КонецПопытки;		
	
	Для каждого Entity из Message.Entities Цикл
		Если Entity.AttachmentType = "Invoice" Тогда
			СтруктураРезультата.СтатусСФ = Entity.DocumentInfo.RecipientResponseStatus;
			СтруктураРезультата.ФлагЗапросаУточненияСФ = Entity.DocumentInfo.AmendmentRequestMetadata.AmendmentFlags;
			СтруктураРезультата.СтатусАннулированияСФ = Entity.DocumentInfo.RevocationStatus;
			Если СтруктураРезультата.СтатусАннулированияСФ = "RevocationStatusNone" Тогда 
				СтруктураРезультата.СтатусАннулированияСФ=""; //не будем никого путать этот статус проще вообще не показывать 
			КонецЕсли;
		КонецЕсли;
		Если Entity.AttachmentType = "InvoiceCorrection" Тогда
			СтруктураРезультата.СтатусСФ = Entity.DocumentInfo.RecipientResponseStatus;
			СтруктураРезультата.ФлагЗапросаУточненияСФ = Entity.DocumentInfo.AmendmentRequestMetadata.AmendmentFlags;
			СтруктураРезультата.СтатусАннулированияСФ = Entity.DocumentInfo.RevocationStatus;
			Если СтруктураРезультата.СтатусАннулированияСФ = "RevocationStatusNone" Тогда 
				СтруктураРезультата.СтатусАннулированияСФ=""; //не будем никого путать этот статус проще вообще не показывать 
			КонецЕсли;
		КонецЕсли;
		Если Entity.AttachmentType = "InvoiceRevision" Тогда
			СтруктураРезультата.СтатусСФ = Entity.DocumentInfo.RecipientResponseStatus;
			СтруктураРезультата.ФлагЗапросаУточненияСФ = Entity.DocumentInfo.InvoiceRevisionMetadata.InvoiceAmendmentFlags;
			СтруктураРезультата.СтатусАннулированияСФ = Entity.DocumentInfo.RevocationStatus;
			Если СтруктураРезультата.СтатусАннулированияСФ = "RevocationStatusNone" Тогда 
				СтруктураРезультата.СтатусАннулированияСФ=""; //не будем никого путать этот статус проще вообще не показывать 
			КонецЕсли;
		КонецЕсли;
		Если Entity.AttachmentType = "XmlTorg12" Тогда
			СтруктураРезультата.СтатусТорг12 = Entity.DocumentInfo.RecipientResponseStatus;
			СтруктураРезультата.СтатусАннулированияТорг12 = Entity.DocumentInfo.RevocationStatus;           
			Если СтруктураРезультата.СтатусАннулированияТорг12 = "RevocationStatusNone" Тогда 
				СтруктураРезультата.СтатусАннулированияТорг12=""; //не будем никого путать этот статус проще вообще не показывать 
			КонецЕсли;
		КонецЕсли;
		Если Entity.AttachmentType = "UniversalTransferDocument" Тогда
			СтруктураРезультата.СтатусУПД = Entity.DocumentInfo.RecipientResponseStatus;
			СтруктураРезультата.ФлагЗапросаУточненияУПД = Entity.DocumentInfo.AmendmentRequestMetadata.AmendmentFlags;
			СтруктураРезультата.СтатусАннулированияУПД = Entity.DocumentInfo.RevocationStatus;
			
			Если Entity.DocumentInfo.RecipientResponseStatus = "WithRecipientPartiallySignature" Тогда
				СтруктураРезультата.ФлагПодписанСРазногласиями = Истина;
			КонецЕсли;
			
			Если СтруктураРезультата.СтатусАннулированияУПД = "RevocationStatusNone" Тогда 
				СтруктураРезультата.СтатусАннулированияУПД=""; //не будем никого путать этот статус проще вообще не показывать 
			КонецЕсли;
		КонецЕсли;
		Если Entity.AttachmentType = "UniversalTransferDocumentRevision" Тогда
			СтруктураРезультата.СтатусУПД = Entity.DocumentInfo.RecipientResponseStatus;
			СтруктураРезультата.ФлагЗапросаУточненияУПД = Entity.DocumentInfo.AmendmentRequestMetadata.AmendmentFlags;
			СтруктураРезультата.СтатусАннулированияУПД = Entity.DocumentInfo.RevocationStatus;
			Если СтруктураРезультата.СтатусАннулированияУПД = "RevocationStatusNone" Тогда 
				СтруктураРезультата.СтатусАннулированияУПД=""; //не будем никого путать этот статус проще вообще не показывать 
			КонецЕсли;
		КонецЕсли;
		Если Entity.AttachmentType = "UniversalCorrectionDocument" Тогда
			СтруктураРезультата.СтатусУПД = Entity.DocumentInfo.RecipientResponseStatus;
			СтруктураРезультата.ФлагЗапросаУточненияУПД = Entity.DocumentInfo.AmendmentRequestMetadata.AmendmentFlags;
			СтруктураРезультата.СтатусАннулированияУПД = Entity.DocumentInfo.RevocationStatus;
			Если СтруктураРезультата.СтатусАннулированияУПД = "RevocationStatusNone" Тогда 
				СтруктураРезультата.СтатусАннулированияУПД=""; //не будем никого путать этот статус проще вообще не показывать 
			КонецЕсли;
		КонецЕсли;
		Если Entity.AttachmentType = "UniversalCorrectionDocumentRevision" Тогда
			СтруктураРезультата.СтатусУПД = Entity.DocumentInfo.RecipientResponseStatus;
			СтруктураРезультата.ФлагЗапросаУточненияУПД = Entity.DocumentInfo.AmendmentRequestMetadata.AmendmentFlags;
			СтруктураРезультата.СтатусАннулированияУПД = Entity.DocumentInfo.RevocationStatus;
			Если СтруктураРезультата.СтатусАннулированияУПД = "RevocationStatusNone" Тогда 
				СтруктураРезультата.СтатусАннулированияУПД=""; //не будем никого путать этот статус проще вообще не показывать 
			КонецЕсли;
		КонецЕсли;
		//здесь ищем сами сущности корректировок чтобы прочитать из них комментарий
		Если Entity.AttachmentType = "InvoiceCorrectionRequest" Тогда
			СтруктураРезультата.КомментарийКЗапросуУточнения = ПрочитатьКомментарийКЗапросу(BoxId, MessageId, Entity.EntityId, ДанныеАвторизации, "ТекстУведУточ");
		КонецЕсли;  
		
		Если Entity.AttachmentType = "UniversalMessage" 
			И Entity.UniversalMessageInfo.CodeGroup = "AmendmentRequest"
			И Entity.UniversalMessageInfo.Свойство("Events")
			И ТипЗнч(Entity.UniversalMessageInfo.Events) = Тип("Массив") Тогда  
			СтруктураРезультата.КомментарийКЗапросуУточнения = ВернутьКомментарийИзУниверсальногоСообщения(Entity.UniversalMessageInfo.Events); 
		КонецЕсли; 
		Если Entity.AttachmentType = "UniversalMessage" 
			И Entity.UniversalMessageInfo.CodeGroup = "Rejection"
			И Entity.UniversalMessageInfo.Свойство("Events")
			И ТипЗнч(Entity.UniversalMessageInfo.Events) = Тип("Массив") Тогда  
			СтруктураРезультата.КомментарийКОтказуВПодписи = ВернутьКомментарийИзУниверсальногоСообщения(Entity.UniversalMessageInfo.Events); 
		КонецЕсли;   
		
		Если Entity.AttachmentType = "XmlSignatureRejection" Тогда
			СтруктураРезультата.КомментарийКОтказуВПодписи = ПрочитатьКомментарийКЗапросу(BoxId, MessageId, Entity.EntityId, ДанныеАвторизации, "ТекстУведУточ");
		КонецЕсли;                                             
		Если Entity.AttachmentType = "RevocationRequest" Тогда
			РодительЗапросаАннулирования = ОпределитьРодителяEntity(Message.Entities,Entity);
			КомментарийКЗапросуАннулирования = ПрочитатьКомментарийКЗапросу(BoxId, MessageId, Entity.EntityId, ДанныеАвторизации, "ТекстПредАн");
			Если РодительЗапросаАннулирования.AttachmentType = "Invoice" Тогда
				СтруктураРезультата.КомментарийКЗапросуАннулированияСФ = КомментарийКЗапросуАннулирования;
			ИначеЕсли РодительЗапросаАннулирования.AttachmentType = "XmlTorg12" Тогда
				СтруктураРезультата.КомментарийКЗапросуАннулированияТОРГ12 = КомментарийКЗапросуАннулирования;
			ИначеЕсли РодительЗапросаАннулирования.AttachmentType = "UniversalTransferDocument" Тогда
				СтруктураРезультата.КомментарийКЗапросуАннулированияУПД = КомментарийКЗапросуАннулирования;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ИдентификаторыДоверенностей = Неопределено
		И ПеременнаяСодержитСвойство(ИдентификаторыДоверенностей, "Входящие") 
		И ПеременнаяСодержитСвойство(ИдентификаторыДоверенностей, "Исходящие") Тогда
		
		Для каждого ВходящийИдентификатор Из ИдентификаторыДоверенностей.Входящие Цикл
			Попытка
				МашиночитаемаяДоверенность = ПолучитьИнформациюОбМЧДДиадок(ДанныеАвторизации, BoxId, MessageId, ВходящийИдентификатор);		
				СтруктураРезультата.МашиночитаемыеДоверенности.Входящие.Добавить(МашиночитаемаяДоверенность);
			Исключение
				СтруктураРезультата.ОшибкиПолученияМЧД.Добавить("Доверенность " + ВходящийИдентификатор + ": " + ОписаниеОшибки());	
			КонецПопытки;
		КонецЦикла;
		
		Для каждого ИсходящийИдентификатор Из ИдентификаторыДоверенностей.Исходящие Цикл
			Попытка
				МашиночитаемаяДоверенность = ПолучитьИнформациюОбМЧДДиадок(ДанныеАвторизации, BoxId, MessageId, ИсходящийИдентификатор);		
				СтруктураРезультата.МашиночитаемыеДоверенности.Исходящие.Добавить(МашиночитаемаяДоверенность);
			Исключение
				СтруктураРезультата.ОшибкиПолученияМЧД.Добавить("Доверенность " + ИсходящийИдентификатор + ": " + ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции 

&НаКлиенте
Функция ВернутьКомментарийИзУниверсальногоСообщения(Массив)
	
	Если Массив.Количество() = 1 Тогда
		Возврат  Массив[0].PlainText;
	КонецЕсли;
	
	Результат = "";
	Для Каждого Стр Из Массив Цикл 
		Результат = Результат + Стр.PlainText + Символы.ПС; 	
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции	

&НаКлиенте
Функция ОпределитьРодителяEntity(МассивEntities,ТекEntityИзМассива)
	
	Для каждого Entity из МассивEntities Цикл
		Если ТекEntityИзМассива.ParentEntityId = Entity.EntityId Тогда 
			Возврат Entity;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // ОпределитьРодителяEntity()

&НаКлиенте
Функция СохранитьКонтентВФайл(BoxId,MessageId,EntityId,ДанныеАвторизации)
	
	мРабочийКаталог=КаталогВременныхФайлов();
	ПутьКФайлу=мРабочийКаталог+EntityId;
	ВременныйФайл = Новый Файл(ПутьКФайлу);
	Если ВременныйФайл.Существует() Тогда
		УдалитьФайлы(ВременныйФайл.ПолноеИмя);//Если такой файл уже есть в temp, значит, он остался от предыдущей сессии, когда чо-то пошло не так. Удалим его.
	КонецЕсли;
	
	Результат=СохранитьКонтентВложения(BoxId, MessageId, EntityId, ДанныеАвторизации, ПутьКФайлу);
	Результат.Вставить("ПутьКФайлу",ПутьКФайлу);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТекстФайлаКонтента(BoxId,MessageId,EntityId,ДанныеАвторизации)
	
	РезультатСохраненияКонтента=СохранитьКонтентВФайл(BoxId,MessageId,EntityId,ДанныеАвторизации);
	
	Если РезультатСохраненияКонтента.Успешно = Истина Тогда 
		//из файлика нам нужен тег <ТекстУведУточ>
		
		ТекстXML = Новый ТекстовыйДокумент;
		ТекстXML.Прочитать(РезультатСохраненияКонтента.ПутьКФайлу);
		ТекстXML = ТекстXML.ПолучитьТекст();
		
		Возврат ТекстXML;
	Иначе
		МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(РезультатСохраненияКонтента.ОписаниеОшибки);
		Возврат "Не удалось прочитать комментарий";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПрочитатьКомментарийКЗапросу(BoxId, MessageId, EntityId, ДанныеАвторизации, ТегКомментария)
	
	ТекстXML = ПолучитьТекстФайлаКонтента(BoxId, MessageId, EntityId, ДанныеАвторизации);
	
	// даже не будем загонять в XDTO
	ПозицияКомментария = Найти(ТекстXML, "<" + ТегКомментария + ">");
	Если ПозицияКомментария <> 0 Тогда
		ПозицияКомментария	= ПозицияКомментария + СтрДлина(ТегКомментария) + 2;
		ДлинаКомментария	= Найти(ТекстXML, "</" + ТегКомментария + ">") - ПозицияКомментария;
		ТекстКомментария	= Сред(ТекстXML, ПозицияКомментария, ДлинаКомментария);
		
		МодульОбъектаКлиент().xmlОбработатьЭкранируемыеСимволы(ТекстКомментария);		
		
		Возврат СокрЛП(ТекстКомментария);
	Иначе
		Возврат ?(ЗначениеЗаполнено(ТекстXML),ТекстXML,"");
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСостояниеСообщенияINVOICПоСостояниюЮЗДО(СтруктураСостояния) Экспорт
	
	Возврат ПолучитьСостояниеСообщенияINVOICПоСостояниюЮЗДОСервер(СтруктураСостояния);
	
КонецФункции

&НаСервере
Функция ПолучитьСостояниеСообщенияINVOICПоСостояниюЮЗДОСервер(СтруктураСостояния)
	
	Возврат МодульОбъекта().ПолучитьСостояниеСообщенияINVOICПоСостояниюЮЗДО(СтруктураСостояния)	
	
КонецФункции 

&НаКлиенте
Процедура СброситьПроверкиДанныхАвторизации() Экспорт
	
	Для каждого Строка Из ТаблицаАвторизации Цикл
		
		Строка.ЛогинПарольДДПроверен 			= Ложь;
		Строка.СертификатПроверен 				= Ложь;
		Строка.ВалидацияЛогинаПароляДДПройдена 	= Ложь;
		Строка.ВалидацияСертификатаПройдена 	= Ложь;
		Строка.ВалидацияДоверенностиПройдена 	= Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьПарольКонтейнераДанныхАвторизации() Экспорт
	
	ОбновитьДанныеАвторизации("ПарольКонтейнера", "");
	
	Для каждого Строка Из ТаблицаАвторизации Цикл
		Строка.ПарольКонтейнера	= "";
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьСчетаФактуры()
	
	мРабочийКаталог = КаталогВременныхФайлов();
	Прогресс = 0;
	Всего = СчетаФактурыНаПодписание.Количество();
	
	МассивПодписанныхСчетФактур = Новый Массив;
	
	Для Каждого СтрокаСчетФактура Из СчетаФактурыНаПодписание Цикл
		
		Прогресс = Прогресс + 1;
		ТекПроцент = Цел((Прогресс * 100 / Всего)); 
		Состояние("Подписание в Диадок: " + Прогресс + " из " + Всего, ТекПроцент);
		
		Отказ = Ложь;
		НазначенныеДанныеАвторизации = Новый_НазначенныеДанныеАвторизации(СтрокаСчетФактура, Отказ);
		
		Если Отказ = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		MessageId = СтрокаСчетФактура.MessageId;
		BoxId 	  = СтрокаСчетФактура.BoxId;
		
		СчетФактураСсылка = СтрокаСчетФактура.Ссылка;
		
		operationID = ПолучитьИлиСоздать_Diadoc_operationID(СчетФактураСсылка);		
		
		Попытка
			Message = ПолучитьMessage(BoxId, MessageId, НазначенныеДанныеАвторизации);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЗафиксироватьОшибку_НеУдалосьПолучитьДокументыДляПодписанияСчетФактуры(СтрокаСчетФактура, ОписаниеОшибки);
			Продолжить;
		КонецПопытки;
		
		ЭтоЧерновик 			  = Message.IsDraft; 
		СтрокаСчетФактура.IsDraft = ЭтоЧерновик;
		
		Попытка
			PrepareDocumentsToSignResponse = ПолучитьPatchedEntities(Message, BoxId, MessageId, НазначенныеДанныеАвторизации, ЭтоЧерновик);
		Исключение                                                                         
			ОписаниеОшибки = ОписаниеОшибки();
			ЗафиксироватьОшибку_НеУдалосьЗаполнитьПодписанта(СтрокаСчетФактура, ОписаниеОшибки);
			Продолжить;
		КонецПопытки;
		
		Если НЕ ЭтоЧерновик Тогда
			
			MessagePatchToPost = МодульОбъектаКлиент().КонтурДиадокAPI_СоздатьПоСхеме("MessagePatchToPostV2");
			
			MessagePatchToPost.BoxId 	 = BoxId;
			MessagePatchToPost.MessageId = MessageId;
			
			PowerOfAttorneyToPost = PowerOfAttorneyToPost(НазначенныеДанныеАвторизации);	
			
			Для Каждого DocumentPatchedContent Из PrepareDocumentsToSignResponse.DocumentPatchedContents Цикл
				
				Content = DocumentPatchedContent.Content;
				Контент = Base64Значение(Content);
				
				Попытка
					Подпись = ПодписатьКонтент(Контент, НазначенныеДанныеАвторизации);				
				Исключение
					ОписаниеОшибки = ОписаниеОшибки();
					ЗафиксироватьОшибку_НеУдалосьПодписатьСчетФактуру(СтрокаСчетФактура, ОписаниеОшибки);
					Продолжить;
				КонецПопытки;
				
				DocumentSignature = МодульОбъектаКлиент().КонтурДиадокAPI_СоздатьПоСхеме("DocumentSignature");
				
				DocumentSignature.ParentEntityId 	= DocumentPatchedContent.DocumentId.EntityId;
				DocumentSignature.Signature 	 	= Подпись;
				DocumentSignature.PatchedContentId 	= DocumentPatchedContent.PatchedContentId; 
				DocumentSignature.PowerOfAttorney  	= PowerOfAttorneyToPost; 
				
				MessagePatchToPost.Signatures.Добавить(DocumentSignature);
				
			КонецЦикла;
			
			Попытка
				MessagePatch = PostMessagePatch(MessagePatchToPost, operationID, НазначенныеДанныеАвторизации);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ЗафиксироватьОшибку_НеУдалосьОтправитьДокумент(СтрокаСчетФактура, ОписаниеОшибки);
				Продолжить;
			КонецПопытки;
			
			
			// ?
			СтрокаСчетФактура.MessageId_new						= MessagePatch.MessageId;
			СтрокаСчетФактура.invoiceId_new						= СтрокаСчетФактура.invoiceId;
			СтрокаСчетФактура.UniversalTransferDocumentId_new	= СтрокаСчетФактура.UniversalTransferDocumentId;
			СтрокаСчетФактура.torg12Id_new						= СтрокаСчетФактура.torg12Id;
			
			СтруктураПодписанныхСчетФактур = Новый Структура("Ссылка, messageId_new, torg12Id_new, invoiceId_new, UniversalTransferDocumentId_new, isDraft");
			ЗаполнитьЗначенияСвойств(СтруктураПодписанныхСчетФактур, СтрокаСчетФактура);
			МассивПодписанныхСчетФактур.Добавить(СтруктураПодписанныхСчетФактур); 
			
		Иначе
			
			DraftToSend = МодульОбъектаКлиент().КонтурДиадокAPI_СоздатьПоСхеме("DraftToSend");
			
			DraftToSend.BoxId 	= BoxId;
			DraftToSend.DraftId = MessageId;
			
			PowerOfAttorneyToPost = PowerOfAttorneyToPost(НазначенныеДанныеАвторизации);	
			
			Для Каждого DocumentPatchedContent Из PrepareDocumentsToSignResponse.DocumentPatchedContents Цикл
				
				Content = DocumentPatchedContent.Content;
				Контент = Base64Значение(Content);
				
				Подпись = ПодписатьКонтент(Контент, НазначенныеДанныеАвторизации);				
				
				DocumentSenderSignature = МодульОбъектаКлиент().КонтурДиадокAPI_СоздатьПоСхеме("DocumentSenderSignature");
				
				DocumentSenderSignature.ParentEntityId 		= DocumentPatchedContent.DocumentId.EntityId;
				DocumentSenderSignature.Signature 	 		= Подпись;
				DocumentSenderSignature.PatchedContentId 	= DocumentPatchedContent.PatchedContentId; 
				DocumentSenderSignature.PowerOfAttorney  	= PowerOfAttorneyToPost; 
				
				DraftToSend.DocumentSignatures.Добавить(DocumentSenderSignature);
				
			КонецЦикла;
			
			Попытка
				Message = ОтправитьSendDraft(DraftToSend, НазначенныеДанныеАвторизации, operationID);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ЗафиксироватьОшибку_НеУдалосьОтправитьДокумент(СтрокаСчетФактура, ОписаниеОшибки);
				Продолжить;
			КонецПопытки;
			
			
			// ? 
			СтрокаСчетФактура.MessageId_new = Message.MessageId;
			
			Для Каждого Entity из Message.Entities Цикл
				Если Entity.AttachmentType = "Invoice" или Entity.AttachmentType="InvoiceCorrection" Тогда 
					СтрокаСчетФактура.InvoiceId_new = Entity.EntityId;
				ИначеЕсли Entity.AttachmentType="XmlTorg12" Тогда 
					СтрокаСчетФактура.torg12Id_new = Entity.EntityId;
				ИначеЕсли Entity.AttachmentType = "UniversalTransferDocument" или Entity.AttachmentType = "UniversalTransferDocumentRevision" Тогда 
					СтрокаСчетФактура.UniversalTransferDocumentId_new = Entity.EntityId;
				ИначеЕсли Entity.AttachmentType = "UniversalCorrectionDocument" или Entity.AttachmentType = "UniversalCorrectionDocumentRevision" Тогда 
					СтрокаСчетФактура.UniversalTransferDocumentId_new = Entity.EntityId;
				КонецЕсли;
			КонецЦикла;
			
			СтруктураПодписанныхСчетФактур = Новый Структура("Ссылка, messageId_new, torg12Id_new, invoiceId_new, UniversalTransferDocumentId_new, isDraft");
			ЗаполнитьЗначенияСвойств(СтруктураПодписанныхСчетФактур, СтрокаСчетФактура);
			МассивПодписанныхСчетФактур.Добавить(СтруктураПодписанныхСчетФактур);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВыполнитьОбработкуПодписанныхДокументов_КонтурEDI(МассивПодписанныхСчетФактур);
	
	Состояние("Подписание в Диадок: завершено");
	
КонецПроцедуры 

&НаКлиенте
Функция Новый_НазначенныеДанныеАвторизации(СчетФактура, Отказ)
	
	СтруктураСобытия = СобытиеСертификаты_НазначитьСертификат(СчетФактура);
	
	Если СтруктураСобытия.Переопределено Тогда 
		
		НазначенныеДанныеАвторизации = ПолучитьСтруктуруДанныхАвторизации();
		НазначенныеДанныеАвторизации.Организация = СтруктураСобытия.Организация;
		НазначенныеДанныеАвторизации.Отпечаток = СтруктураСобытия.Сертификат.Отпечаток;
		НазначенныеДанныеАвторизации.ПарольКонтейнера = СтруктураСобытия.Сертификат.Пароль;
		НазначенныеДанныеАвторизации.Расположение = СтруктураСобытия.Сертификат.Расположение;
		НазначенныеДанныеАвторизации.ТребуетсяДоверенность = СтруктураСобытия.Доверенность.ИспользоватьПоУмолчанию;
		НазначенныеДанныеАвторизации.ТипАвторизации = "Сертификат";
		
		СтруктураСобытия.Доверенность.Вставить("ДвоичныеДанныеДоверенности", СтруктураСобытия.ДвоичныеДанныеДоверенности);
		СтруктураСобытия.Доверенность.Вставить("ДвоичныеДанныеПодписи", СтруктураСобытия.ДвоичныеДанныеПодписи);
		
		НазначенныеДанныеАвторизации.Доверенность = СтруктураСобытия.Доверенность;
		
	Иначе 
		
		Если НЕ СчетФактура.Организация = ДанныеАвторизации.Организация Тогда
			ИнициализироватьДанныеАвторизации(СчетФактура.Организация);
		КонецЕсли;
		
		НазначенныеДанныеАвторизации = ДанныеАвторизации;
		
		Если ПропускСертификатаПоОрганизации(СчетФактура.Организация) Тогда
			Отказ = Истина;
			Возврат НазначенныеДанныеАвторизации;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НазначенныеДанныеАвторизации.Доверенность) Тогда
		СпособПередачиМашиночитаемойДоверенности = СпособПередачиМашиночитаемойДоверенности(СчетФактура.Ссылка);
		НазначенныеДанныеАвторизации.Вставить("СпособПередачиДоверенности", СпособПередачиМашиночитаемойДоверенности);
	КонецЕсли;
	
	ЕстьДоверенностьПоУмолчаниюВДиадок = ЗначениеЗаполнено(ДоверенностьПоУмолчанию(НазначенныеДанныеАвторизации));
	НазначенныеДанныеАвторизации.Вставить("ЕстьДоверенностьПоУмолчаниюВДиадок", ЕстьДоверенностьПоУмолчаниюВДиадок);	
	
	Возврат НазначенныеДанныеАвторизации;
	
КонецФункции

&НаКлиенте
Функция ПодписатьКонтент(Контент, ДанныеАвторизации)
	
	АдресФайлаДляПодписи = ПоместитьВоВременноеХранилище(Контент, Новый УникальныйИдентификатор);
	
	Для Сч = 1 По 2 Цикл
		
		Если ДанныеАвторизации.Расположение = "сервер" Тогда
			РезультатПодписания = ПолучитьПодписьФайлаДокументаНаСервере(АдресФайлаДляПодписи, ДанныеАвторизации);
		Иначе	
			РезультатПодписания = ПолучитьПодписьФайлаДокументаНаКлиенте(АдресФайлаДляПодписи, ДанныеАвторизации.Отпечаток, ДанныеАвторизации.ПарольКонтейнера);
		КонецЕсли;	
		
		Если ОбработкаИсключенияТипМодуляКриптографии(РезультатПодписания.ОписаниеОшибки, ДанныеАвторизации) Тогда
			Продолжить; // еще раз, уже с нужным типом модуля криптографии
		Иначе
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;
	
	Если РезультатПодписания.Успешно = Истина Тогда
		Возврат РезультатПодписания.ШифрованнаяПодпись;
	Иначе
		ВызватьИсключение РезультатПодписания.ОписаниеОшибки;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗафиксироватьОшибку_НеУдалосьПолучитьДокументыДляПодписанияСчетФактуры(СтрокаСчетФактура, ОписаниеОшибки)
	
	ТекстСообщения = "Не удалось получить документы из Диадок для подписания
	|	Документ 	- " + СтрокаСчетФактура.ДокументПредставление + "
	|	Организация	- " + СтрокаСчетФактура.Организация + "
	|	boxId		- " + СтрокаСчетФактура.boxId + "
	|	messageId	- " + СтрокаСчетФактура.MessageId + "
	|Подробная информация - " + ОписаниеОшибки;
	МодульОбъектаКлиент().ЗаписьЖурналаРегистрацииНаКлиенте_КонтурEDI("Ошибка", ТекстСообщения);
	МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьОшибку_НеУдалосьПолучитьДокументыДляФормированияИзвещений(СтрокаСчетФактура, ОписаниеОшибки)
	
	ТекстСообщения = "Не удалось получить документы из Диадок для формирования извещени
	|	Документ 	- " + СтрокаСчетФактура.ДокументПредставление + "
	|	Организация	- " + СтрокаСчетФактура.Организация + "
	|	boxId		- " + СтрокаСчетФактура.boxId + "
	|	messageId	- " + СтрокаСчетФактура.MessageId + "
	|Подробная информация - " + ОписаниеОшибки;
	МодульОбъектаКлиент().ЗаписьЖурналаРегистрацииНаКлиенте_КонтурEDI("Ошибка", ТекстСообщения);
	МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(ТекстСообщения);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗафиксироватьОшибку_НеУдалосьСформироватьИзвещения(СтрокаСчетФактура, ОписаниеОшибки)
	
	ТекстСообщения = "Не удалось сформировать извещения по причине:
	|	Документ 	- " + СтрокаСчетФактура.ДокументПредставление + "
	|	Организация	- " + СтрокаСчетФактура.Организация + "
	|	boxId		- " + СтрокаСчетФактура.boxId + "
	|	messageId	- " + СтрокаСчетФактура.MessageId + "
	|Подробная информация - " + ОписаниеОшибки; 
	МодульОбъектаКлиент().ЗаписьЖурналаРегистрацииНаКлиенте_КонтурEDI("Ошибка", ТекстСообщения);
	МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьОшибку_НеУдалосьПодписатьИзвещения(СтрокаСчетФактура, ОписаниеОшибки)
	
	ТекстСообщения = "Не удалось подписать извещения по причине:
	|	Документ 	- " + СтрокаСчетФактура.ДокументПредставление + "
	|	Организация	- " + СтрокаСчетФактура.Организация + "
	|	boxId		- " + СтрокаСчетФактура.boxId + "
	|	messageId	- " + СтрокаСчетФактура.MessageId + "
	|Подробная информация - " + ОписаниеОшибки;
	МодульОбъектаКлиент().ЗаписьЖурналаРегистрацииНаКлиенте_КонтурEDI("Ошибка", ТекстСообщения);
	МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьОшибку_НеУдалосьОтправитьИзвещения(СтрокаСчетФактура, ОписаниеОшибки)
	
	ТекстСообщения = "Не удалось отправить извещения по причине:
	|	Документ 	- " + СтрокаСчетФактура.ДокументПредставление + "
	|	Организация	- " + СтрокаСчетФактура.Организация + "
	|	boxId		- " + СтрокаСчетФактура.boxId + "
	|	messageId	- " + СтрокаСчетФактура.MessageId + "
	|Подробная информация - " + ОписаниеОшибки; 
	МодульОбъектаКлиент().ЗаписьЖурналаРегистрацииНаКлиенте_КонтурEDI("Ошибка", ТекстСообщения);
	МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьОшибку_НеУдалосьЗаполнитьПодписанта(СтрокаСчетФактура, ОписаниеОшибки)
	
	ТекстСообщения = "Не удалось заполнить подписанта в документе
	|	Документ 	- " + СтрокаСчетФактура.ДокументПредставление + "
	|	Организация	- " + СтрокаСчетФактура.Организация + "
	|	boxId		- " + СтрокаСчетФактура.boxId + "
	|	messageId	- " + СтрокаСчетФактура.MessageId + "
	|Подробная информация - " + ОписаниеОшибки + "
	|";
	Пояснение = "Возможно, необходимо заполнить раздел ""Сертификаты и полномочия"" в настройках сотрудника в Диадоке:
	|" + ДиадокВебСервер_Сервер() + "/" + СтрокаСчетФактура.boxId + "/EmployeesList
	|";
	МодульОбъектаКлиент().ЗаписьЖурналаРегистрацииНаКлиенте_КонтурEDI("Ошибка", ТекстСообщения+Пояснение);
	МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(ТекстСообщения);
	МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(Пояснение)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьОшибку_НеУдалосьПодписатьСчетФактуру(СтрокаСчетФактура, ОписаниеОшибки)
	
	ТекстСообщения = "Не удалось подписать счет фактуру по причине:
	|	Документ 	- " + СтрокаСчетФактура.ДокументПредставление + "
	|	Организация	- " + СтрокаСчетФактура.Организация + "
	|	boxId		- " + СтрокаСчетФактура.boxId + "
	|	messageId	- " + СтрокаСчетФактура.MessageId + "
	|Подробная информация - " + ОписаниеОшибки + "
	|";
	Пояснение = "Возможно, необходимо заполнить раздел ""Сертификаты и полномочия"" в настройках сотрудника в Диадоке:
	|" + ДиадокВебСервер_Сервер() + "/" + СтрокаСчетФактура.boxId + "/EmployeesList
	|";
	МодульОбъектаКлиент().ЗаписьЖурналаРегистрацииНаКлиенте_КонтурEDI("Ошибка", ТекстСообщения+Пояснение);
	МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(ТекстСообщения);
	МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(Пояснение)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьОшибку_НеУдалосьОтправитьДокумент(СтрокаСчетФактура, ОписаниеОшибки)
	
	ТекстСообщения = "Не удалось отправить документ в Диадок
	|	Документ 	- " + СтрокаСчетФактура.ДокументПредставление + "
	|	Организация - " + СтрокаСчетФактура.Организация + "
	|	boxId 		- " + СтрокаСчетФактура.boxId + "
	|	messageId 	- " + СтрокаСчетФактура.MessageId + "
	|Подробная информация - " + ОписаниеОшибки;
	МодульОбъектаКлиент().ЗаписьЖурналаРегистрацииНаКлиенте_КонтурEDI("Ошибка", ТекстСообщения);
	МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Функция СпособПередачиМашиночитаемойДоверенности(СчетаФактурыНаПодписание)
	
	Возврат МодульОбъекта().СпособПередачиМашиночитаемойДоверенности(СчетаФактурыНаПодписание.Партнер);
	
КонецФункции

&НаСервере
Функция ПолучитьИлиСоздать_Diadoc_operationID(СчетФактураСсылка)
	Возврат МодульОбъекта().ПолучитьИлиСоздать_Diadoc_operationID(СчетФактураСсылка)
КонецФункции 

&НаСервере 
Процедура ВыполнитьОбработкуПодписанныхДокументов_КонтурEDI(МассивПодписанныхСчетФактур) 
	
	Для Каждого ПодписаннаяСчетФактура Из МассивПодписанныхСчетФактур Цикл 
		
		СменитьСтатусСообщенияНаПодписанВДиадок = (ПодписаннаяСчетФактура.isDraft = Ложь);
		
		Если ЗначениеЗаполнено(ПодписаннаяСчетФактура.messageId_new) Тогда 
			МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(ПодписаннаяСчетФактура.Ссылка.Документ, "messageId", ПодписаннаяСчетФактура.messageId_new);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодписаннаяСчетФактура.torg12Id_new) Тогда 
			МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(ПодписаннаяСчетФактура.Ссылка.Документ, "torg12Id", ПодписаннаяСчетФактура.torg12Id_new);	
			СменитьСтатусСообщенияНаПодписанВДиадок = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодписаннаяСчетФактура.invoiceId_new) Тогда 
			МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(ПодписаннаяСчетФактура.Ссылка.Документ, "invoiceId", ПодписаннаяСчетФактура.invoiceId_new);	
			СменитьСтатусСообщенияНаПодписанВДиадок = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодписаннаяСчетФактура.UniversalTransferDocumentId_new) Тогда 
			МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(ПодписаннаяСчетФактура.Ссылка.Документ, "UniversalTransferDocumentId", ПодписаннаяСчетФактура.UniversalTransferDocumentId_new);	
			СменитьСтатусСообщенияНаПодписанВДиадок = Истина;
		КонецЕсли;
		
		Если СменитьСтатусСообщенияНаПодписанВДиадок Тогда 
			
			СвойстваДляЗаписи = Новый Структура("isDraft, DraftOfDocumentPackageSignedByMe", ПодписаннаяСчетФактура.isDraft, Истина);
			
			МодульОбъекта().ЗаписатьДопРеквизитСправочника_КонтурEDI(ПодписаннаяСчетФактура.Ссылка, СвойстваДляЗаписи);
			
			МодульОбъекта().УстановитьСтатусСообщения(ПодписаннаяСчетФактура.Ссылка,  , "INVOIC", "ИсходящийПодписанВДиадок");
			
			МодульОбъекта().ПроставитьПризнакОтправкиALCRPT_ПослеПодписанияВДиадок(ПодписаннаяСчетФактура.Ссылка.Документ, ПодписаннаяСчетФактура.Ссылка.Партнер);
			
		Иначе
			СообщениеОбъект        = ПодписаннаяСчетФактура.Ссылка.ПолучитьОбъект();
			СообщениеОбъект.Статус = "Ожидает отправки";
			МодульОбъекта().СохранитьОбъектСообщения(СообщениеОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПодписьКонтентаMessagePatchToPost(MessagePatchToPost,ДанныеАвторизации)
	
	Успешно = Истина;
	
	Signatures = Неопределено;
	Если MessagePatchToPost.Свойство("Signatures", Signatures) Тогда
		ПодписаниеУспешно = ПодписатьКонтентSignatures(Signatures, ДанныеАвторизации);
		Успешно = Успешно И ПодписаниеУспешно;
	КонецЕсли;
	
	RequestedSignatureRejections = Неопределено;
	Если MessagePatchToPost.Свойство("RequestedSignatureRejections", RequestedSignatureRejections) Тогда
		ПодписаниеУспешно = ПодписатьКонтентRequestedSignatureRejections(RequestedSignatureRejections, ДанныеАвторизации);
		Успешно = Успешно И ПодписаниеУспешно;
	КонецЕсли;
	
	Возврат Успешно;	
	
КонецФункции

&НаКлиенте
Функция ПодписатьКонтентRequestedSignatureRejections(RequestedSignatureRejections,ДанныеАвторизации)
	
	Успешно = Истина;
	
	Для Каждого RequestedSignatureRejection Из RequestedSignatureRejections Цикл
		
		Если Не RequestedSignatureRejection.SignedContent.Signature = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКФайлу = RequestedSignatureRejection.SignedContent.ПутьКФайлу;
		ФайлДляПодписи = Новый ДвоичныеДанные(ПутьКФайлу);
		АдресФайлаДляПодписи = ПоместитьВоВременноеХранилище(ФайлДляПодписи, Новый УникальныйИдентификатор);
		
		Для Сч = 1 По 2 Цикл
			
			Если ДанныеАвторизации.Расположение = "сервер" Тогда
				РезультатПодписания = ПолучитьПодписьФайлаДокументаНаСервере(АдресФайлаДляПодписи, ДанныеАвторизации);
			Иначе
				РезультатПодписания = ПолучитьПодписьФайлаДокументаНаКлиенте(ПутьКФайлу, ДанныеАвторизации.Отпечаток, ДанныеАвторизации.ПарольКонтейнера);
			КонецЕсли;	
			
			Если ОбработкаИсключенияТипМодуляКриптографии(РезультатПодписания.ОписаниеОшибки, ДанныеАвторизации) Тогда
				Продолжить; // еще раз, уже с нужным типом модуля криптографии
			Иначе
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;		
		
		Если НЕ РезультатПодписания.Успешно Тогда
			Возврат Ложь;	
		КонецЕсли;
		
		RequestedSignatureRejection.SignedContent.Signature = РезультатПодписания.ШифрованнаяПодпись;
		
	КонецЦикла;
	
	Возврат Успешно;	
	
КонецФункции

&НаКлиенте
Функция ПодписатьКонтентSignatures(Signatures,ДанныеАвторизации)
	
	Успешно = Истина;
	
	Для Каждого DocumentSignature Из Signatures Цикл
		
		Если Не DocumentSignature.Signature = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКФайлу = DocumentSignature.ПутьКФайлу;
		ФайлДляПодписи = Новый ДвоичныеДанные(ПутьКФайлу);
		АдресФайлаДляПодписи = ПоместитьВоВременноеХранилище(ФайлДляПодписи, Новый УникальныйИдентификатор);
		
		Для Сч = 1 По 2 Цикл
			
			Если ДанныеАвторизации.Расположение = "сервер" Тогда
				РезультатПодписания = ПолучитьПодписьФайлаДокументаНаСервере(АдресФайлаДляПодписи, ДанныеАвторизации);
			Иначе	
				РезультатПодписания = ПолучитьПодписьФайлаДокументаНаКлиенте(ПутьКФайлу, ДанныеАвторизации.Отпечаток, ДанныеАвторизации.ПарольКонтейнера);
			КонецЕсли;	
			
			Если ОбработкаИсключенияТипМодуляКриптографии(РезультатПодписания.ОписаниеОшибки, ДанныеАвторизации) Тогда
				Продолжить; // еще раз, уже с нужным типом модуля криптографии
			Иначе
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;
		
		Если НЕ РезультатПодписания.Успешно Тогда
			Возврат Ложь;	
		КонецЕсли;
		
		DocumentSignature.Signature = РезультатПодписания.ШифрованнаяПодпись;
		
	КонецЦикла;
	
	Возврат Успешно;	
	
КонецФункции

&НаКлиенте   
Функция ПолучитьСтруктуруMessagePatchToPost(Message,BoxId,MessageId,ДанныеАвторизации,PatchedEntities)
	
	РезультатПолученияMessagePatchToPost = Новый Структура("Успешно, MessagePatchToPost", Истина,  Новый Структура);
	
	Если Message = Неопределено Тогда
		
		РезультатПолученияMessagePatchToPost.Успешно = Ложь;
		
		Возврат РезультатПолученияMessagePatchToPost;
		
	КонецЕсли;
	
	РезультатSignatures = ПолучитьМассивСтруктурSignatures(BoxId, Message, ДанныеАвторизации, PatchedEntities);
	
	Если РезультатSignatures.Успешно Тогда
		
		Signatures = РезультатSignatures.МассивСтруктур;
		
		РезультатПолученияMessagePatchToPost.MessagePatchToPost.Вставить("BoxId", 		BoxId);
		РезультатПолученияMessagePatchToPost.MessagePatchToPost.Вставить("MessageId", 	MessageId);
		РезультатПолученияMessagePatchToPost.MessagePatchToPost.Вставить("Signatures", 	Signatures);
		
	Иначе
		
		РезультатПолученияMessagePatchToPost.Успешно = Ложь;
		Сообщить(РезультатSignatures.ТекстОшибки);
		
	КонецЕсли;
	
	Возврат РезультатПолученияMessagePatchToPost;
	
КонецФункции

&НаКлиенте
Функция СущностьНеЯвляетсяФайломДанныхИлиПечатнойФормой(Entity)
	
	Результат = Истина;
	
	Если Entity.EntityType = "Attachment" Тогда
		Если ( Entity.AttachmentType = "ReconciliationAct" ) или ( Entity.AttachmentType = "Nonformalized" ) Тогда
			Результат = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьМассивСтруктурSignatures(BoxId, Message, ДанныеАвторизации, PatchedEntities)
	
	Результат = Новый Структура("Успешно,МассивСтруктур,ТекстОшибки", Истина, Неопределено, "");
	
	Entities = Message.Entities;
	Для Каждого PatchedEntity Из PatchedEntities Цикл
		
		MessageId = Message.MessageId;
		EntityId = PatchedEntity.DocumentId.EntityId;
		ПутьКФайлу = мРабочийКаталог+Message.MessageId + "_" + PatchedEntity.DocumentId.EntityId;
		
		Если PatchedEntity.Свойство("Content") и ТипЗнч(PatchedEntity.Content) = Тип("Строка") Тогда
			РезультатСохранения = ЗакодированныеДвоичныеДанныеВФайл(PatchedEntity.Content, "base64", ПутьКФайлу);
		Иначе
			РезультатСохранения = СохранитьКонтентВложения(BoxId, MessageId, PatchedEntity.DocumentId.EntityId, ДанныеАвторизации, ПутьКФайлу);
		КонецЕсли;
		
		Если Не РезультатСохранения.Успешно Тогда
			Возврат Неопределено;
		КонецЕсли;  		
		
		DocumentSignature = Новый Структура;
		DocumentSignature.Вставить("ParentEntityId", 			PatchedEntity.DocumentId.EntityId);
		DocumentSignature.Вставить("ПутьКФайлу",				ПутьКФайлу);
		DocumentSignature.Вставить("АдресАрхиваВоВХ",			Неопределено);
		
		ПутьКФайлуПодписи = DocumentSignature.ПутьКФайлу;
		ФайлДляПодписи = Новый ДвоичныеДанные(ПутьКФайлу);
		АдресФайлаДляПодписи = ПоместитьВоВременноеХранилище(ФайлДляПодписи, Новый УникальныйИдентификатор);
		
		Для Сч = 1 По 2 Цикл
			
			Если ДанныеАвторизации.Расположение = "сервер" Тогда
				РезультатПодписания = ПолучитьПодписьФайлаДокументаНаСервере(АдресФайлаДляПодписи, ДанныеАвторизации);
			Иначе	
				РезультатПодписания = ПолучитьПодписьФайлаДокументаНаКлиенте(ПутьКФайлуПодписи, ДанныеАвторизации.Отпечаток, ДанныеАвторизации.ПарольКонтейнера);
			КонецЕсли;	
			
			Если ОбработкаИсключенияТипМодуляКриптографии(РезультатПодписания.ОписаниеОшибки, ДанныеАвторизации) Тогда
				Продолжить; // еще раз, уже с нужным типом модуля криптографии
			Иначе
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;
		
		Если НЕ РезультатПодписания.Успешно Тогда
			
			Результат.Успешно = Ложь;
			Результат.ТекстОшибки = "Не удалось получить подпись для Entity " + PatchedEntity.DocumentId.EntityId; 
			
			Прервать;
			
		КонецЕсли;
		
		DocumentSignature.Вставить("Signature",					РезультатПодписания.ШифрованнаяПодпись);
		
		DocumentSignature.Вставить("SignWithTestSignature"	, 	Ложь);
		DocumentSignature.Вставить("IsApprovementSignature"	, 	Ложь);
		DocumentSignature.Вставить("SignatureNameOnShelf"	, 	Неопределено);
		DocumentSignature.Вставить("PatchedContentId"		, 	PatchedEntity.PatchedContentId);   //Entity.PatchedContentId
		
		Если Результат.МассивСтруктур = Неопределено Тогда
			Результат.МассивСтруктур = Новый Массив;
		КонецЕсли;
		
		ДобавитьИнформациюОбМЧД(DocumentSignature, ДанныеАвторизации);
		
		Результат.МассивСтруктур.Добавить(DocumentSignature);
		
	КонецЦикла;
	
	Если Результат.МассивСтруктур = Неопределено Тогда
		
		Результат.Успешно = Ложь;
		
		Если Результат.ТекстОшибки = "" Тогда
			Результат.ТекстОшибки = "Не удалось получить Signatures. Возможно не передан массив PatchedEntities.";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗакодированныеДвоичныеДанныеВФайл(ЗакодированныеДвоичныеДанные, ИмяАлгоритма, ПутьКФайлу)
	
	Результат = Новый Структура("Успешно", Ложь);
	
	Попытка
		
		Если ИмяАлгоритма = "base64" Тогда
			ДвоичныеДанные = Base64Значение(ЗакодированныеДвоичныеДанные);			
		КонецЕсли;
		
		ДвоичныеДанные.Записать(ПутьКФайлу);
		Результат.Успешно = Истина;
		
	Исключение
		
		ТекстОшибки = "Подписание ДД. Не удалось записать данные в файл - " + ОписаниеОшибки();
		МодульОбъектаКлиент().ЗаписьЖурналаРегистрацииНаКлиенте_КонтурEDI("Ошибка", ТекстОшибки);
		ВызватьИсключение ТекстОшибки;				
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОтправитьSendDraft(DraftToSend, ДанныеАвторизации, operationID = "")
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_ОтправитьСообщениеИзЧерновика(ДанныеАвторизацииДиадок, DraftToSend, operationID);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаписатьJSONВызовСервера(СтруктураВjson)
	
	Возврат МодульОбъекта().ЗаписатьJSON_(СтруктураВjson);	
	
КонецФункции

&НаКлиенте
Функция ПолучитьMessage(BoxId, MessageId, ДанныеАвторизации, ВозвращатьСодержимоеСущностей = Истина)
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_СодержимоеСообщения(ДанныеАвторизацииДиадок, BoxId, MessageId, "", "", ВозвращатьСодержимоеСущностей);
	
	Возврат Результат;
		
КонецФункции

&НаСервере
Функция ПолучитьПодписьФайлаДокументаНаСервере(АдресФайла, ДанныеАвторизации)
	Возврат МодульОбъекта().ПолучитьПодписьФайлаДокумента_КонтурEDI(АдресФайла, ДанныеАвторизации);
КонецФункции	

&НаКлиенте
Функция ПолучитьПодписьФайлаДокументаНаКлиенте(АдресФайла, Отпечаток, ПарольКонтейнера = "") Экспорт
	
	//серверный аналог функции расположен в модуле объекта
	Результат = ИнициализироватьСтруктуруРезультатаФункции();
	
	Попытка
		
		Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
			
			ПутьКФайлу = ПолучитьИмяВременногоФайла();
			Файл = ПолучитьИзВременногоХранилища(АдресФайла);
			Файл.Записать(ПутьКФайлу);
			
			Контент = ПутьКФайлу;
			
		Иначе     
			
			Контент = АдресФайла;				
			
		КонецЕсли;
		
		Подпись = МодульОбъектаКлиент().Криптография_Подписать(Контент, Отпечаток, ПарольКонтейнера);
		ШифрованнаяПодпись = Base64Строка(Подпись);
		
		Результат.Успешно = Истина;
		Результат.Вставить("ШифрованнаяПодпись", ШифрованнаяПодпись);
		
	Исключение
		
		Результат.ОписаниеОшибки = ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СохранитьКонтентВложения(BoxId, MessageId, EntityId, ДанныеАвторизации, ПутьКФайлу)
	
	Результат = ИнициализироватьСтруктуруРезультатаФункции();
	
	ИспользоватьСохраненныйТокен = Истина;
	
	ДвоичныеДанные = ДвоичныеДанныеКонтентаEntity(BoxId, EntityId, MessageId, ДанныеАвторизации, ИспользоватьСохраненныйТокен);     
	
	Если ДвоичныеДанные <> Неопределено Тогда
		
		ДвоичныеДанные.Записать(ПутьКФайлу);
		
		ФайлКонтентаВложения = Новый Файл(ПутьКФайлу);
		Если Не ФайлКонтентаВложения.Существует() Тогда
			ВызватьИсключение "не удалось сохранить файл на диск";
		КонецЕсли;
		
		Результат.Успешно = Истина;
		
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

&НаКлиенте
Функция ДвоичныеДанныеКонтентаEntity(BoxId, EntityId, MessageId, Знач ДанныеАвторизации, ИспользоватьСохраненныйТокен)
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_СодержимоеСущности(ДанныеАвторизацииДиадок, BoxId, MessageId, EntityId);
	
	Возврат Результат;
		
КонецФункции


&НаКлиенте
Функция ИнициализироватьСтруктуруРезультатаФункции()
	
	СтруктураРезультата = Новый Структура();
	
	СтруктураРезультата.Вставить("Успешно",			Ложь);
	СтруктураРезультата.Вставить("ОписаниеОшибки",	"");
	
	Возврат СтруктураРезультата;
	
КонецФункции

//-------------------------------------------------------------------------------------------------
// Отправка извещений о получении
//-------------------------------------------------------------------------------------------------
&НаКлиенте
Процедура ОтправитьСлужебныеУниверсальныеСообщения() Экспорт 
	
	СброситьПроверкиДанныхАвторизации();	
	МассивОрганизаций = ВернутьМассивОрганизаций();
	ОтправлятьИоП = ПолучитьФункциональнуюОпциюEDI_НаСервере("SendIopWithSus",Истина);
	Для каждого Организация Из МассивОрганизаций Цикл
		
		ЗаполнитьТаблицуАвторизацииПоУмолчанию();
		
		СброситьПроверкиДанныхАвторизации();	
		ИнициализироватьДанныеАвторизации(Организация);
		
		Если ДанныеАвторизации.ТипАвторизации <> "ЛогинПароль" Тогда  
			ОбновитьДанныеАвторизации("ТипАвторизации", "Сертификат");
		КонецЕсли;
		
		Если Не СертификатПоОрганизацииНазначен(Организация) Тогда 
			Продолжить;
		КонецЕсли;	
		
		//Поиск ящика Диадока
		ИдентификаторОрганизацииДиадок = ИдентификаторОрганизацииДиадок_Сервер(ДанныеАвторизации);
		ИдентификаторЯщикаДиадок = ИдентификаторЯщикаДиадок(ДанныеАвторизации,ИдентификаторОрганизацииДиадок);  
		
		НазначенныеДанныеАвторизации = ДанныеАвторизации;  
		ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(НазначенныеДанныеАвторизации);
		
		DD_МассивСтруктур = МодульОбъектаКлиент().КонтурДиадокAPI_СписокДокументовПолный(ДанныеАвторизацииДиадок, ИдентификаторЯщикаДиадок, "Any.OutboundHaveToCreateReceipt");
		
		ПолучитьТаблицуДляОтправкиСлужебныхУниверсальныхСообщений_НаСервере(DD_МассивСтруктур); 
		
		Если СчетаФактурыДляОтправкиИзвещений.Количество() = 0 Тогда 
			Продолжить
		КонецЕсли;    
		
		Прогресс = 0;
		Всего = СчетаФактурыДляОтправкиИзвещений.Количество();  
		ТекОрганизация = Организация;
		
		Для каждого СтрокаСЧФ Из СчетаФактурыДляОтправкиИзвещений Цикл
			
			Прогресс = Прогресс + 1;
			ТекПроцент = Цел((Прогресс * 100 / Всего)); 
			Состояние("Отправка извещений в Диадок: " + Прогресс + " из " + Всего +  " , по организации " + СтрокаСЧФ.Организация, ТекПроцент); 
			Если ОтправлятьИоП Тогда 
				СтруктураСобытия = СобытиеСертификаты_НазначитьСертификат(СтрокаСЧФ);
				
				Если СтруктураСобытия.Переопределено Тогда 
					
					НазначенныеДанныеАвторизации = ПолучитьСтруктуруДанныхАвторизации();
					НазначенныеДанныеАвторизации.Организация = СтруктураСобытия.Организация;
					НазначенныеДанныеАвторизации.Отпечаток = СтруктураСобытия.Сертификат.Отпечаток;
					НазначенныеДанныеАвторизации.ПарольКонтейнера = СтруктураСобытия.Сертификат.Пароль;
					НазначенныеДанныеАвторизации.Расположение = СтруктураСобытия.Сертификат.Расположение;
					НазначенныеДанныеАвторизации.ТребуетсяДоверенность = СтруктураСобытия.Доверенность.ИспользоватьПоУмолчанию;
					НазначенныеДанныеАвторизации.ТипАвторизации = "Сертификат";
					
					СтруктураСобытия.Доверенность.Вставить("ДвоичныеДанныеДоверенности", СтруктураСобытия.ДвоичныеДанныеДоверенности);
					СтруктураСобытия.Доверенность.Вставить("ДвоичныеДанныеПодписи", СтруктураСобытия.ДвоичныеДанныеПодписи);
					
					НазначенныеДанныеАвторизации.Доверенность = СтруктураСобытия.Доверенность;
					
					
				ИначеЕсли ТекОрганизация <> СтрокаСЧФ.Организация Тогда
					
					ТекОрганизация = СтрокаСЧФ.Организация;
					ИнициализироватьДанныеАвторизации(ТекОрганизация);
					ОбновитьДанныеАвторизации("ТипАвторизации", "Сертификат"); 
					
					Если Не СертификатПоОрганизацииНазначен(ТекОрганизация) Тогда //TODO при необходимости выбора сертификата и доверенности - использовать МожемПодписатьДокументыСертификатом
						Продолжить;
					КонецЕсли;
					
					Если Не ДанныеАвторизации.СертификатПроверен Тогда //TODO при необходимости ПроверкаСертификатаВФНС - использовать ОбработчикПроверкиПодписанияСертификатом
						
						ПарольКонтейнера = "";
						РезультатПроверки = ПроверитьВыбранныйСертификат(ДанныеАвторизации.Организация, ДанныеАвторизации.Отпечаток, ДанныеАвторизации.Расположение, ДанныеАвторизации.СертификатДействуетПо, ПарольКонтейнера);
						
						Если РезультатПроверки.Успешно = Ложь
							И ОшибкаНеправильныйПарольКонтейнера(РезультатПроверки.ОписаниеОшибки) Тогда
							
							ПарольКонтейнера = ПолучитьПарольКонтейнераСертификатаСервер(ДанныеАвторизации.Организация, ДанныеАвторизации.Отпечаток);
							РезультатПроверки = ПроверитьВыбранныйСертификат(ДанныеАвторизации.Организация, ДанныеАвторизации.Отпечаток, ДанныеАвторизации.Расположение, ДанныеАвторизации.СертификатДействуетПо, ПарольКонтейнера);
							
						КонецЕсли;
						
						ОбновитьДанныеАвторизации("СертификатПроверен", Истина);
						
						Если РезультатПроверки.Успешно = Истина Тогда
							ОбновитьДанныеАвторизации("ПарольКонтейнера", ПарольКонтейнера);
							ОбновитьДанныеАвторизации("ВалидацияСертификатаПройдена", Истина);
						Иначе
							ОбновитьДанныеАвторизации("ВалидацияСертификатаПройдена", Ложь);
						КонецЕсли;
						
					КонецЕсли;
					
					НазначенныеДанныеАвторизации = ДанныеАвторизации;
					
				КонецЕсли;
				
				Если ПропускСертификатаПоОрганизации(НазначенныеДанныеАвторизации.Организация) Тогда
					Продолжить; 
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НазначенныеДанныеАвторизации.Доверенность) Тогда
					СпособПередачиМашиночитаемойДоверенности = СпособПередачиМашиночитаемойДоверенности(СтрокаСЧФ.Ссылка);
					НазначенныеДанныеАвторизации.Вставить("СпособПередачиДоверенности", СпособПередачиМашиночитаемойДоверенности);
				КонецЕсли;
				
				ЕстьДоверенностьПоУмолчаниюВДиадок = ЗначениеЗаполнено(ДоверенностьПоУмолчанию(НазначенныеДанныеАвторизации));
				НазначенныеДанныеАвторизации.Вставить("ЕстьДоверенностьПоУмолчаниюВДиадок", ЕстьДоверенностьПоУмолчаниюВДиадок);
			КонецЕсли;
			
			ДанныеДокумента = Новый Структура("boxId, messageId, Ссылка, Организация, ДокументПредставление");
			ЗаполнитьЗначенияСвойств(ДанныеДокумента, СтрокаСЧФ);
			
			СформироватьИОтправитьСлужебноеУниверсальноеСообщение(НазначенныеДанныеАвторизации,ДанныеДокумента,ОтправлятьИоП);
			
		КонецЦикла;	
	КонецЦикла;
	
	СброситьПарольКонтейнераДанныхАвторизации(); 
	
КонецПроцедуры  

&НаКлиенте
Процедура СформироватьИОтправитьСлужебноеУниверсальноеСообщение(ДанныеАвторизации,ДанныеДокумента,ОтправлятьИоП)  
		
		Попытка
			Message = ПолучитьMessage(ДанныеДокумента.boxId, ДанныеДокумента.messageId, ДанныеАвторизации, Ложь);
		Исключение                                                                                  
			ОписаниеОшибки = ОписаниеОшибки();
			ЗафиксироватьОшибку_НеУдалосьПолучитьДокументыДляФормированияИзвещений(ДанныеДокумента, ОписаниеОшибки);
			Возврат;
		КонецПопытки;
		
		СписокParentEntityIdИзвещенийДляОтправки = ПолучитьСписокParentEntityIdИзвещенийДляОтправки(Message);
		
		Если СписокParentEntityIdИзвещенийДляОтправки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		messageId = ДанныеДокумента.messageId;
		boxId = ДанныеДокумента.boxId; 
		
		MessagePatchToPost = МодульОбъектаКлиент().КонтурДиадокAPI_СоздатьПоСхеме("MessagePatchToPostV2");
		MessagePatchToPost.BoxId 	 = boxId;
		MessagePatchToPost.MessageId = messageId;
		
		Если ОтправлятьИоП Тогда 
			SignerContent = SignerContentИоП(ДанныеАвторизации);
			PowerOfAttorneyToPost = PowerOfAttorneyToPost(ДанныеАвторизации); 
		КонецЕсли; 
		
		Для каждого ЭлементСпискаЗначений Из СписокParentEntityIdИзвещенийДляОтправки Цикл
			
			AttachmentId = ЭлементСпискаЗначений.Значение;
			СтруктураПараметровСУС = ВернутьПараметрыСуС(ДанныеАвторизации);
			СтрокаXML = ЗаписатьСлужебноеУниверсальноеСообщение_НаСервере(СтруктураПараметровСУС);  
			Попытка 
				UniversalMessage = GenerateUniversalMessage(
				boxId,
				messageId,
				AttachmentId,
				СтрокаXML,
				ДанныеАвторизации); 
			Исключение 
				ОписаниеОшибки = ОписаниеОшибки();
				ЗафиксироватьОшибку_НеУдалосьСформироватьИзвещения(ДанныеДокумента, ОписаниеОшибки);
				Возврат;
			КонецПопытки;
			
			UniversalMessageAttachment = МодульОбъектаКлиент().КонтурДиадокAPI_СоздатьПоСхеме("UniversalMessageAttachment");
			UniversalMessageAttachment.ParentEntityId = AttachmentId;
			UniversalMessageAttachment.CodeGroup = Лев(СтруктураПараметровСУС.Код, 1);
			UniversalMessageAttachment.UniversalMessageContent.Content = Base64Строка(UniversalMessage);  
			
			MessagePatchToPost.UniversalMessages.Добавить(UniversalMessageAttachment); 
			Если ОтправлятьИоП Тогда 
				ReceiptGenerationRequestV2 = МодульОбъектаКлиент().КонтурДиадокAPI_СоздатьПоСхеме("ReceiptGenerationRequestV2");
				
				ReceiptGenerationRequestV2.MessageId 		= messageId;
				ReceiptGenerationRequestV2.AttachmentId 	= AttachmentId;
				ReceiptGenerationRequestV2.SignerContent 	= SignerContent;
				
				Попытка
					ДвоичныеДанныеИзвещения = GenerateReceiptXml(boxId, ReceiptGenerationRequestV2, ДанныеАвторизации);
				Исключение
					ОписаниеОшибки = ОписаниеОшибки();
					ЗафиксироватьОшибку_НеУдалосьСформироватьИзвещения(ДанныеДокумента, ОписаниеОшибки);
					Возврат;
				КонецПопытки;
				
				Попытка
					Подпись = ПодписатьКонтент(ДвоичныеДанныеИзвещения, ДанныеАвторизации);
				Исключение
					ОписаниеОшибки = ОписаниеОшибки();
					ЗафиксироватьОшибку_НеУдалосьПодписатьИзвещения(ДанныеДокумента, ОписаниеОшибки);
					Возврат;
				КонецПопытки;
				
				ReceiptAttachment = МодульОбъектаКлиент().КонтурДиадокAPI_СоздатьПоСхеме("ReceiptAttachment");
				
				ReceiptAttachment.ParentEntityId = AttachmentId; 
				ReceiptAttachment.SignedContent.Content = Base64Строка(ДвоичныеДанныеИзвещения);
				ReceiptAttachment.SignedContent.Signature = Подпись;
				ReceiptAttachment.SignedContent.PowerOfAttorney = PowerOfAttorneyToPost;
				
				MessagePatchToPost.Receipts.Добавить(ReceiptAttachment);
			КонецЕсли;
		КонецЦикла;
		
		Если MessagePatchToPost.UniversalMessages.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Попытка
			MessagePatch = PostMessagePatch(MessagePatchToPost, , ДанныеАвторизации);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЗафиксироватьОшибку_НеУдалосьОтправитьИзвещения(ДанныеДокумента, ОписаниеОшибки);
			Возврат;
		КонецПопытки;
		
		ЗаписатьДопРеквизитыСообщенияInvoiceReceiptIdСервер(MessagePatch, СписокParentEntityIdИзвещенийДляОтправки, ДанныеДокумента.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Функция GenerateUniversalMessage(ИдентификаторЯщика, messageId, attachmentId, СтрокаXML,ДанныеАвторизации)	
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_СгенерироватьУниверсальноеСообщение(ДанныеАвторизацииДиадок, ИдентификаторЯщика, messageId, attachmentId, СтрокаXML);
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Функция ВернутьПараметрыСуС(ДанныеАвторизации)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Код"				, "1999");
	СтруктураПараметров.Вставить("ТекстСообщения"	, "");
	Отправитель = Новый Структура;
	Отправитель.Вставить("ДанныеПоУмолчанию"		, "false");//ДанныеПоУмолчанию
	Отправитель.Вставить("Фамилия"					, ДанныеАвторизации.СвойстваСертификата.Субъект.Фамилия);
	Отправитель.Вставить("Имя"						, ДанныеАвторизации.СвойстваСертификата.Субъект.Имя);
	Отправитель.Вставить("Отчество"					, ДанныеАвторизации.СвойстваСертификата.Субъект.Отчество); 
	СтруктураПараметров.Вставить("Отправитель"		, Отправитель); 
	
	Возврат СтруктураПараметров; 
	
КонецФункции

&НаСервере
Функция ПолучитьФункциональнуюОпциюEDI_НаСервере(ИмяОпции,ЗначениеПоУмолчанию = Ложь) 
	Возврат МодульОбъекта().ПолучитьФункциональнуюОпциюEDI(ИмяОпции,ЗначениеПоУмолчанию);
КонецФункции	 

&НаСервере
Функция ЗаписатьСлужебноеУниверсальноеСообщение_НаСервере(СтруктураПараметров)  
	Возврат МодульОбъекта().ЗаписатьСлужебноеУниверсальноеСообщение(СтруктураПараметров);
КонецФункции

&НаСервере
Процедура ПолучитьТаблицуДляОтправкиСлужебныхУниверсальныхСообщений_НаСервере(МассивСтруктур)  
	СчетаФактурыДляОтправкиИзвещений.Загрузить(МодульОбъекта().ПолучитьТаблицуДляОтправкиСлужебныхУниверсальныхСообщений(МассивСтруктур));
КонецПроцедуры	

&НаСервере
Функция ВернутьМассивОрганизаций()    
	Возврат МодульОбъекта().ПолучитьСписокЭлементовСправочника("ЮрФизЛицаСвои").ВыгрузитьКолонку("ЮрФизЛицо");
КонецФункции    

&НаКлиенте
Функция GenerateReceiptXml(boxId, ReceiptGenerationRequestV2, ДанныеАвторизации) 
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_СгенерироватьИзвещениеОПолучении_V2(ДанныеАвторизацииДиадок, boxId, ReceiptGenerationRequestV2);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокParentEntityIdТитуловПолучателя(Message)
	
	СписокParentEntityId = Новый СписокЗначений;
	
	МассивAttachmentType = РазложитьСтрокуВМассивСлов_КонтурСВ("Title,UniversalTransferDocumentBuyerTitle,UniversalCorrectionDocumentBuyerTitle", ",");	
	
	Для каждого Entity Из Message.Entities Цикл
		Если МассивAttachmentType.Найти(Entity.AttachmentType) <> Неопределено Тогда
			СписокParentEntityId.Добавить(Entity.EntityId, Entity.AttachmentType);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокParentEntityId;
	
КонецФункции // ПолучитьСписокParentEntityIdТитуловПолучателя()

&НаКлиенте
Функция ПолучитьСписокParentEntityIdИзвещенийДляОтправки(Message)
	
	СписокParentEntityId = ПолучитьСписокParentEntityIdТитуловПолучателя(Message);
	
	Для каждого Entity Из Message.Entities Цикл
		Если Прав(Entity.AttachmentType,7) = "Receipt" Тогда
			НайденныйЭлемент = СписокParentEntityId.НайтиПоЗначению(Entity.ParentEntityId);
			Если НЕ НайденныйЭлемент = Неопределено Тогда
				СписокParentEntityId.Удалить(НайденныйЭлемент);	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокParentEntityId;
	
КонецФункции // ПолучитьСписокParentEntityIdИзвещенийДляОтправки()

&НаКлиенте
Функция СохранитьТекстИзвещенияВФайл(entityId, ТекстИзвещения, ПутьКФайлу)
	
	ВременныйФайл = Новый Файл(ПутьКФайлу);
	Если ВременныйФайл.Существует() Тогда
		УдалитьФайлы(ВременныйФайл.ПолноеИмя); //Если такой файл уже есть в temp, значит, он остался от предыдущей сессии, когда чо-то пошло не так. Удалим его.
	КонецЕсли;
	ТД = Новый ТекстовыйДокумент;
	ТД.УстановитьТекст(ТекстИзвещения);
	ТД.Записать(ПутьКФайлу, "windows-1251");
	
	Возврат ТД;
	
КонецФункции

&НаСервере
Процедура ЗаписатьДопРеквизитыСообщенияInvoiceReceiptIdСервер(MessagePatch, СписокParentEntityId, СообщениеСсылка)
	
	Если MessagePatch.Свойство("Entities") И ТипЗнч(MessagePatch.Entities) = Тип("Массив") Тогда
		Для каждого Entity Из MessagePatch.Entities Цикл
			Если Прав(Entity.AttachmentType,7) = "Receipt" Тогда
				
				НайденныйЭлемент = СписокParentEntityId.НайтиПоЗначению(Entity.ParentEntityId);
				Если НЕ НайденныйЭлемент = Неопределено Тогда
					МодульОбъекта().ЗаписатьДопРеквизитСправочника_КонтурEDI(СообщениеСсылка, "InvoiceReceiptEntityId_HaveToCreateReceipt", Entity.EntityId);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДопРеквизитыСообщенияInvoiceReceiptIdСервер(СообщениеСсылка) 
	
	МодульОбъекта().УдалитьДопРеквизитыСправочника_КонтурEDI(СообщениеСсылка, "InvoiceReceiptEntityId_HaveToCreateReceipt");
	
КонецПроцедуры

&НаКлиенте
Функция PostMessagePatch(MessagePatchToPostV2, operationId = "", ДанныеАвторизации) 
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_ОтправитьДополнениеКСообщению(ДанныеАвторизацииДиадок, MessagePatchToPostV2, operationId);
	
	Возврат Результат;
	
КонецФункции

//-------------------------------------------------------------------------------------------------
// Все, что относится к патчу черновиков методом PrepareDocumentsToSign
//-------------------------------------------------------------------------------------------------

&НаКлиенте
Функция ВыполнитьPrepareDocumentsToSign(PrepareDocumentsToSignRequest, ДанныеАвторизации)
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_ПодготовитьДокументыКПодписанию(ДанныеАвторизацииДиадок, PrepareDocumentsToSignRequest);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НайтиPatchedEntity(PatchedEntities, EntityId)
	
	Entity = Неопределено;
	
	Для каждого PatchedEntity Из PatchedEntities Цикл
		Если PatchedEntity.DocumentId.EntityId = EntityId Тогда
			Entity = PatchedEntity;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Entity;
	
КонецФункции

&НаКлиенте
Функция ПодписатьPatchedEntity(PatchedEntity, МассивСтруктур, ДанныеАвторизации)
	
	Результат = ИнициализироватьСтруктуруРезультатаФункции();
	
	ПутьКФайлу = мРабочийКаталог + PatchedEntity.DocumentId.EntityId;
	ВременныйФайл = Новый Файл(ПутьКФайлу);
	Если ВременныйФайл.Существует() Тогда
		УдалитьФайлы(ВременныйФайл.ПолноеИмя); //Если такой файл уже есть в temp, значит, он остался от предыдущей сессии, когда чо-то пошло не так. Удалим его.
	КонецЕсли;
	ФайлДляПодписи = Base64Значение(PatchedEntity.Content);
	ФайлДляПодписи.Записать(ПутьКФайлу);
	АдресФайлаДляПодписи = ПоместитьВоВременноеХранилище(ФайлДляПодписи, Новый УникальныйИдентификатор);
	
	Для Сч = 1 По 2 Цикл
		
		Если ДанныеАвторизации.Расположение = "сервер" Тогда
			РезультатПодписания = ПолучитьПодписьФайлаДокументаНаСервере(АдресФайлаДляПодписи, ДанныеАвторизации);
		Иначе	
			РезультатПодписания = ПолучитьПодписьФайлаДокументаНаКлиенте(ПутьКФайлу, ДанныеАвторизации.Отпечаток, ДанныеАвторизации.ПарольКонтейнера);
		КонецЕсли;	
		
		Если ОбработкаИсключенияТипМодуляКриптографии(РезультатПодписания.ОписаниеОшибки, ДанныеАвторизации) Тогда
			Продолжить; // еще раз, уже с нужным типом модуля криптографии
		Иначе
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;
	
	Если Не РезультатПодписания.Успешно Тогда
		Результат.ОписаниеОшибки = РезультатПодписания.ОписаниеОшибки;
		Возврат Результат;
	Иначе
		Результат.Успешно = Истина;
	КонецЕсли;
	
	Signature = РезультатПодписания.ШифрованнаяПодпись;
	
	DocumentSignature = Новый Структура;
	DocumentSignature.Вставить("ParentEntityId", 	PatchedEntity.DocumentId.EntityId);
	DocumentSignature.Вставить("Signature",			Signature);
	DocumentSignature.Вставить("PatchedContentId",	PatchedEntity.PatchedContentId);
	
	ДобавитьИнформациюОбМЧД(DocumentSignature, ДанныеАвторизации);
	
	МассивСтруктур.Добавить(DocumentSignature);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьИнформациюОбМЧД(СтруктураПриемник, ДанныеАвторизации, ТолькоИдентификаторы = Ложь) Экспорт
	
	PowerOfAttorneyToPost = PowerOfAttorneyToPost(ДанныеАвторизации);
	
	СтруктураПриемник.Вставить("PowerOfAttorney", PowerOfAttorneyToPost);
	
КонецПроцедуры

&НаКлиенте
Функция PowerOfAttorneyToPost(ДанныеАвторизации)
	
	МашиночитаемаяДоверенностьДляОтправки = МашиночитаемаяДоверенностьДляОтправки(ДанныеАвторизации);
	
	PowerOfAttorneyToPost = МодульОбъектаКлиент().КонтурДиадокAPI_Привести("PowerOfAttorneyToPost", МашиночитаемаяДоверенностьДляОтправки);
	
	Возврат PowerOfAttorneyToPost;
	
КонецФункции

&НаКлиенте
Функция SignerContent(ДанныеАвторизации, BoxId)
	
	МашиночитаемаяДоверенностьДляОтправки = МашиночитаемаяДоверенностьДляОтправки(ДанныеАвторизации);
	
	Если ДанныеАвторизации.Расположение = "сервер" Тогда
		CertificateBytes = ПолучитьСертификат1СПоОтпечаткуНаСервере(ДанныеАвторизации, Истина);
	Иначе	
		CertificateBytes = ПолучитьСертификат1СПоОтпечаткуНаКлиенте(ДанныеАвторизации.Отпечаток, Истина);
	КонецЕсли;
	
	CertificateThumbprint = ДанныеАвторизации.Отпечаток;
	
	ДвоичныеДанныеBase64 = XML_УниверсальныйПодписант(BoxId, CertificateBytes, CertificateThumbprint, МашиночитаемаяДоверенностьДляОтправки);
	
	Возврат ДвоичныеДанныеBase64;
	
КонецФункции

&НаКлиенте
Функция SignerContent970(ДанныеАвторизации, BoxId)
	
	CertificateBytes = Неопределено;
	ИННОрганизацииДиадок = Неопределено;
	
	Если ДанныеАвторизации.Расположение = "клиент" Тогда
		
		CertificateBytes = ПолучитьСертификат1СПоОтпечаткуНаКлиенте(ДанныеАвторизации.Отпечаток, Истина);
		
		Если Не ЗначениеЗаполнено(ДанныеАвторизации.СвойстваСертификата) Тогда
			ДанныеАвторизации.СвойстваСертификата = ПолучитьСвойстваСертификатаНаКлиенте(ДанныеАвторизации.Отпечаток);	
		КонецЕсли;
		
		ИННОрганизацииДиадок = ПолучитьИННЯщикаДиадокНаКлиенте(BoxId, ДанныеАвторизации);
		
	КонецЕсли;
	
	ДвоичныеДанныеBase64 = XML_УниверсальныйПодписант970(BoxId, CertificateBytes, ДанныеАвторизации, ИННОрганизацииДиадок);
	
	Возврат ДвоичныеДанныеBase64;
	
КонецФункции

&НаСервере
Функция XML_УниверсальныйПодписант(BoxId, CertificateBytes, CertificateThumbprint, МашиночитаемаяДоверенностьДляОтправки)
	
	Возврат МодульОбъекта().XML_УниверсальныйПодписант(BoxId, CertificateBytes, CertificateThumbprint, МашиночитаемаяДоверенностьДляОтправки);	
	
КонецФункции

&НаСервере
Функция XML_УниверсальныйПодписант_ИоП(CertificateBytes, CertificateThumbprint, МашиночитаемаяДоверенностьДляОтправки)
	
	Возврат МодульОбъекта().XML_УниверсальныйПодписант_ИоП(CertificateBytes, CertificateThumbprint, МашиночитаемаяДоверенностьДляОтправки);	
	
КонецФункции

&НаСервере
Функция XML_УниверсальныйПодписант970(BoxId, CertificateBytes, ДанныеАвторизации, ИННОрганизации)
	
	Если ДанныеАвторизации.Расположение = "сервер" Тогда
		
		CertificateBytes = ПолучитьСертификат1СПоОтпечаткуНаСервере(ДанныеАвторизации, Истина);
		ИННОрганизации = ПолучитьИННЯщикаДиадокНаСервере(BoxId, ДанныеАвторизации);
		
		Если Не ЗначениеЗаполнено(ДанныеАвторизации.СвойстваСертификата) Тогда
			ДанныеАвторизации.СвойстваСертификата = ПолучитьСвойстваСертификатаНаСервере(ДанныеАвторизации);	
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат МодульОбъекта().XML_УниверсальныйПодписант970(BoxId, CertificateBytes, ДанныеАвторизации.Отпечаток, ДанныеАвторизации, ИННОрганизации);	
	
КонецФункции

&НаКлиенте
Функция МашиночитаемаяДоверенностьДляОтправки(ДанныеАвторизации)
	
	РегистрационныйНомер = СвойствоСтруктуры(ДанныеАвторизации, "Доверенность.Идентификатор", "");
	РегистрационныйНомер = СвойствоСтруктуры(ДанныеАвторизации, "Доверенность.РегистрационныйНомер", РегистрационныйНомер);
	РегистрационныйНомер = СвойствоСтруктуры(ДанныеАвторизации, "Доверенность.СоставнойИдентификатор.РегистрационныеНомер", РегистрационныйНомер);
	
	ИННДоверителя = СвойствоСтруктуры(ДанныеАвторизации, "Доверенность.ИННОрганизации", "");
	ИННДоверителя = СвойствоСтруктуры(ДанныеАвторизации, "Доверенность.Доверитель", ИННДоверителя); 
	ИННДоверителя = СвойствоСтруктуры(ДанныеАвторизации, "Доверенность.СоставнойИдентификатор.ИННДоверителя", ИННДоверителя); 
	
	ИННПредставителя = СвойствоСтруктуры(ДанныеАвторизации, "Доверенность.СоставнойИдентификатор.ИННПредставителя", "");
	
	ИспользоватьДоверенностьПоУмолчанию = СвойствоСтруктуры(ДанныеАвторизации, "Доверенность.ИспользоватьПоУмолчанию", Ложь);
	ИспользоватьДоверенностьПоУмолчанию = ИспользоватьДоверенностьПоУмолчанию Или
	(ДанныеАвторизации.ЕстьДоверенностьПоУмолчаниюВДиадок = Истина И ДанныеАвторизации.ТребуетсяДоверенность = Истина);
	
	ИспользоватьДоверенностьПоУмолчанию = ИспользоватьДоверенностьПоУмолчанию И (Не ЗначениеЗаполнено(РегистрационныйНомер) И Не ЗначениеЗаполнено(ИННДоверителя));
	
	ФайлДоверенности = СвойствоСтруктуры(ДанныеАвторизации, "Доверенность.ДвоичныеДанныеДоверенности", Неопределено);
	ФайлПодписи 	= СвойствоСтруктуры(ДанныеАвторизации, "Доверенность.ДвоичныеДанныеПодписи", Неопределено);  
	
	ПередатьФайлом = СвойствоСтруктуры(ДанныеАвторизации, "СпособПередачиДоверенности", "Метаинформацией") = "Файлом";

	МашиночитаемаяДоверенностьДляОтправки = МодульОбъектаКлиент().КонтурДиадокAPI_СоздатьПоСхеме("PowerOfAttorneyToPost", Истина);
	
	МашиночитаемаяДоверенностьДляОтправки.СоставнойИдентификатор.РегистрационныеНомер = РегистрационныйНомер;
	МашиночитаемаяДоверенностьДляОтправки.СоставнойИдентификатор.ИННДоверителя = ИННДоверителя; 
	МашиночитаемаяДоверенностьДляОтправки.СоставнойИдентификатор.ИННПредставителя = ИННПредставителя; 
	МашиночитаемаяДоверенностьДляОтправки.ИспользоватьДоверенностьПоУмолчанию = ИспользоватьДоверенностьПоУмолчанию;
	МашиночитаемаяДоверенностьДляОтправки.СодержимоеФайлаДоверенностиИПодписи.ФайлДоверенности.Контент = Base64Строка(ФайлДоверенности);
	МашиночитаемаяДоверенностьДляОтправки.СодержимоеФайлаДоверенностиИПодписи.ФайлПодписи.Контент = Base64Строка(ФайлПодписи); 
	МашиночитаемаяДоверенностьДляОтправки.ПередатьФайлом = ПередатьФайлом;
	
	Возврат МашиночитаемаяДоверенностьДляОтправки;
	
КонецФункции

&НаКлиенте
Функция SignerContentИоП(ДанныеАвторизации)
	
	МашиночитаемаяДоверенностьДляОтправки = МашиночитаемаяДоверенностьДляОтправки(ДанныеАвторизации);
	
	Если ДанныеАвторизации.Расположение = "сервер" Тогда
		CertificateBytes = ПолучитьСертификат1СПоОтпечаткуНаСервере(ДанныеАвторизации, Истина);
	Иначе	
		CertificateBytes = ПолучитьСертификат1СПоОтпечаткуНаКлиенте(ДанныеАвторизации.Отпечаток, Истина);
	КонецЕсли;
	
	CertificateThumbprint = ДанныеАвторизации.Отпечаток;
	
	ДвоичныеДанныеBase64 = XML_УниверсальныйПодписант_ИоП(CertificateBytes, CertificateThumbprint, МашиночитаемаяДоверенностьДляОтправки);
	
	Возврат ДвоичныеДанныеBase64;
	
КонецФункции

&НаКлиенте
Функция СвойствоСтруктуры(СложнаяСтруктура, ИерархияСвойств, ЗначениеПоУмолчанию = Неопределено)
	
	Результат = ЗначениеПоУмолчанию;
	
	Если Не ЗначениеЗаполнено(ИерархияСвойств) Или СложнаяСтруктура = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПростыеКлючи = EDI_РазложитьСтрокуВМассивСлов(ИерархияСвойств, ".", Ложь);
	
	ЗначениеПолучено = Ложь;
	ТекущееЗначение   = Неопределено;
	ТекущаяСтруктура = СложнаяСтруктура;
	
	ВГраница = ПростыеКлючи.ВГраница();
	
	Для Сч = 0 По ВГраница Цикл
		
		ТекущийКлюч = ПростыеКлючи[Сч];
		
		Если ТекущаяСтруктура.Свойство(ТекущийКлюч, ТекущееЗначение) Тогда
			
			Если Сч = ВГраница Тогда
				
				ЗначениеПолучено = Истина;
				
			ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("Структура") Тогда
				
				ТекущаяСтруктура = ТекущееЗначение;
				
			Иначе
				Прервать;
			КонецЕсли;
			
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеПолучено Тогда
		Результат = ТекущееЗначение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция EDI_РазложитьСтрокуВМассивСлов(Знач Строка, РазделителиСлов="", РазделительКакЕдиныйСимвол = Ложь) Экспорт
	
	Слова = Новый Массив;
	
	ДлинаРазделителя = СтрДлина(РазделителиСлов);
	
	Если ДлинаРазделителя = 1 ИЛИ РазделительКакЕдиныйСимвол Тогда
		
		НайденныйСимвол = Найти(Строка,РазделителиСлов);
		Пока НайденныйСимвол>0 Цикл
			Слова.Добавить(СокрЛП(Лев(Строка,НайденныйСимвол + ДлинаРазделителя - 2)));
			Строка = Сред(Строка,НайденныйСимвол + ДлинаРазделителя);
			НайденныйСимвол = Найти(Строка,РазделителиСлов);
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(Строка) Тогда
			Слова.Добавить(СокрЛП(Строка));
		КонецЕсли;
		
	Иначе
		
		Для Сч = 1 По СтрДлина(РазделителиСлов) Цикл
			Строка = СтрЗаменить(Строка,Сред(РазделителиСлов,Сч,1),Символы.ПС);
		КонецЦикла;
		
		Для Сч=1 По СтрЧислоСтрок(Строка) Цикл
			ТекСлово = СокрЛП(СтрПолучитьСтроку(Строка,Сч));
			Если ТекСлово<>"" Тогда
				Слова.Добавить(СокрЛП(ТекСлово));
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат Слова;
	
КонецФункции

&НаКлиенте
Функция ПолучитьEntitiesДляПодписания(MessageЧерновик)
	
	EntitiesДляПодписания = Новый Массив;
	
	Для каждого EntityЧерновика Из MessageЧерновик.Entities Цикл
		Если EntityЧерновика.Свойство("DocumentInfo") Тогда 
			EntitiesДляПодписания.Добавить(EntityЧерновика);
		КонецЕсли;
	КонецЦикла;
	
	Возврат EntitiesДляПодписания;
	
КонецФункции

&НаКлиенте
Функция ПолучитьPatchedEntities(Message, BoxId, MessageId, ДанныеАвторизации, IsDraft)
	
	PrepareDocumentsToSignRequest = МодульОбъектаКлиент().КонтурДиадокAPI_СоздатьПоСхеме("PrepareDocumentsToSignRequest");
	PrepareDocumentsToSignRequest.BoxId = BoxId;
	
	КэшКонтентаПодписантов = Новый Структура;	
	
	Для каждого Entity Из Message.Entities Цикл
		
		Если Entity.DocumentInfo.DocumentType = "UnknownDocumentType" Тогда
			Продолжить;
		КонецЕсли;
		
		EntityId = Entity.EntityId;
		SignerContent = ПолучитьКонтентПодписанта(Entity, КэшКонтентаПодписантов, ДанныеАвторизации, BoxId);
		
		Если IsDraft Тогда
			
			DraftDocumentToPatch = МодульОбъектаКлиент().КонтурДиадокAPI_СоздатьПоСхеме("DraftDocumentToPatch");
			
			DraftDocumentToPatch.DocumentId.MessageId = MessageId; 
			DraftDocumentToPatch.DocumentId.EntityId  = EntityId; 
			DraftDocumentToPatch.SignerContent = SignerContent;
			
			PrepareDocumentsToSignRequest.DraftDocuments.Добавить(DraftDocumentToPatch);
			
		Иначе     
			
			DocumentToPatch = МодульОбъектаКлиент().КонтурДиадокAPI_СоздатьПоСхеме("DocumentToPatch");
			
			DocumentToPatch.DocumentId.MessageId = MessageId; 
			DocumentToPatch.DocumentId.EntityId  = EntityId;
			DocumentToPatch.SignerContent = SignerContent;
			
			PrepareDocumentsToSignRequest.Documents.Добавить(DocumentToPatch);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	PrepareDocumentsToSignResponse = ВыполнитьPrepareDocumentsToSign(PrepareDocumentsToSignRequest, ДанныеАвторизации);	
	
	Возврат PrepareDocumentsToSignResponse; 	
	
КонецФункции

&НаКлиенте
Функция ПолучитьКонтентПодписанта(Entity, КэшКонтентаПодписантов, ДанныеАвторизации, BoxId) 
	
	КонтентПодписанта = Неопределено;
	
	ФорматПодписанта = "Формат820";
	
	Если Entity.Свойство("ContentTypeId") И Найти(Entity.ContentTypeId, "970") > 0 Тогда
		ФорматПодписанта = "Формат970";
	КонецЕсли;
	
	Если КэшКонтентаПодписантов.Свойство(ФорматПодписанта, КонтентПодписанта) Тогда
		Возврат КонтентПодписанта;
	КонецЕсли;
	
	Если ФорматПодписанта = "Формат970" Тогда
		КонтентПодписанта = SignerContent970(ДанныеАвторизации, BoxId);
	Иначе
		КонтентПодписанта = SignerContent(ДанныеАвторизации, BoxId);
	КонецЕсли;
	
	КэшКонтентаПодписантов.Вставить(ФорматПодписанта, КонтентПодписанта);
	
	Возврат КонтентПодписанта;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИННЯщикаДиадокНаКлиенте(ИдентификаторЯщика, ДанныеАвторизации)
	
	Если КэшИННЯщикаДиадок = Неопределено Тогда
		КэшИННЯщикаДиадок = Новый Соответствие;
	КонецЕсли;
	
	ИНН = КэшИННЯщикаДиадок.Получить(ИдентификаторЯщика);
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
	
		Попытка
			ЯщикДиадок = ПолучитьИнформациюОЯщикеДиадок(ИдентификаторЯщика, ДанныеАвторизации);
			ИНН = ЯщикДиадок.Organization.Inn;
		Исключение
			ИНН = Неопределено;
		КонецПопытки;
		
		Если Не ЗначениеЗаполнено(ИНН) Тогда
			ИНН = ПолучитьЗначениеСвойстваОбъектаEDI_Сервер(ДанныеАвторизации.Организация, "DiadocOrgInn");	
		КонецЕсли;
		
		КэшИННЯщикаДиадок.Вставить(ИдентификаторЯщика, ИНН);
		
	КонецЕсли;
	
	Возврат ИНН;
	
КонецФункции

&НаСервере
Функция ПолучитьИННЯщикаДиадокНаСервере(ИдентификаторЯщика, ДанныеАвторизации)
	
	Возврат МодульОбъекта().ПолучитьИННЯщикаДиадок(ИдентификаторЯщика, ДанныеАвторизации);
	
КонецФункции

&НаКлиенте
Функция ПолучитьИнформациюОЯщикеДиадок(ИдентификаторЯщика, ДанныеАвторизации)
	
	ДанныеАвторизацииДиадок = МодульОбъектаКлиент().ДанныеАвторизацииДляКонтурДиадокAPI(ДанныеАвторизации);
	Результат = МодульОбъектаКлиент().КонтурДиадокAPI_ИнформацияОЯщике(ДанныеАвторизацииДиадок, ИдентификаторЯщика);
	
	Возврат Результат;	
	
КонецФункции

//-------------------------------------------------------------------------------------------------
//авторизация на сервере Диадока ------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------

&НаКлиенте
Функция КлючАвторизацииAPI()
	
	Возврат API_КлючРазработчика_Диадок_Сервер();
	
КонецФункции

&НаСервере
Функция API_КлючРазработчика_Диадок_Сервер()
	Возврат МодульОбъекта().API_КлючРазработчика_Диадок();
КонецФункции

&НаКлиенте
Функция Токен(ДанныеАвторизации, ИспользоватьКэш = Истина) Экспорт
	
	Токен = Неопределено;
	
	Если ДанныеАвторизации.ТипАвторизации = "ЛогинПароль" Тогда
		Ключ = ДанныеАвторизации.ЛогинДД;		
	ИначеЕсли ДанныеАвторизации.ТипАвторизации = "Сертификат" Тогда
		Ключ = ДанныеАвторизации.Отпечаток;	
	КонецЕсли;
	
	Если Токены = Неопределено Тогда
		Токены = Новый Соответствие;
	КонецЕсли;
	
	Если ИспользоватьКэш Тогда	
		//Токены = ИзвлечьИзВХ("Токены"); 
		Если Не Токены = Неопределено Тогда
			Токен = Токены.Получить(Ключ);
		КонецЕсли;
	КонецЕсли;
	
	Если Токен = Неопределено Тогда
		
		Состояние("Авторизация в Диадок...");
		
		Если ДанныеАвторизации.ТипАвторизации = "ЛогинПароль" Тогда
			
			Ответ = DD_API_Authenticate_НаСервере(, ДанныеАвторизации.ЛогинДД, ДанныеАвторизации.ПарольДД);
			
			Если Ответ.КодСостояния <> "200" Тогда
				
				ОписаниеОшибки = "Ошибка HTTP запроса"
				+ ?(ЗначениеЗаполнено(Ответ.КодСостояния), Символы.ПС + Ответ.КодСостояния, "")
				+ ?(ЗначениеЗаполнено(Ответ.ТелоОтвета)  , Символы.ПС + Ответ.ТелоОтвета  , "");
				
				ВызватьИсключение ОписаниеОшибки;
				
			КонецЕсли;
			
			Токен = Ответ.ТелоОтвета;
			
		ИначеЕсли ДанныеАвторизации.ТипАвторизации = "Сертификат" Тогда
			
			Если ДанныеАвторизации.Расположение = "сервер" Тогда
				ТелоЗапроса = ПолучитьСертификат1СПоОтпечаткуНаСервере(ДанныеАвторизации, Истина);
			Иначе // клиент	
				ТелоЗапроса = ПолучитьСертификат1СПоОтпечаткуНаКлиенте(ДанныеАвторизации.Отпечаток, Истина);
			КонецЕсли;	
			
			Ответ = DD_API_Authenticate_НаСервере(ТелоЗапроса);
			
			Если Ответ.КодСостояния <> "200" Тогда
				
				ОписаниеОшибки = "Ошибка HTTP запроса"
				+ ?(ЗначениеЗаполнено(Ответ.КодСостояния), Символы.ПС + Ответ.КодСостояния, "")
				+ ?(ЗначениеЗаполнено(Ответ.ТелоОтвета)  , Символы.ПС + Ответ.ТелоОтвета  , "");
				
				ВызватьИсключение ОписаниеОшибки;
				
			КонецЕсли;
			
			Если ДанныеАвторизации.Расположение = "сервер" Тогда
				Токен = РасшифроватьЗашифрованныйТокенНаСервере(Ответ.ТелоОтвета, ДанныеАвторизации);
			Иначе // клиент	
				Токен = РасшифроватьЗашифрованныйТокенНаКлиенте(Ответ.ТелоОтвета, ДанныеАвторизации.ПарольКонтейнера);
			КонецЕсли;	
			
		КонецЕсли;
		
		Токены.Вставить(Ключ, Токен);
		
		Состояние("");
		
	КонецЕсли;
	
	Возврат Токен;
	                         
КонецФункции

&НаСервере
Функция DD_API_Authenticate_НаСервере(Сертификат = "", Логин = "", Пароль = "")
	Возврат МодульОбъекта().DD_API_Authenticate(Сертификат, Логин, Пароль);
КонецФункции

//-------------------------------------------------------------------------------------------------
//криптография ------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------

&НаКлиенте
Функция ТипПлатформы1С()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТипПлатформы1С = СистемнаяИнформация.ТипПлатформы;	
	Если ТипПлатформы1С = Неопределено Тогда
		ТипПлатформы1С = "";
	КонецЕсли;	
	
	Возврат ТипПлатформы1С;
	
КонецФункции

&НаСервере
Функция ПолучитьПарольКонтейнераСертификатаСервер(Организация, Отпечаток)
	
	Возврат МодульОбъекта().ПолучитьПарольКонтейнераСертификата(Организация, Отпечаток);
	
КонецФункции // ПолучитьПарольКонтейнераСертификатаСервер()

&НаСервере
Процедура СохранитьПараметрыСертификатаСервер(ДанныеСертификата)
	
	МодульОбъекта().СохранитьПараметрыСертификата(ДанныеСертификата);
	
КонецПроцедуры // СохранитьПараметрыСертификатаСервер()

&НаКлиенте
Функция ШаблонРеквизитовСертификата()
	
	Структура = Новый Структура;
	Структура.Вставить("НаименованиеОрганизацииСубъекта",	"");
	Структура.Вставить("НаименованиеСубъекта",				"");
	Структура.Вставить("НачалоПериодаДействия",				Дата(1,1,1));
	Структура.Вставить("ОкончаниеПериодаДействия",			Дата(1,1,1));
	Структура.Вставить("НаименованиеУдостоверяющегоЦентра",	"");
	Структура.Вставить("Отпечаток",							"");
	Структура.Вставить("Расположение",						"клиент"); // отличет от серверного метода
	Структура.Вставить("ПарольКонтейнера",					"");
	Структура.Вставить("СвойстваСертификата",				Неопределено);
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ПолучитьРеквизитыСертификатаНаСервере(ДанныеАвторизации)
	
	Возврат МодульОбъекта().ПолучитьРеквизитыСертификата_КонтурEDI(ДанныеАвторизации);
	
КонецФункции	

&НаКлиенте
Функция ПолучитьРеквизитыСертификатаНаКлиенте(Отпечаток) Экспорт
	
	РеквизитыСертификата = Неопределено;	
	
	Попытка 
		
		Сертификат = ПолучитьСертификат1СПоОтпечаткуНаКлиенте(Отпечаток);
		РеквизитыСертификата = ПолучитьРеквизиты1ССертификата(Сертификат);
		
	Исключение
		_ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат РеквизитыСертификата;
	
КонецФункции

&НаКлиенте
Функция ПредставлениеСертификатаНаФорме(СвойстваСертификата) Экспорт
	
	ФИО = СокрЛП(Строка(СвойстваСертификата.Субъект.Фамилия) + " " + Строка(СвойстваСертификата.Субъект.Имя) + " " + Строка(СвойстваСертификата.Субъект.Отчество));
	ИНН = СокрЛП(?(ЗначениеЗаполнено(СвойстваСертификата.Субъект.ИННЮЛ), СвойстваСертификата.Субъект.ИННЮЛ, СвойстваСертификата.Субъект.ИНН));
	НаименованиеОрганизацииСубъекта = ?(ЗначениеЗаполнено(СвойстваСертификата.Субъект.Организация), СвойстваСертификата.Субъект.Организация, ФИО); 	
	НаименованиеОрганизацииСубъекта = ?(ЗначениеЗаполнено(НаименованиеОрганизацииСубъекта), НаименованиеОрганизацииСубъекта, "<Неизвестно>");
	
	ДанныеДляЗаполнения = Новый Массив;
	Если ЗначениеЗаполнено(ИНН) Тогда
		ДанныеДляЗаполнения.Добавить("ИНН: " + ИНН);
	Иначе
		ДанныеДляЗаполнения.Добавить("ИНН: <Неизвестно>");			
	КонецЕсли;
	Если ЗначениеЗаполнено(ФИО) Тогда
		ДанныеДляЗаполнения.Добавить(ФИО);
	КонецЕсли;
	Если ЗначениеЗаполнено(СвойстваСертификата.ДатаОкончания) И РассчитатьОсталосьДнейДействияСертификата(СвойстваСертификата.ДатаОкончания) <= 30 Тогда
		ДанныеДляЗаполнения.Добавить("Действует до " + Формат(СвойстваСертификата.ДатаОкончания, "ДЛФ=ДД"));
	КонецЕсли;
	
	Представление = "" + НаименованиеОрганизацииСубъекта + "
	|";
	Для Каждого Строка Из ДанныеДляЗаполнения Цикл
		Представление = Представление + Строка + Символы.ПС;			
	КонецЦикла;
	
	Возврат Представление;
	
КонецФункции


&НаКлиенте
Функция РассчитатьОсталосьДнейДействияСертификата(ОкончаниеПериодаДействия)
	
	Возврат Окр((НачалоДня(ОкончаниеПериодаДействия) - НачалоДня(ТекущаяДата())) / (60*60*24));	
	
КонецФункции

&НаСервере
Функция ПолучитьСвойстваСертификатаНаСервере(ДанныеАвторизации)
	
	Возврат МодульОбъекта().ПолучитьСвойстваСертификата_КонтурEDI(ДанныеАвторизации);
	
КонецФункции

&НаКлиенте
Функция ПолучитьСвойстваСертификатаНаКлиенте(Отпечаток) Экспорт
	
	СвойстваСертификата = Неопределено;	
	
	Попытка 
		
		Сертификат = ПолучитьСертификат1СПоОтпечаткуНаКлиенте(Отпечаток);
		СвойстваСертификата = СвойстваСертификата(Сертификат);
		
	Исключение
		_ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат СвойстваСертификата;	
	
КонецФункции

&НаКлиенте
Функция ПолноеПредставлениеСертификатаПоОтпечатку(Отпечаток, Расположение) Экспорт
	
	Если Расположение = "сервер" Тогда
		ДанныеАвторизацииСертификата = ПолучитьСтруктуруДанныхАвторизации();
		ДанныеАвторизацииСертификата.Отпечаток = Отпечаток;
		ДанныеАвторизацииСертификата.Расположение = Расположение;
		СвойстваСертификата = ПолучитьСвойстваСертификатаНаСервере(ДанныеАвторизацииСертификата);
	Иначе	
		СвойстваСертификата = ПолучитьСвойстваСертификатаНаКлиенте(Отпечаток);
	КонецЕсли;
	
	Представление = "Субъект:
	|
	| Общее имя: " + СвойстваСертификата.Субъект.ОбщееИмя + "
	|
	| Фамилия: " + СвойстваСертификата.Субъект.Фамилия + "
	| Имя: " + СвойстваСертификата.Субъект.Имя + "
	| Отчество: " + СвойстваСертификата.Субъект.Отчество + "
	| 
	| Организация: " + СвойстваСертификата.Субъект.Организация + "
	| Должность: " + СвойстваСертификата.Субъект.Должность + "
	| Подразделение: " + СвойстваСертификата.Субъект.Подразделение + "
	|
	| ИНН: " + СвойстваСертификата.Субъект.ИНН + "
	| ИННЮЛ: " + СвойстваСертификата.Субъект.ИННЮЛ + "
	| ОГРН: " + СвойстваСертификата.Субъект.ОГРН + "
	| ОГРНИП: " + СвойстваСертификата.Субъект.ОГРНИП + "
	| СНИЛС: " + СвойстваСертификата.Субъект.СНИЛС + "
	| 
	| Страна: " + СвойстваСертификата.Субъект.Страна + "
	| Регион: " + СвойстваСертификата.Субъект.Регион + "
	| Населенный пункт: " + СвойстваСертификата.Субъект.НаселенныйПункт + "
	| Улица: " + СвойстваСертификата.Субъект.Улица + "
	|
	| Электронная почта: " + СвойстваСертификата.Субъект.ЭлектроннаяПочта + "
	|
	|
	|Издатель: " + "
	|
	| Общее имя: " + СвойстваСертификата.Издатель.ОбщееИмя + "
	| Организация: " + СвойстваСертификата.Издатель.Организация + "
	| Подразделение: " + СвойстваСертификата.Издатель.Подразделение + "
	|
	| ИНН: " + СвойстваСертификата.Издатель.ИНН + "
	| ИННЮЛ: " + СвойстваСертификата.Издатель.ИННЮЛ + "
	| ОГРН: " + СвойстваСертификата.Издатель.ОГРН + "
	| ОГРН: " + СвойстваСертификата.Издатель.ОГРН + "
	|
	| Страна: " + СвойстваСертификата.Издатель.Страна + "
	| Регион: " + СвойстваСертификата.Издатель.Регион + "
	| Населенный пункт: " + СвойстваСертификата.Издатель.НаселенныйПункт + "
	| Улица: " + СвойстваСертификата.Издатель.Улица + " 
	|
	| Электронная почта: " + СвойстваСертификата.Издатель.ЭлектроннаяПочта + "
	|
	|Назначение: " + СвойстваСертификата.Назначение + "
	|Дата начала: " + ?(ЗначениеЗаполнено(СвойстваСертификата.ДатаНачала), Формат(СвойстваСертификата.ДатаНачала, "ДЛФ=ДД"), "") + "
	|Дата окончания: " + ?(ЗначениеЗаполнено(СвойстваСертификата.ДатаОкончания), Формат(СвойстваСертификата.ДатаОкончания, "ДЛФ=ДД"), "") + "
	|Отпечаток: " + СвойстваСертификата.Отпечаток + "
	|Серийный номер: " + СтрЗаменить(Строка(СвойстваСертификата.СерийныйНомер), " ", "") + "
	|Подписание: " + ?(СвойстваСертификата.Подписание, "Да", "Нет") + "
	|Шифрование: " + ?(СвойстваСертификата.Подписание, "Да", "Нет") + "
	|Расположение: " + ?(СвойстваСертификата.Расположение = "клиент", "локально", "на сервере");
	
	Возврат Представление;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРеквизиты1ССертификата(Сертификат) Экспорт
	
	РеквизитыСертификата = ШаблонРеквизитовСертификата();
	РеквизитыСертификата.СвойстваСертификата = СвойстваСертификата(Сертификат);
	
	НаименованиеОрганизацииСубъекта	= "";
	Если Сертификат.Субъект.Свойство("O") Тогда
		НаименованиеОрганизацииСубъекта = Сертификат.Субъект.O;
	КонецЕсли;
	
	НаименованиеСубъекта = "";
	Если Сертификат.Субъект.Свойство("SN") 
		И Сертификат.Субъект.Свойство("GN") Тогда
		НаименованиеСубъекта = Сертификат.Субъект.SN + " " + Сертификат.Субъект.GN;
	ИначеЕсли Сертификат.Субъект.Свойство("SN") 
		И Сертификат.Субъект.Свойство("G") Тогда
		НаименованиеСубъекта = Сертификат.Субъект.SN + " " + Сертификат.Субъект.G;
	ИначеЕсли Сертификат.Субъект.Свойство("CN") Тогда
		НаименованиеСубъекта = Сертификат.Субъект.CN;
	КонецЕсли;
	
	НаименованиеУдостоверяющегоЦентра = ""; 
	Если Сертификат.Издатель.Свойство("O") Тогда
		НаименованиеУдостоверяющегоЦентра = Сертификат.Издатель.O;
	ИначеЕсли Сертификат.Издатель.Свойство("CN") Тогда
		НаименованиеУдостоверяющегоЦентра = Сертификат.Издатель.CN;
	КонецЕсли;
	
	РеквизитыСертификата.НаименованиеОрганизацииСубъекта 	= НаименованиеОрганизацииСубъекта;
	РеквизитыСертификата.НаименованиеСубъекта 				= НаименованиеСубъекта;
	РеквизитыСертификата.НачалоПериодаДействия 				= Сертификат.ДатаНачала;
	РеквизитыСертификата.ОкончаниеПериодаДействия 			= Сертификат.ДатаОкончания;
	РеквизитыСертификата.НаименованиеУдостоверяющегоЦентра 	= НаименованиеУдостоверяющегоЦентра;
	РеквизитыСертификата.Отпечаток 							= СтрЗаменить(Строка(Сертификат.Отпечаток), " ", "");
	
	Возврат РеквизитыСертификата;	
	
КонецФункции

&НаКлиенте
Функция МассивСертификатовНаКлиенте(ТолькоДействующие = Истина) Экспорт
	
	// TODO тут легаси, надо прибраться
	Если ДанныеАвторизации = Неопределено Тогда
		ДанныеАвторизации = ПолучитьСтруктуруДанныхАвторизации();
	КонецЕсли;
	
	// вернет массив действующих сертификатов
	МассивСертификатов = Новый Массив;
	
	Попытка 
		
		КоллекцияСертификатовХранилища = МодульОбъектаКлиент().Криптография_ПолучитьСертификатыДляПодписиШифрования(ТолькоДействующие);
		
		Для каждого ОписаниеСертификата Из КоллекцияСертификатовХранилища Цикл
			СвойстваСертификата = СвойстваСертификата(ОписаниеСертификата);
			МассивСертификатов.Добавить(СвойстваСертификата);
		КонецЦикла;
		
	Исключение
		_ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат МассивСертификатов;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРеквизитыCOMОбъектаСертификата(COMОбъектСертификата)
	
	РеквизитыСертификата = ШаблонРеквизитовСертификата();
	
	МассивДанныхУЦ = РазложитьСтрокуВМассивСлов_КонтурСВ(COMОбъектСертификата.IssuerName,",");
	Для Каждого Элемент Из МассивДанныхУЦ Цикл
		Если Найти(Элемент,"O=")>0 Тогда 
			НаименованиеУдостоверяющегоЦентра = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Элемент,"O=",""),"""""","|"),"""",""),"|","""");
		КонецЕсли;
	КонецЦикла;
	
	НаименованиеСубъекта = "";
	НаименованиеОрганизацииСубъекта = "";
	МассивДанныхСубъекта = РазложитьСтрокуВМассивСлов_КонтурСВ(COMОбъектСертификата.SubjectName,",");
	Для Каждого Элемент Из МассивДанныхСубъекта Цикл
		Если Найти(Элемент,"CN=")>0 Тогда
			НаименованиеСубъекта = СтрЗаменить(Элемент,"CN=",""); 			
		ИначеЕсли Найти(Элемент,"O=")>0 Тогда 
			НаименованиеОрганизацииСубъекта = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Элемент,"O=",""),"""""","|"),"""",""),"|","""");
		КонецЕсли;
	КонецЦикла;
	
	РеквизитыСертификата.НаименованиеОрганизацииСубъекта = НаименованиеОрганизацииСубъекта;
	РеквизитыСертификата.НаименованиеСубъекта = НаименованиеСубъекта;
	РеквизитыСертификата.НачалоПериодаДействия = COMОбъектСертификата.ValidFromDate;
	РеквизитыСертификата.ОкончаниеПериодаДействия = COMОбъектСертификата.ValidToDate;
	РеквизитыСертификата.НаименованиеУдостоверяющегоЦентра = НаименованиеУдостоверяющегоЦентра;
	РеквизитыСертификата.Отпечаток = COMОбъектСертификата.Thumbprint;
	
	Возврат РеквизитыСертификата;	
	
КонецФункции

&НаСервере
Функция ПолучитьСертификат1СПоОтпечаткуНаСервере(ДанныеАвторизации, ЭкспортСертификата = Ложь) Экспорт
	
	Возврат МодульОбъекта().ПолучитьСертификат1СПоОтпечатку_КонтурEDI(ДанныеАвторизации, ЭкспортСертификата);
	
КонецФункции	

&НаКлиенте
Функция ПолучитьСертификат1СПоОтпечаткуНаКлиенте(Отпечаток, ЭкспортСертификата = Ложь) Экспорт

	СтруктураСертификата = МодульОбъектаКлиент().Криптография_НайтиПоОтпечатку(Отпечаток);
	ТекСертификат = Новый СертификатКриптографии(СтруктураСертификата.ДвоичныеДанные);

	Если ЭкспортСертификата = Ложь Тогда
		Возврат ТекСертификат;
	ИначеЕсли ЭкспортСертификата = Истина Тогда
		Возврат Base64Строка(ТекСертификат.Выгрузить());
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция РасшифроватьЗашифрованныйТокенНаСервере(ЗашифрованныйТокен, ДанныеАвторизации)
	
	Возврат МодульОбъекта().РасшифроватьЗашифрованныйТокен_КонтурEDI(ЗашифрованныйТокен, ДанныеАвторизации);
	
КонецФункции

&НаКлиенте
Функция РасшифроватьЗашифрованныйТокенНаКлиенте(ЗашифрованныйТокен, ПарольКонтейнера)
	

	РасшифрованныеДанные = МодульОбъектаКлиент().Криптография_Расшифровать(ЗашифрованныйТокен, , ПарольКонтейнера);

	Токен = МодульОбъектаКлиент().КонтурСтандарт_Base64Строка(РасшифрованныеДанные);

	Возврат Токен;
	
КонецФункции

&НаКлиенте
Функция СоединениеДД()
	
	Если ТипЗнч(СоединениеДД) = Тип("COMОбъект") Тогда
		Возврат СоединениеДД;
	КонецЕсли;
	
	Сервер = ДиадокСерверAPI_Сервер();
	Прокси = Неопределено;
	Порт = 443;
	ЗащищенноеСоединение = Истина;
	
	СоединениеДД = ПолучитьCOMОбъект("","Microsoft.XMLHTTP");
	
	Возврат СоединениеДД;
	
КонецФункции

&НаСервере
Функция ДиадокСерверAPI_Сервер()
	Возврат МодульОбъекта().ДиадокСерверAPI();
КонецФункции

&НаСервере
Функция ДиадокВебСервер_Сервер()
	Возврат МодульОбъекта().ДиадокСервер();
КонецФункции

//-------------------------------------------------------------------------------------------------
//вспомогательные методы --------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------

&НаКлиенте
Функция ПреобразоватьСтрокуДанныхВДвоичныеДанные(СтрокаДанных)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку("<foo xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" 
	|xmlns:xsd=""http://www.w3.org/2001/XMLSchema"" xsi:type=""xsd:hexBinary"">" + СтрокаДанных + "</foo>");
	ДвоичныеДанныеДокумента = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
	Возврат ДвоичныеДанныеДокумента;
	
КонецФункции // ПреобразоватьСтрокуДанныхВДвоичныеДанные()

&НаКлиенте
Функция РазложитьСтрокуВМассивСлов_КонтурСВ(Знач Строка, РазделителиСлов="")
	
	Слова = Новый Массив;
	
	Для Сч = 1 По СтрДлина(РазделителиСлов) Цикл
		Строка = СтрЗаменить(Строка,Сред(РазделителиСлов,Сч,1),Символы.ПС);
	КонецЦикла;
	
	Для Сч=1 По СтрЧислоСтрок(Строка) Цикл
		ТекСлово = СокрЛП(СтрПолучитьСтроку(Строка,Сч));
		Если ТекСлово<>"" Тогда
			Слова.Добавить(ТекСлово);
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Слова;
	
КонецФункции

&НаКлиенте
Функция BinaryStream(ПутьКФайлу)
	
	Stream = Новый COMОбъект("ADODB.Stream");
	Stream.Type = 1;
	Stream.Open();
	Stream.LoadFromFile(ПутьКФайлу);
	Возврат Stream.Read();
	
КонецФункции


&НаСервере
Функция ДобавкаВремени() Экспорт
	
	Возврат ТекущаяДатаСеанса() - ТекущаяУниверсальнаяДата();
	
КонецФункции 

&НаКлиенте
Функция СвойстваСертификата(Сертификат) Экспорт
	
	ДатыСертификата = ДатыСертификата(Сертификат, ДобавкаВремени());
	
	Свойства = Новый Структура;
	Свойства.Вставить("Отпечаток",      СтрЗаменить(Строка(Сертификат.Отпечаток), " ", ""));
	Свойства.Вставить("Расположение",	"клиент"); // отличие от серверного метода
	Свойства.Вставить("СерийныйНомер",  Сертификат.СерийныйНомер);
	Свойства.Вставить("Субъект",  		СвойстваСубъектаСертификата(Сертификат));
	Свойства.Вставить("Издатель",  		СвойстваИздателяСертификата(Сертификат));
	Свойства.Вставить("ДатаНачала",     ДатыСертификата.ДатаНачала);
	Свойства.Вставить("ДатаОкончания",  ДатыСертификата.ДатаОкончания);
	Свойства.Вставить("ДействителенДо", ДатыСертификата.ДатаОкончания);
	Свойства.Вставить("Назначение",     ПолучитьНазначение(Сертификат));
	Свойства.Вставить("Подписание",     Сертификат.ИспользоватьДляПодписи);
	Свойства.Вставить("Шифрование",     Сертификат.ИспользоватьДляШифрования);
	
	Возврат Свойства;
	
КонецФункции 

&НаКлиенте
Функция ПолучитьНазначение(Сертификат)
	
	Если Не Сертификат.РасширенныеСвойства.Свойство("EKU") Тогда
		Возврат "";
	КонецЕсли;
	
	ФиксированныйМассивСвойств = Сертификат.РасширенныеСвойства.EKU;
	
	Назначение = "";
	
	Для Индекс = 0 По ФиксированныйМассивСвойств.Количество() - 1 Цикл
		Назначение = Назначение + ФиксированныйМассивСвойств.Получить(Индекс);
		Назначение = Назначение + Символы.ПС;
	КонецЦикла;
	
	Возврат ПодготовитьСтроку(Назначение);
	
КонецФункции

&НаКлиенте
Функция ДатыСертификата(Сертификат, ДобавкаВремени) Экспорт
	
	ДатыСертификата = Новый Структура;
	ДатыСертификата.Вставить("ДатаНачала",    Сертификат.ДатаНачала    + ДобавкаВремени);
	ДатыСертификата.Вставить("ДатаОкончания", Сертификат.ДатаОкончания + ДобавкаВремени);
	
	Возврат ДатыСертификата;
	
КонецФункции

&НаКлиенте
Функция СвойстваИздателяСертификата(Сертификат) Экспорт
	
	Издатель = Сертификат.Издатель;
	
	Свойства = Новый Структура;
	Свойства.Вставить("ОбщееИмя");
	Свойства.Вставить("Страна");
	Свойства.Вставить("Регион");
	Свойства.Вставить("НаселенныйПункт");
	Свойства.Вставить("Улица");
	Свойства.Вставить("Организация");
	Свойства.Вставить("Подразделение");
	Свойства.Вставить("ЭлектроннаяПочта");
	Свойства.Вставить("ОГРН");
	Свойства.Вставить("ИНН");
	Свойства.Вставить("ИННЮЛ");
	
	Если Издатель.Свойство("CN") Тогда
		Свойства.ОбщееИмя = ПодготовитьСтроку(Издатель.CN);
	КонецЕсли;
	
	Если Издатель.Свойство("C") Тогда
		Свойства.Страна = ПодготовитьСтроку(Издатель.C);
	КонецЕсли;
	
	Если Издатель.Свойство("ST") Тогда
		Свойства.Регион = ПодготовитьСтроку(Издатель.ST);
	КонецЕсли;
	
	Если Издатель.Свойство("L") Тогда
		Свойства.НаселенныйПункт = ПодготовитьСтроку(Издатель.L);
	КонецЕсли;
	
	Если Издатель.Свойство("Street") Тогда
		Свойства.Улица = ПодготовитьСтроку(Издатель.Street);
	КонецЕсли;
	
	Если Издатель.Свойство("O") Тогда
		Свойства.Организация = ПодготовитьСтроку(Издатель.O);
	КонецЕсли;
	
	Если Издатель.Свойство("OU") Тогда
		Свойства.Подразделение = ПодготовитьСтроку(Издатель.OU);
	КонецЕсли;
	
	Если Издатель.Свойство("E") Тогда
		Свойства.ЭлектроннаяПочта = ПодготовитьСтроку(Издатель.E);
	КонецЕсли;
	
	Если Издатель.Свойство("OGRN") Тогда
		Свойства.ОГРН = ПодготовитьСтроку(Издатель.OGRN);
	ИначеЕсли Издатель.Свойство("OID1_2_643_100_1") Тогда
		Свойства.ОГРН = ПодготовитьСтроку(Издатель.OID1_2_643_100_1);
	КонецЕсли;
	
	ЗаполнитьИНН(Свойства, Издатель);
	
	Возврат Свойства;
	
КонецФункции

&НаКлиенте
Функция СвойстваСубъектаСертификата(Сертификат) Экспорт
	
	Субъект = Сертификат.Субъект;
	
	Свойства = Новый Структура;
	Свойства.Вставить("Страна");
	Свойства.Вставить("Регион");
	Свойства.Вставить("НаселенныйПункт");
	Свойства.Вставить("Улица");
	Свойства.Вставить("Подразделение");
	Свойства.Вставить("ЭлектроннаяПочта");
	Свойства.Вставить("ОГРН");
	Свойства.Вставить("ОГРНИП");
	Свойства.Вставить("СНИЛС");
	Свойства.Вставить("ИНН");
	Свойства.Вставить("Фамилия");
	Свойства.Вставить("Имя");
	Свойства.Вставить("Отчество");
	Свойства.Вставить("Должность");
	Свойства.Вставить("Организация");
	Свойства.Вставить("ОбщееИмя");
	Свойства.Вставить("ИННЮЛ");
	
	Если Субъект.Свойство("CN") Тогда
		Свойства.ОбщееИмя = ПодготовитьСтроку(Субъект.CN);
	КонецЕсли;
	
	Если Субъект.Свойство("C") Тогда
		Свойства.Страна = ПодготовитьСтроку(Субъект.C);
	КонецЕсли;
	
	Если Субъект.Свойство("ST") Тогда
		Свойства.Регион = ПодготовитьСтроку(Субъект.ST);
	КонецЕсли;
	
	Если Субъект.Свойство("L") Тогда
		Свойства.НаселенныйПункт = ПодготовитьСтроку(Субъект.L);
	КонецЕсли;
	
	Если Субъект.Свойство("Street") Тогда
		Свойства.Улица = ПодготовитьСтроку(Субъект.Street);
	КонецЕсли;
	
	Если Субъект.Свойство("O") Тогда
		Свойства.Организация = ПодготовитьСтроку(Субъект.O);
	КонецЕсли;
	
	Если Субъект.Свойство("OU") Тогда
		Свойства.Подразделение = ПодготовитьСтроку(Субъект.OU);
	КонецЕсли;
	
	Если Субъект.Свойство("E") Тогда
		Свойства.ЭлектроннаяПочта = ПодготовитьСтроку(Субъект.E);
	КонецЕсли;
	
	Если Субъект.Свойство("OGRN")Тогда
		Свойства.ОГРН = ПодготовитьСтроку(Субъект.OGRN);
		
	ИначеЕсли Субъект.Свойство("OID1_2_643_100_1") Тогда
		Свойства.ОГРН = ПодготовитьСтроку(Субъект.OID1_2_643_100_1);
	КонецЕсли;
	
	Если Субъект.Свойство("OGRNIP") Тогда
		Свойства.ОГРНИП = ПодготовитьСтроку(Субъект.OGRNIP);
		
	ИначеЕсли Субъект.Свойство("OID1_2_643_100_5") Тогда
		Свойства.ОГРНИП = ПодготовитьСтроку(Субъект.OID1_2_643_100_5);
	КонецЕсли;
	
	Если Субъект.Свойство("SNILS") Тогда
		Свойства.СНИЛС = ПодготовитьСтроку(Субъект.SNILS);
		
	ИначеЕсли Субъект.Свойство("OID1_2_643_100_3") Тогда
		Свойства.СНИЛС = ПодготовитьСтроку(Субъект.OID1_2_643_100_3);
	КонецЕсли;
	
	ЗаполнитьИНН(Свойства, Субъект);
	
	Если Субъект.Свойство("CN") Тогда
		Свойства.ОбщееИмя = ПодготовитьСтроку(Субъект.CN);
	КонецЕсли;
	
	Если Субъект.Свойство("O") Тогда
		Свойства.Организация = ПодготовитьСтроку(Субъект.O);
	КонецЕсли;
	
	Если Субъект.Свойство("SN") Тогда // Наличие фамилии (обычно для должностного лица).
		
		// Извлечение ФИО из поля SN и GN.
		Свойства.Фамилия = ПодготовитьСтроку(Субъект.SN);
		
		Если Субъект.Свойство("GN") Тогда
			Отчество = ПодготовитьСтроку(Субъект.GN);
			Позиция = Найти(Отчество, " ");
			Если Позиция = 0 Тогда
				Свойства.Имя = Отчество;
			Иначе
				Свойства.Имя = Лев(Отчество, Позиция - 1);
				Свойства.Отчество = ПодготовитьСтроку(Сред(Отчество, Позиция + 1));
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Свойства.ОГРНИП)    // Признак индивидуального предпринимателя.
		Или Субъект.Свойство("T")                 // Признак должностного лица.
		Или Субъект.Свойство("OID2_5_4_12")       // Признак должностного лица.
		Или ЗначениеЗаполнено(Свойства.СНИЛС)     // Признак физического лица.
		Или ЭтоИННФизЛица(Свойства.ИНН) И НЕ ЗначениеЗаполнено(Свойства.ИННЮЛ) Тогда // Признак физического лица.
		
		Если Свойства.ОбщееИмя <> Свойства.Организация
			И Не (Субъект.Свойство("T")           И Свойства.ОбщееИмя = ПодготовитьСтроку(Субъект.T))
			И Не (Субъект.Свойство("OID2_5_4_12") И Свойства.ОбщееИмя = ПодготовитьСтроку(Субъект.OID2_5_4_12)) Тогда
			
			// Извлечение ФИО из поля CN.
			Массив = МодульОбъектаКлиент().EDI_РазложитьСтрокуВМассивСлов(Свойства.ОбщееИмя, " ");
			
			Если Массив.Количество() < 4 Тогда
				Если Массив.Количество() > 0 Тогда
					Свойства.Фамилия = СокрЛП(Массив[0]);
				КонецЕсли;
				Если Массив.Количество() > 1 Тогда
					Свойства.Имя = СокрЛП(Массив[1]);
				КонецЕсли;
				Если Массив.Количество() > 2 Тогда
					Свойства.Отчество = СокрЛП(Массив[2]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Свойства.Фамилия) Или ЗначениеЗаполнено(Свойства.Имя) Тогда
		Если Субъект.Свойство("T") Тогда
			Свойства.Должность = ПодготовитьСтроку(Субъект.T);
			
		ИначеЕсли Субъект.Свойство("OID2_5_4_12") Тогда
			Свойства.Должность = ПодготовитьСтроку(Субъект.OID2_5_4_12);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Свойства;
	
КонецФункции

&НаКлиенте
Функция ЭтоИННФизЛица(ИНН)
	
	Если СтрДлина(ИНН) <> 12 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для НомерСимвола = 1 По 12 Цикл
		Если Найти("0123456789", Сред(ИНН,НомерСимвола,1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если Найти(ИНН, "00") = 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИНН(Свойства, Данные)
	
	ИННЮЛ = Неопределено;
	ИНН = Неопределено;
	
	Если Данные.Свойство("INN") Тогда
		ИНН = Данные.INN;
	ИначеЕсли Данные.Свойство("OID1_2_643_3_131_1_1") Тогда
		ИНН = ПодготовитьСтроку(Данные.OID1_2_643_3_131_1_1);
	КонецЕсли;
	
	Если Данные.Свойство("INNLE") Тогда
		ИННЮЛ = Данные.INNLE;
	ИначеЕсли Данные.Свойство("OID1_2_643_100_4")
		И СтрДлина(Данные.OID1_2_643_100_4) = 10 Тогда
		ИННЮЛ = ПодготовитьСтроку(Данные.OID1_2_643_100_4);
	ИначеЕсли Данные.Свойство("_1_2_643_100_4") Тогда
		ИННЮЛ = ПодготовитьСтроку(Данные._1_2_643_100_4);
	КонецЕсли;
	
	Свойства.ИННЮЛ = ИННЮЛ;
	Свойства.ИНН = ИНН;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьСтроку(СтрокаИзСертификата)
	
	Возврат ЗаменитьНедопустимыеСимволыXML(СтрокаИзСертификата);
	
КонецФункции
&НаКлиенте
Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ") Экспорт
	
	ПозицияНачала = 1;
	Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
	Пока Позиция > 0 Цикл
		НедопустимыйСимвол = Сред(Текст, Позиция, 1);
		Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
		ПозицияНачала = Позиция + СтрДлина(СимволЗамены);
		Если ПозицияНачала > СтрДлина(Текст) Тогда
			Прервать;
		КонецЕсли;
		Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции
