&НаСервере
Перем МодульОбъекта;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули();
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаКлиенте
Процедура Ок(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если ПарольВведенКорректно() Тогда
		Закрыть(Истина);
	Иначе
		Элементы.ДекорацияНеправильныйПароль.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПарольВведенКорректно()
	
	Если ВводимыйПароль = ТекущийПароль ИЛИ (ИспользоватьУниверсальныйПароль И ВводимыйПароль = "******") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура Отмена(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПароль = Параметры.ТекущийПароль;
	ИспользоватьУниверсальныйПароль = Параметры.ИспользоватьУниверсальныйПароль;
	
	Элементы.ДекорацияЛогин.Заголовок = "Учетная запись: " + Параметры.Логин;	
	Элементы.ВводимыйПароль.КартинкаКнопкиВыбора = Элементы.КартинкаГлазОткрыт.Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводимыйПарольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПарольПользователя = Элемент.ТекстРедактирования;
	
	СменитьРежимОтображенияПароля();

	ВводимыйПароль = ПарольПользователя;
	
	Если Элемент.РежимПароля Тогда
		Элемент.КартинкаКнопкиВыбора = Элементы.КартинкаГлазОткрыт.Картинка;
	Иначе
		Элемент.КартинкаКнопкиВыбора = Элементы.КартинкаГлазЗакрыт.Картинка;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СменитьРежимОтображенияПароля()
	
	Элементы.ВводимыйПароль.РежимПароля = Не Элементы.ВводимыйПароль.РежимПароля;
	
КонецПроцедуры

