&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаКлиенте
Перем МодульОбъектаКлиент;

&НаКлиенте
Перем МодульОбменКлиент;

&НаКлиенте
Перем КэшОсновногоМодуля;


&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция ОсновнойМодуль() Экспорт
	
	Если КэшОсновногоМодуля = Неопределено Тогда 
		КэшОсновногоМодуля = ВладелецФормы;
	КонецЕсли;
	
	Возврат КэшОсновногоМодуля;
	
КонецФункции

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта = Неопределено Тогда
		КэшМодуляОбъекта = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	ПутьКФорме = ПутьКФормеМодуляКлиента();
	
	Результат = ОткрытьФорму(ПутьКФорме);
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

&НаКлиенте
Функция МодульОбменКлиент()
	
	Если ТипЗнч(МодульОбменКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбменКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбменКлиент = ОсновнаяФорма.МодульОбменКлиент();
		Возврат МодульОбменКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции
  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ДанныеАвторизации", ДанныеАвторизации);
	Параметры.Свойство("ИдентификаторОрганизацииДиадок", ИдентификаторОрганизацииДиадок);
	Параметры.Свойство("ИдентификаторПользователя", ИдентификаторПользователя);
	Параметры.Свойство("ИдентификаторЯщикаДиадок", ИдентификаторЯщикаДиадок);
	
	МассивДоверенностей = Неопределено;
	Параметры.Свойство("СписокДоверенностей", МассивДоверенностей);
	
	Параметры.Свойство("Контекст", Контекст);
	Параметры.Свойство("РеквизитыСертификата", РеквизитыСертификата);
	
	ЗаполнитьПредставлениеСертификата();
	
	Если МассивДоверенностей.Количество() > 0 Тогда
		ЗаполнитьДоверенности(МассивДоверенностей);
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаИнформации;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СписокСохраненныхДоверенностей()
	Возврат МодульОбъекта().СписокСохраненныхДоверенностей();
КонецФункции

&НаСервере
Процедура ЗаполнитьПредставлениеСертификата()
	
	Если НЕ ЗначениеЗаполнено(РеквизитыСертификата) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСубъекта = ?(ЗначениеЗаполнено(РеквизитыСертификата.НаименованиеСубъекта), РеквизитыСертификата.НаименованиеСубъекта + " до ", "< Неизвестно > до "); 
	ТекстОкончанияПериода = ?(ЗначениеЗаполнено(РеквизитыСертификата.ОкончаниеПериодаДействия), Формат(РеквизитыСертификата.ОкончаниеПериодаДействия, "ДЛФ=ДД"), "< Неизвестно ");
	
	ПредставлениеСертификата = ТекстСубъекта + ТекстОкончанияПериода;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоверенности(МассивДоверенностей)
	
	Для Каждого ДоверенностьНазначеннаяСотруднику Из МассивДоверенностей Цикл
		
		Доверенность = ДоверенностьНазначеннаяСотруднику.МашиночитаемаяДоверенность; 
		ПоУмолчанию = ДоверенностьНазначеннаяСотруднику.ПоУмолчанию;
		
		НоваяСтрокаДоверенность = Доверенности.Добавить();
		
		НоваяСтрокаДоверенность.Доверенность = Доверенность; 
		НоваяСтрокаДоверенность.ПоУмолчанию = ПоУмолчанию;
		
		НоваяСтрокаДоверенность.ПредставлениеНаФорме = МодульОбъекта().Представление_МашиночитаемаяДоверенность_ФормаСписка(Доверенность);  
		
		НоваяСтрокаДоверенность.Картинка = Истина;
		НоваяСтрокаДоверенность.Статус = "";
		НоваяСтрокаДоверенность.КритичныйСтатус = Ложь;
		
	КонецЦикла;
	
	Доверенности.Сортировать("ПоУмолчанию Убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработкаВыбораДоверенности();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностиИнформацияВыбор(Доверенность)

	ПараметрыФормы = ПараметрыФормыИнформацииОДоверенности(Доверенность);
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сервис_ПодробнаяИнформация_Управляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослеЗакрытияИнформацииМЧД", ЭтаФорма);	
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыИнформацииОДоверенности(Доверенность)
	
	ПредставлениеДоверенностиТабличныйДокумент = МодульОбъекта().Представление_МашиночитаемаяДоверенность_ТабличныйДокумент(Доверенность);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",	"Данные МЧД");
	ПараметрыФормы.Вставить("ПодробнаяИнформацияТабличныйДокумент", ПредставлениеДоверенностиТабличныйДокумент);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикПослеЗакрытияИнформацииМЧД(Параметр1, Параметр2 = Неопределено) Экспорт
КонецПроцедуры

&НаКлиенте
Функция ИнициализироватьСтруктуруРезультатаФункции()
	
	Возврат Новый Структура("Успешно, ОписаниеОшибки", Ложь, "");

КонецФункции

&НаКлиенте
Процедура Выбрать(Команда)
	
	НоваяМетрика().Категория("ДоверенностиСписок_Управляемая").Выбор("Доверенность").НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
	ОбработкаВыбораДоверенности();
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработкаВыбораДоверенности()
	
	ВыбраннаяСтрока = Элементы.Доверенности.ТекущиеДанные; 
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Новый_Доверенность = ВыбраннаяСтрока.Доверенность;
	ЭтаФорма.Закрыть(Новый_Доверенность);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НоваяМетрика().Категория("ДоверенностиСписок_Управляемая").ОткрытаФорма(ЭтаФорма)
					.Метка(Доверенности.Количество()).ПоместитьВОчередь();
					
	ДозаполнитьСтатусыДоверенностей();
	
	УстановитьТекущуюСтроку();

КонецПроцедуры

&НаКлиенте
Процедура ДозаполнитьСтатусыДоверенностей()
	
	Если ДанныеАвторизации.Расположение = "сервер" Тогда
		Сертификат = МодульОбменКлиент().ПолучитьСертификат1СПоОтпечаткуНаСервере(ДанныеАвторизации, Истина);
	Иначе // клиент	
		Сертификат = МодульОбменКлиент().ПолучитьСертификат1СПоОтпечаткуНаКлиенте(ДанныеАвторизации.Отпечаток, Истина);
	КонецЕсли;
	
	Для Каждого СтрокаДоверенности Из Доверенности Цикл
		
		Доверенность = СтрокаДоверенности.Доверенность;
		
		СоставнойИдентификаторМЧД = Доверенность.СоставнойИдентификатор;
		
		РезультатПроверкиМашиночитаемойДоверенности = МодульОбменКлиент().ПредварительнаяПроверкаМЧД(ДанныеАвторизации, ИдентификаторЯщикаДиадок, СоставнойИдентификаторМЧД, Сертификат);
		
		Статус = РезультатПроверкиМашиночитаемойДоверенности.СтатусПроверки.ТекстСтатуса;
		СтатусId = РезультатПроверкиМашиночитаемойДоверенности.СтатусПроверки.ТекстовыйИдентификаторСтатуса;
		
		СтрокаДоверенности.Статус = Статус;
		СтрокаДоверенности.КритичныйСтатус = СтатусId <> "IsValid";

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюСтроку()
	
	Если Не ЗначениеЗаполнено(ДанныеАвторизации.Доверенность) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДоверенности Из Доверенности Цикл
	
		Если ДоверенностиИдентичны(ДанныеАвторизации.Доверенность, СтрокаДоверенности.Доверенность) Тогда
			Элементы.Доверенности.ТекущаяСтрока = СтрокаДоверенности.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДоверенностиИдентичны(Доверенность1, Доверенность2)
	
	Если ЗначениеВСтрокуВнутр(Доверенность1) = ЗначениеВСтрокуВнутр(Доверенность2) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Информация(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	ТекущиеДанные = Элементы.Доверенности.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоверенностиИнформацияВыбор(ТекущиеДанные.Доверенность);
	
КонецПроцедуры

&НаКлиенте
Процедура БезДоверенности(Команда)
	
	НоваяМетрика().Категория("ДоверенностиСписок_Управляемая").НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();
	Доверенность = Неопределено;
    ЭтаФорма.Закрыть(Доверенность);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "ДоверенностиСписок_Управляемая");
		
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлДоверенности(Команда)
	
	НоваяМетрика().Категория("ДоверенностиСписок_Управляемая").Выбор("ВыборФайлаДоверенности").НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("Заголовок",	"Выберите файлы доверенности");
	ПараметрыФормы.Вставить("ПредставлениеСертификата", ПредставлениеСертификата);
	ПараметрыФормы.Вставить("ДанныеАвторизации", ДанныеАвторизации);
	ПараметрыФормы.Вставить("ИдентификаторОрганизацииДиадок", ИдентификаторОрганизацииДиадок);
	ПараметрыФормы.Вставить("ИдентификаторПользователя", ИдентификаторПользователя);
	ПараметрыФормы.Вставить("ИдентификаторЯщикаДиадок", ИдентификаторЯщикаДиадок);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ДоверенностиФормаВыбораФайла_Управляемая", , ПараметрыФормы, ЭтаФорма, "ПослеВыбораФайлаДоверенности", ЭтаФорма);	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораФайлаДоверенности(Новый_Доверенность, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Новый_Доверенность = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(Новый_Доверенность);
	
КонецПроцедуры




















































