&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;


// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ



// ОБРАБОТЧИКИ СОБЫТИЙ {

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "Сервис_ОбновлениеУправляемая");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "Сервис_ОбновлениеУправляемая");
		
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	Параметры.Свойство("КонтекстОбновленияПоставки", КонтекстОбновленияПоставки);
	
	ОбновитьФорму();
		
КонецПроцедуры

&НаКлиенте
Процедура СправкаОВерсии(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ЭтаФорма.ОткрытьСправкуФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбновление(Команда)
	
	МассивОшибок = ВозможноОбновитьМодульАвтоматически();
	
	Если МассивОшибок.Количество() Тогда
		ТекстПредупреждения = "Автоматическая установка невозможна по следующим причинам:";
		Для Каждого Ошибка Из МассивОшибок Цикл
			ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + "- " + Ошибка;	
		КонецЦикла;
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	НоваяМетрика().Категория("Обновление").НажатаКнопка(Команда).ПоместитьВОчередь();
	
	ТекстВопроса = "Будет установлено обновление модуля EDI до версии " + КонтекстОбновленияПоставки.Модуль.НоваяВерсия;
	
	Если НЕ КонтекстОбновленияПоставки.Модуль.ТипКонтента = "epf" Тогда
		
		ТекстВопроса = ТекстВопроса + " в виде расширения. Рекомендуется сделать резервную копию базы перед установкой.";	
		
	КонецЕсли;
	
	МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI("УстановитьОбновлениеФрагмент",ЭтаФорма,,ТекстВопроса,РежимДиалогаВопрос.ОКОтмена);

КонецПроцедуры

&НаКлиенте
Функция ВозможноОбновитьМодульАвтоматически()
	
	МассивОшибок = Новый Массив;
	
	РасположениеМодуля = МодульОбъектаКлиент().ПеречисленияEDI_ВариантыРасположенияМодуля();
	
	КонтекстОбновленияМодуля = КонтекстОбновленияПоставки.Модуль; 
	
	Если КонтекстОбновленияМодуля.Расположение = РасположениеМодуля.Конфигурация Тогда
		МассивОшибок.Добавить("Обработка должна быть открыта из следующего источника: справочник внешних обработок, файл или расширение");
	КонецЕсли;
	
	Если КонтекстОбновленияМодуля.Расположение = РасположениеМодуля.Файл Тогда
		ТекстОшибки = МодульОбъектаКлиент().ПроверитьВозможностьОбновленияФайлаМодуля(КонтекстОбновленияМодуля.ПутьКМодулю);
	ИначеЕсли КонтекстОбновленияМодуля.Расположение = РасположениеМодуля.Справочник Тогда
		ТекстОшибки = МодульОбъектаКлиент().ПроверитьВозможностьОбновленияЭлементаСправочникаМодуля(КонтекстОбновленияМодуля.ПутьКМодулю);
	ИначеЕсли КонтекстОбновленияМодуля.Расположение = РасположениеМодуля.Расширение Тогда
		ТекстОшибки = МодульОбъектаКлиент().ПроверитьВозможностьОбновленияРасширенияEDI(КонтекстОбновленияМодуля.НоваяВерсия, КонтекстОбновленияМодуля.ТипКонтента);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		МассивОшибок.Добавить(ТекстОшибки);
		МодульОбъектаКлиент().Метрика_ОбновлениеМодуля(КонтекстОбновленияМодуля, ТекстОшибки);
	КонецЕсли;
	
	Возврат МассивОшибок;

КонецФункции

&НаКлиенте
Процедура УстановитьОбновлениеФрагмент(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат;	
	КонецЕсли;
	
	РезультатУстановки = УстановитьОбновлениеЗавершение();
	
	Если РезультатУстановки.Успешно Тогда
		Если НЕ КонтекстОбновленияПоставки.Модуль.ТипКонтента = "epf" Тогда
			ТекстПредупреждения = "Обновление выполнено успешно, перезапустите программу";	
		Иначе
			ТекстПредупреждения = "Обновление выполнено успешно, перезапустите модуль";
		КонецЕсли;	
	Иначе
		ТекстПредупреждения = РезультатУстановки.Ошибка;	
	КонецЕсли;
	
	МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОписаниеОбновления(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ОткрытьОписаниеОбновленияКлиент(КонтекстОбновленияПоставки.Модуль.ОписаниеОбновления);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВерсийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = СписокВерсий.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если Поле.Имя = "СписокВерсийОписание" Тогда 		
		ОткрытьОписаниеОбновленияКлиент(ДанныеСтроки.СсылкаНаОписание);
	ИначеЕсли Поле.Имя = "СписокВерсийСкачать" Тогда
		Если ЗначениеЗаполнено(ДанныеСтроки.Версия) Тогда
			СкачатьОбновление(ДанныеСтроки.Версия, КонтекстОбновленияПоставки.Модуль.ТипКонтента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьСписокВерсий(Команда)
	
	НоваяМетрика().Категория("Обновление").НажатаКнопка(Команда).ПоместитьВОчередь();
	
	ТаблицаВерсийВидима = Элементы.ГруппаТаблицаВерсийСЗагрузкой.Видимость;
	
	Если ТаблицаВерсийВидима Тогда
		Элементы.ОткрытьСписокВерсийКнопка.Заголовок = "Посмотреть список всех версий";
		ОбновитьСлужебнуюИнформацию();
	Иначе
		Элементы.ОткрытьСписокВерсийКнопка.Заголовок = "Вернуться к информации об обновлении";
	КонецЕсли;
	
	Элементы.ГруппаТаблицаВерсийСЗагрузкой.Видимость = НЕ ТаблицаВерсийВидима;
	Элементы.ГруппаИнформацияОНовойВерсии.Видимость = ТаблицаВерсийВидима;
	Элементы.ГруппаСлужебнаяИнформация.Видимость = ТаблицаВерсийВидима;
	
	Если КонтекстОбновленияПоставки.СистемаХранения.ЕстьОбновление Тогда
		
		Элементы.ГруппаСкачатьФайлСистемыХранения.Видимость = ТаблицаВерсийВидима;	
		
	КонецЕсли;
	
	Если КонтекстОбновленияПоставки.Модуль.ЕстьОбновление Тогда
		Элементы.ГруппаУстановкаОбновления.Видимость = ТаблицаВерсийВидима;
	КонецЕсли;
		
	Если НЕ СписокВерсийИнициализирован Тогда
		Элементы.ГруппаСтатусЗагрузки.Видимость = Истина;
		ОтобразитьСтатусЗагрузки();
		ПодключитьОбработчикОжидания("ЗаполнитьСписокВерсийКлиент", 1, Истина);
		СписокВерсийИнициализирован = Истина;		
	КонецЕсли;
	
КонецПроцедуры

// } ОБРАБОТЧИКИ СОБЫТИЙ


&НаСервере
Процедура ОбновитьФорму() Экспорт
		
	ПроверитьНаличиеОбновления();
	
	ОбновитьСлужебнуюИнформацию();
				
КонецПроцедуры

&НаСервере
Процедура ОбновитьСлужебнуюИнформацию()
	
	АдресКартинкиУспешно = МодульОбъекта().ПолучитьКартинкуEDI("ЭлементФормы", "КартинкаГалочка", Истина);
	АдресКартинкиПредупреждение = МодульОбъекта().ПолучитьКартинкуEDI("ЭлементФормы", "КартинкаВосклицание", Истина);
	
	ПризнакМодифицированностиМодуля = МодульОбъекта().ПеречисленияEDI_ПризнакиМодифицированностиКонтента();    
	КонтекстОбновленияМодуля = КонтекстОбновленияПоставки.Модуль;
	
	Если КонтекстОбновленияМодуля.Модифицированность = ПризнакМодифицированностиМодуля.НеИзменен Тогда
		
		АдресКартинкиМодифицированность = АдресКартинкиУспешно;
		Элементы.НадписьМодифицированность.Заголовок = "Используется типовая версия модуля";
		
	Иначе
		
		АдресКартинкиМодифицированность = АдресКартинкиПредупреждение;
		
		Если КонтекстОбновленияМодуля.Модифицированность = ПризнакМодифицированностиМодуля.Изменен Тогда 
			
			Элементы.НадписьМодифицированность.Заголовок = "В исходный файл модуля были внесены изменения";
			
		Иначе    
			
			Элементы.НадписьМодифицированность.Заголовок = "Не удалось определить контрольную сумму модуля для проверки наличия изменений"; 
			
		КонецЕсли;
	КонецЕсли;
	
	РасположениеМодуля = МодульОбъекта().ПеречисленияEDI_ВариантыРасположенияМодуля(); 
	
	Если КонтекстОбновленияМодуля.Расположение = РасположениеМодуля.Справочник Тогда  
		
		Элементы.НадписьРежимРаботы.Заголовок = "Модуль запущен из справочника внешних обработок";
		АдресКартинкиРежимРаботы = АдресКартинкиУспешно; 
		
	ИначеЕсли КонтекстОбновленияМодуля.Расположение = РасположениеМодуля.Файл Тогда
		
		Элементы.НадписьРежимРаботы.Заголовок = "Модуль запущен из файла";
		АдресКартинкиРежимРаботы = АдресКартинкиУспешно; 
		
	ИначеЕсли КонтекстОбновленияМодуля.Расположение = РасположениеМодуля.Расширение Тогда	
		
		Элементы.НадписьРежимРаботы.Заголовок = "Модуль запущен из расширения";		
		АдресКартинкиРежимРаботы = АдресКартинкиУспешно; 
		
	Иначе 
		
		Элементы.НадписьРежимРаботы.Заголовок = "Для обновления модуля необходимо запустить его из файла, справочника внешних обработок или расширения";	
		АдресКартинкиРежимРаботы = АдресКартинкиПредупреждение;
		Элементы.УстановитьОбновление.ЦветТекста = WindowsЦвета.ТекстНедоступный; 
		
	КонецЕсли;
	
	Если КонтекстОбновленияПоставки.СистемаХранения.ЕстьОбновление Тогда
		
		Элементы.НадписьСистемаХраненияАктуальна.Заголовок = "Доступно обновление системы хранения до новой версии";
		АдресКартинкиСистемаХраненияАктуальна = АдресКартинкиПредупреждение;
		Элементы.ГруппаСкачатьФайлСистемыХранения.Видимость = Истина;      
		
	Иначе                                                                                         
		
		Элементы.НадписьСистемаХраненияАктуальна.Заголовок = "Используется последняя версия системы хранения";
		АдресКартинкиСистемаХраненияАктуальна = АдресКартинкиУспешно;
		Элементы.ГруппаСкачатьФайлСистемыХранения.Видимость = Ложь;	  
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеОбновления()
	                                   
	КонтекстОбновленияПоставки = МодульОбъекта().КонтекстОбновленияПоставки_КонтурEDI();
	МодульОбъекта().ДополнитьКонтекстОбновленияСистемыХраненияИзСервиса_КонтурEDI(КонтекстОбновленияПоставки.СистемаХранения);
	
	КонтекстОбновленияМодуля = КонтекстОбновленияПоставки.Модуль;
	
	Если КонтекстОбновленияМодуля.ЕстьОбновление Тогда
		
		ДатаВыходаОбновления = КонтекстОбновленияМодуля.ДатаРелизаОбновления;
		НомерРелизаОбновления = КонтекстОбновленияМодуля.НоваяВерсия;
		
		ШаблонИнформации = "Доступно обновление до версии %1 (от %2)";
		ИнформацияОбОбновлении = МодульОбъекта().ПодставитьПараметрыВСтроку_КонтурEDI(ШаблонИнформации, 
																					НомерРелизаОбновления, 
																					ДатаВыходаОбновления);
		
		Элементы.ОткрытьОписаниеОбновления.Заголовок = "Открыть описание обновления";
		
	Иначе
		ИнформацияОбОбновлении = "Используется последняя версия модуля";
		Элементы.ОткрытьОписаниеОбновления.Видимость = Ложь;
		Элементы.ГруппаУстановкаОбновления.Видимость = Ложь;
	КонецЕсли;
	
	
	Элементы.ИнформацияОбОбновлении.Заголовок = ИнформацияОбОбновлении;  
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСтатусЗагрузки(ВозниклаОшибка = Ложь)
	
	Если ВозниклаОшибка Тогда
		Элементы.НадписьЗагрузка.Заголовок = "Не удалось загрузить список версий с сервера";
		Элементы.НадписьЗагрузка.ЦветТекста = WebЦвета.Красный;
		АдресКартинкиЗагрузки = МодульОбъекта().ПолучитьКартинкуEDI("ЭлементФормы", "КартинкаПредупреждение", Истина);	
	Иначе
		АдресКартинкиЗагрузки = МодульОбъекта().ПолучитьКартинкуEDI("ЭлементФормы", "КартинкаЗагрузка2", Истина);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьОбновлениеЗавершение()
	
	СтруктураРезультата = Новый Структура("Успешно, Ошибка", Ложь, "");
	КонтекстОбновленияМодуля = КонтекстОбновленияПоставки.Модуль;
	
	Попытка
		МодульОбъектаКлиент().ВыполнитьОбновлениеМодуля(КонтекстОбновленияМодуля);
		СтруктураРезультата.Успешно = Истина;
	Исключение
		Ошибка = ОписаниеОшибки();                                                                                                                              
		СтруктураРезультата.Ошибка = Ошибка;
		МодульОбъектаКлиент().Метрика_ОбновлениеМодуля(КонтекстОбновленияМодуля, Ошибка);
	КонецПопытки;
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСписокВерсийКлиент() Экспорт
	
	ЗаполнитьСписокВерсийСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОписаниеОбновленияКлиент(Ссылка)
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ЗапуститьПриложение(Ссылка);
	Иначе
		ТекстПредупреждения = "Для данной версии в текущей момент описание еще не создано!";
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВерсийСервер()
	
	СписокВерсий.Очистить();
	
	РезультатПолучения = МодульОбъекта().ПолучитьСписокВерсийОтСервисаОбновлений();
	Если НЕ РезультатПолучения.Успешно Тогда
		ОтобразитьСтатусЗагрузки(Истина);
		Возврат;
	КонецЕсли;
	
	МодульУстановленВРасширении = (КонтекстОбновленияПоставки.Модуль.ТипКонтента <> "epf");

	Для Каждого СтрокаВерсийОтСервиса Из РезультатПолучения.ТаблицаВерсий Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаВерсийОтСервиса.НомерВерсии) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если МодульУстановленВРасширении 
			И НЕ МодульОбъекта().ВерсияПрограмногоПродуктаРавнаИлиВыше(СтрокаВерсийОтСервиса.НомерВерсии, "4.64.0") Тогда
			
			Прервать;
			
		КонецЕсли;  
		
		НоваяСтрокаВерсий = СписокВерсий.Добавить();
		НоваяСтрокаВерсий.ПредставлениеРелиза = СтрокаВерсийОтСервиса.НомерВерсии + " от " + СтрокаВерсийОтСервиса.ДатаВыхода;
		НоваяСтрокаВерсий.Версия = СтрокаВерсийОтСервиса.НомерВерсии;
		НоваяСтрокаВерсий.СсылкаНаОписание = СтрокаВерсийОтСервиса.Описание;
		Если СтрокаВерсийОтСервиса.НомерВерсии = КонтекстОбновленияПоставки.Модуль.Версия Тогда
			НоваяСтрокаВерсий.Текущая = Истина;
		КонецЕсли; 
		
	КонецЦикла;
	
	Элементы.ГруппаСтатусЗагрузки.Видимость = Ложь;
	
	СписокВерсий.Сортировать("Версия УБЫВ");

КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьУстановкиОбновленияНаСервере()
	
	Возврат МодульОбъекта().ПроверитьВозможностьУстановкиОбновления();

КонецФункции

&НаКлиенте
Процедура СкачатьФайлСистемыХранения(Команда)
	
	НоваяМетрика().Категория("Обновление").НажатаКнопка(Команда).ПоместитьВОчередь();
	
	Версия = КонтекстОбновленияПоставки.СистемаХранения.Версия;
	ТипКонтента = КонтекстОбновленияПоставки.СистемаХранения.ТипКонтента;
	
	СкачатьОбновление(Версия, ТипКонтента);	
	
КонецПроцедуры

&НаКлиенте
Процедура СкачатьФайлМодуля(Команда)
	
	НоваяМетрика().Категория("Обновление").НажатаКнопка(Команда).ПоместитьВОчередь();
	КонтекстОбновленияМодуля = КонтекстОбновленияПоставки.Модуль;	
	Если КонтекстОбновленияМодуля.НоваяВерсия = "" Тогда
		ТекстПредупреждения = "Нет доступных обновлений для скачивания!";
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
	Иначе   
		НоваяВерсия = КонтекстОбновленияМодуля.НоваяВерсия;
		ТипКонтента = КонтекстОбновленияМодуля.ТипКонтента;
		СкачатьОбновление(НоваяВерсия, ТипКонтента);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкачатьОбновление(Версия, ТипКонтента)
	
	ОписаниеОбновления = СкачатьОбновлениеСервер(Версия, ТипКонтента); 
	
	Если ОписаниеОбновления.Успешно = Ложь Или ОписаниеОбновления.ДвоичныеДанные = Неопределено Тогда
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Не удалось загрузить обновления с сервера");
		Возврат;
	КонецЕсли; 
	
	ТипыКонтента = МодульОбъектаКлиент().ПеречисленияEDI_ТипыКонтентаСервисаОбновлений();
	
	Если ЗначениеЗаполнено(ОписаниеОбновления.ИмяФайла) Тогда
		
		ПолноеИмяФайла = ОписаниеОбновления.ИмяФайла;   
		Файл = Новый Файл(ПолноеИмяФайла); 
		РасширениеФайла = Файл.Расширение;
		РасширениеФайла = Прав(РасширениеФайла, СтрДлина(РасширениеФайла) - 1);  
		
	Иначе  
		РасширениеФайла = "epf";   
		
		Если Найти(ТипКонтента, ТипыКонтента.storage_cfe)
			ИЛИ Найти(ТипКонтента, ТипыКонтента.storage_epf_cfe) Тогда  
			
			РасширениеФайла = "cfe";
			
		ИначеЕсли Найти(ТипКонтента, ТипыКонтента.storage_cf) Тогда
			
			РасширениеФайла = "cf";
			
		КонецЕсли;        
		
		ПолноеИмяФайла = "КонтурEDI_ФайлОбновления." + РасширениеФайла;
		
	КонецЕсли;
	
    Фильтр = РасширениеФайла + "|*." + РасширениеФайла;
	РежимДиалога = РежимДиалогаВыбораФайла.Сохранение;
	ДопПараметры = Новый Структура("ДвоичныеДанные, РасширениеФайла", ОписаниеОбновления.ДвоичныеДанные, РасширениеФайла);
	
	МодульОбъектаКлиент().ВыбратьФайл_КонтурEDI("СохранитьФайлОбновленияНаДиске", ЭтаФорма, РежимДиалога,,
												ПолноеИмяФайла, Фильтр,,, ДопПараметры);
КонецПроцедуры

&НаСервере
Функция СкачатьОбновлениеСервер(Версия, ТипКонтента)
	
	ОписаниеОбновления = МодульОбъекта().СкачатьКонтентВерсии_КонтурEDI(Версия, ТипКонтента);  
	
	Возврат ОписаниеОбновления;		

КонецФункции  

&НаКлиенте
Процедура СохранитьФайлОбновленияНаДиске(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда	
				
		Если ТипЗнч(Результат) = Тип("Строка") Тогда
			ИмяФайла = Результат;
		Иначе
			ИмяФайла = Результат[0];
		КонецЕсли;
		
		ДопПараметры.ДвоичныеДанные.Записать(ИмяФайла);
		
		ТекстПредупреждения = "Файл обновления успешно сохранен на диске";
		
		ПризнакМодифицированностиМодуля = МодульОбъектаКлиент().ПеречисленияEDI_ПризнакиМодифицированностиКонтента();

		Если ДопПараметры.РасширениеФайла = "epf" И КонтекстОбновленияПоставки.Модуль.Модифицированность <> ПризнакМодифицированностиМодуля.НеИзменен Тогда
			ТекстПредупреждения = ТекстПредупреждения + ". Модуль EDI был изменен - не забудьте перенести необходимые доработки в новую версию.";
		ИначеЕсли НЕ ДопПараметры.РасширениеФайла = "epf" Тогда
			ТекстПредупреждения = ТекстПредупреждения + ". Перед установкой расширения рекомендуется сделать резервную копию базы.";	
		КонецЕсли;
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

