&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	Параметры.МодальностьЗапрещена=МодульОбъекта().МодальностьЗапрещена();
	ПутьКФормам = МодульОбъекта().Метаданные().ПолноеИмя() + ".Форма.";
	ИмяКонфигурации1С = МодульОбъекта().определитьКонфигурацию();
	  	
	мИмяСправочникаНоменклатура = МодульОбъекта().ПолучитьТипЗначенияОбъекта("Номенклатура",,Истина);
	ЕстьАртикул = Метаданные.Справочники.Номенклатура.Реквизиты.Найти("Артикул")<>Неопределено;
	ЕстьМетаданныеТипЕдиницы = МодульОбъекта().ЕстьМетаданныеТипЕдиницы;
	
	Наименование		= Параметры.Наименование;
	GTIN				= Параметры.GTIN;
	КодТовараПартнера	= Параметры.КодТовараПартнера;
	ТорговаяСеть		= Параметры.Партнер;
	ТипЕдиницы 			= Параметры.ТипЕдиницы;
	КодТовараВнутренний = Параметры.КодТовараВнутренний;
	КодЕдиницыИзмеренияEDI = Параметры.КодЕдиницыИзмеренияEDI;
	//
	//+
	ТекущееСоответствие = Новый Структура;
	ТекущееСоответствие.Вставить("GTIN",				Параметры.GTIN);
	ТекущееСоответствие.Вставить("КодТовараПартнера",	Параметры.КодТовараПартнера);
	//-
	
	УстановитьТипКолонки1С("Номенклатура");
	УстановитьТипКолонки1С("ХарактеристикаНоменклатуры");
	УстановитьТипКолонки1С("ЕдиницаИзмерения");
	
	МодульОбъекта().УстановитьФорматЭлементаФормы_КонтурEDI(Элементы.СписокНоменклатурыКоэффициентEDIВ1С);
	
	ИмяСправочникаКонтрагенты 	= МодульОбъекта().ПолучитьТипЗначенияОбъекта("ЮрФизЛицоСтороннее",,Истина);
	ИмяСправочникаДоговоры 		= МодульОбъекта().ПолучитьТипЗначенияОбъекта("Договор",,Истина);
	
	ЗаполнитьСпискиВыбораКолонок();
	
	СоответствиеТоваров = МодульОбъекта().СоответствиеТоваров_НайтиНоменклатуру(Параметры.GTIN,Параметры.КодТовараПартнера,Параметры.Партнер);
	
	Если ЗначениеЗаполнено(СоответствиеТоваров) Тогда
		
		Для каждого Стр Из СоответствиеТоваров Цикл
			
			НоваяСтрока = СписокНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
			ПроставитьКодИАртикулПоСтроке(НоваяСтрока);			
			Если НЕ ЗначениеЗаполнено(Стр.ХарактеристикаНоменклатуры) Тогда
				НоваяСтрока.ХарактеристикаНоменклатуры = МодульОбъекта().ПолучитьПустуюСсылкуОбъекта("ХарактеристикаНоменклатуры");
			КонецЕсли;
			
			МодульОбъекта().ЗаполнитьРеквизитыПересчетаКорректно(НоваяСтрока, Стр, ТипЕдиницы);
			
			ЗаполнитьЕдиницуИзмеренияEDI(НоваяСтрока);
			 
			НоваяСтрока.Пересчет = ТекстПересчета_КонтурEDI_Сервер(НоваяСтрока.ЕдиницаИзмерения, НоваяСтрока.ЕдиницаEDI, НоваяСтрока.КоэффициентEDIВ1С);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// автотесты
	Если ЗначениеЗаполнено(Параметры.ПараметрыАвтотестирования) Тогда
		
		ТипНоменклатуры		= МодульОбъекта().ПолучитьТипЗначенияОбъекта("Номенклатура");
		ТипЕдиницыИзмерения	= МодульОбъекта().ПолучитьТипЗначенияОбъекта("ЕдиницаИзмерения");
        ТипНоменклатуры		= СтрЗаменить(ТипНоменклатуры,		"СправочникСсылка.","");
        ТипЕдиницыИзмерения = СтрЗаменить(ТипЕдиницыИзмерения,	"СправочникСсылка.","");
		
		СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.ПараметрыАвтотестирования);
		СоответствиеТоваровАвтотестов = СтруктураПараметров.Настройки.Партнер.СоответствияТоваров;

		Для Каждого СтрТоваров Из СоответствиеТоваровАвтотестов Цикл
			Если (СокрЛП(СтрТоваров.GTIN) = СокрЛП(GTIN)) И (СокрЛП(СтрТоваров.КодТовараПартнера) = СокрЛП(КодТовараПартнера)) Тогда
				НоваяСтрока = СписокНоменклатуры.Добавить();
				НоваяСтрока.Номенклатура = Справочники[ТипНоменклатуры].НайтиПоКоду(СтрТоваров.Номенклатура);
				Если ЗначениеЗаполнено(ТипЕдиницыИзмерения) Тогда
					НоваяСтрока.ЕдиницаИзмерения = Справочники[ТипЕдиницыИзмерения].НайтиПоКоду(СтрТоваров.ЕдиницаИзмерения);
				Иначе
					Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
						НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаДляОтчетов;
					КонецЕсли;
				КонецЕсли;
				НоваяСтрока.Основной = СтрТоваров.ОсновноеСоответствие;
				НоваяСтрока.ЕдиницаEDI = СтрТоваров.ЕдиницаEDI;
				НоваяСтрока.КоэффициентEDIВ1С = СтрТоваров.КоэффициентEDI;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если СписокНоменклатуры.Количество() = 0 Тогда
		
		Если ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
			
			НоваяСтрока = СписокНоменклатуры.Добавить();
			
			НоваяСтрока.Номенклатура = Параметры.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = Параметры.ХарактеристикаНоменклатуры;
			НоваяСтрока.ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
			
			ЗаполнитьЕдиницуИзмеренияEDI(НоваяСтрока);
			 
			НоваяСтрока.Пересчет = ТекстПересчета_КонтурEDI_Сервер(НоваяСтрока.ЕдиницаИзмерения, НоваяСтрока.ЕдиницаEDI, НоваяСтрока.КоэффициентEDIВ1С);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПроверитьНедобавленныеТовары();
	
	ОформитьПодсказкиЭлементовУправления();
	УстановитьСвязиПараметровВыбораХарактеристик();
	
	МодульОбъекта().ПриОткрытииФормы_Номенклатуры(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбораХарактеристик()
	
	СвязиПараметровВыбора = Новый Массив;
	
	Если ИмяКонфигурации1С = "УФ_УТ" Тогда 
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Номенклатура", "Элементы.СписокНоменклатуры.ТекущиеДанные.Номенклатура"));
	ИначеЕсли ИмяКонфигурации1С = "УФ_УНФ" Тогда
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы.СписокНоменклатуры.ТекущиеДанные.Номенклатура"));
	КонецЕсли;	
	
	Если СвязиПараметровВыбора.Количество() > 0 Тогда
		Элементы.СписокНоменклатурыХарактеристикаНоменклатуры.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЕдиницуИзмеренияEDI(СтрокаТоваров)
	
	Если НЕ ЗначениеЗаполнено(СтрокаТоваров.ЕдиницаEDI) Тогда
		
		Если ЗначениеЗаполнено(КодЕдиницыИзмеренияEDI) Тогда
			СтрокаТоваров.ЕдиницаEDI = КодЕдиницыИзмеренияEDI;
		Иначе
			СтрокаТоваров.ЕдиницаEDI = ЕдиницаEDI_ПоЕдиницеИзмерения(СтрокаТоваров.ЕдиницаИзмерения);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЕдиницаEDI_ПоЕдиницеИзмерения(ЕдиницаИзмерения)
	
	Возврат МодульОбъекта().КонвертироватьЗначение1СвEDI(Строка(ЕдиницаИзмерения), "КодЕдиницы", "КодЕдиницы");

КонецФункции

&НаКлиенте
Процедура КоманднаяПанельСоответствующейНоменклатурыДобавить(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ОписаниеСправочник = Новый ОписаниеТипов("СправочникСсылка." + мИмяСправочникаНоменклатура);
	
	// выбираем из справочника
	ВыбранноеЗначение = ОписаниеСправочник.ПривестиЗначение();
	
	Если Параметры.МодальностьЗапрещена Тогда
		Выполнить("ПоказатьВводЗначения(Новый ОписаниеОповещения(""ОбработчикДобавитьНовуюНоменклатуруВызовСервера"",ЭтаФорма), ВыбранноеЗначение)");
	иначе
		Если ВвестиЗначение(ВыбранноеЗначение) Тогда
			ОбработчикДобавитьНовуюНоменклатуруВызовСервера(ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтроку(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ДобавитьНовуюНоменклатуруСервер(ТекущиеДанные.Номенклатура);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВводаЗначенияНоменклатуры(ВыбранноеЗначение,Параметры) Экспорт
	ДобавитьНовуюНоменклатуруСервер(ВыбранноеЗначение);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДобавитьНовуюНоменклатуруВызовСервера(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьНовуюНоменклатуруСервер(Результат);
	
	ПроверитьНаличиеОсновнойНоменклатуры();

	//активируем её чтобы кнопкой "удалить" можно было пользоваться сразу 
	КоличествоСтрок = СписокНоменклатуры.Количество();
	Если КоличествоСтрок > 0 Тогда 
		Элементы.СписокНоменклатуры.ТекущаяСтрока = СписокНоменклатуры.Получить(КоличествоСтрок - 1).ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура ДобавитьНовуюНоменклатуруСервер(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		МассивВыбранныхЗначений = ВыбранноеЗначение;
	Иначе
		МассивВыбранныхЗначений = МодульОбъекта().КонтурСтандарт_МассивЗначений(ВыбранноеЗначение);
	КонецЕсли;
	
	ПолучитьБазовуюЕдиницуИзмеренияДляУФ = ИмяКонфигурации1С = "УФ_УТ" 
										  ИЛИ ИмяКонфигурации1С = "УФ_УНФ" 
										  ИЛИ ИмяКонфигурации1С = "УФ_Розница" 
										  ИЛИ ИмяКонфигурации1С = "УФ_БП";
										  
	Для каждого ВыбраннаяНоменклатура Из МассивВыбранныхЗначений Цикл
	
		НоваяСтрока = СписокНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = ВыбраннаяНоменклатура;
		Если ПолучитьБазовуюЕдиницуИзмеренияДляУФ Тогда
			
			НоваяСтрока.ЕдиницаИзмерения = УФ_БазоваяЕИ(ВыбраннаяНоменклатура);
			
		ИначеЕсли НЕ ИмяКонфигурации1С = "БП" Тогда
			
			СтандартнаяОбработка = Истина;
			
			ИмяРеквизитаЕдиницаИзмерения = МодульОбъекта().ПолучитьИмяРеквизитаВладельцаПоИмениТипа("Номенклатура", "ЕдиницаИзмерения",СтандартнаяОбработка);
			
			Если СтандартнаяОбработка = Истина И МодульОбъекта().ЕстьНеобходимыеМетаданные("Справочники." + мИмяСправочникаНоменклатура + ".Реквизиты.ЕдиницаХраненияОстатков") Тогда
				
				НоваяСтрока.ЕдиницаИзмерения = ВыбраннаяНоменклатура.ЕдиницаХраненияОстатков;
				
			Иначе
				
				НоваяСтрока.ЕдиницаИзмерения = ВыбраннаяНоменклатура[ИмяРеквизитаЕдиницаИзмерения];
				
			КонецЕсли;			
			
		Иначе
			
			НоваяСтрока.ЕдиницаИзмерения = ВыбраннаяНоменклатура.БазоваяЕдиницаИзмерения;
			
		КонецЕсли;
		
		ТипХарактеристикаНоменклатуры     = МодульОбъекта().ПолучитьТипЗначенияОбъекта("ХарактеристикаНоменклатуры",,Истина);
		ЕстьТипХарактеристикаНоменклатуры = ТипХарактеристикаНоменклатуры <> Неопределено;
		
		Если ЕстьТипХарактеристикаНоменклатуры = Истина Тогда 
			
			НоваяСтрока.ХарактеристикаНоменклатуры = Справочники[ТипХарактеристикаНоменклатуры].ПустаяСсылка();
			
		КонецЕсли;
		
		НоваяСтрока.КоэффициентEDIВ1С = 1;
		
		ПроставитьКодИАртикулПоСтроке(НоваяСтрока);
		
		ПроверитьНедобавленныеТовары();
		
		ЗаполнитьЕдиницуИзмеренияEDI(НоваяСтрока);
		
		НоваяСтрока.Пересчет = ТекстПересчета_КонтурEDI_Сервер(НоваяСтрока.ЕдиницаИзмерения, НоваяСтрока.ЕдиницаEDI, НоваяСтрока.КоэффициентEDIВ1С);
		
		ПараметрыПодключаемогоМодуля = Новый Структура;
		ПараметрыПодключаемогоМодуля.Вставить("Партнер", ТорговаяСеть);
		ПараметрыПодключаемогоМодуля.Вставить("ВыбраннаяНоменклатура", ВыбраннаяНоменклатура);
		ПараметрыПодключаемогоМодуля.Вставить("СписокНоменклатуры", СписокНоменклатуры);
		ПараметрыПодключаемогоМодуля.Вставить("ДобавленнаяСтрока", НоваяСтрока); 
		
		МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("Соответствие_ПослеДобавленияНоменклатуры",, ПараметрыПодключаемогоМодуля);
	КонецЦикла;			
КонецПроцедуры

&НаСервере
Функция ТекстПересчета_КонтурEDI_Сервер(ЕдиницаИзмерения, ЕдиницаEDI, КоэффициентEDIВ1С)

	Возврат МодульОбъекта().ТекстПересчета_КонтурEDI(ЕдиницаИзмерения, ЕдиницаEDI, КоэффициентEDIВ1С);

КонецФункции 

&НаКлиенте
Процедура КоманднаяПанельСоответствующейНоменклатурыУдалить(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если Элементы.СписокНоменклатуры.ТекущиеДанные<>Неопределено Тогда 
		СписокНоменклатуры.Удалить(Элементы.СписокНоменклатуры.ТекущиеДанные);
	Иначе
		Сообщить("Выберите строку соответствия для удаления");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельСоответствующейНоменклатурыУстановитьОсновным(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	Для Каждого СтрокаТЧ из СписокНоменклатуры Цикл
		СтрокаТЧ.Основной = Ложь; 
	КонецЦикла;
	
	ТекСтрока = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		
		ТекСтрока.Основной = Истина;
		
	КонецЕсли;
	
	ПроверитьНаличиеОсновнойНоменклатуры();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораКолонок()
	
	СписокЕдиницEDI 		= МодульОбъекта().ПолучитьСписокЕдиницEDI();
    ЗаполнитьСписокВыбораЭлемента(Элементы.СписокНоменклатурыЕдиницаEDI, СписокЕдиницEDI);
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораЭлемента(Элемент, Список)
	
	Элемент.СписокВыбора.Очистить();
	
	Для каждого Эл Из Список Цикл
		Элемент.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ОформитьПодсказкиЭлементовУправления()

	Если МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Параметры.Партнер, "СинхронизироватьТоварыТолькоПоGTIN") = Истина ТОгда
		Элементы.НадписьЕстьОсобенности.Видимость = Истина;
		Элементы.КартинкаКодПартнера.Видимость = истина;
	ИначеЕсли МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Параметры.Партнер, "СинхронизироватьТоварыТолькоПоКодуПартнера") = Истина Тогда
		Элементы.НадписьЕстьОсобенности.Видимость = Истина;
		Элементы.КартинкаGTIN.Видимость = истина;
	КонецЕсли;
	
	Элементы.ПризнакНоменклатуры.СписокВыбора.Добавить("Товар");
	Элементы.ПризнакНоменклатуры.СписокВыбора.Добавить("Услуга");
	Элементы.ПризнакНоменклатуры.СписокВыбора.Добавить("Возвратная тара");
	
	Если НЕ ЕстьМетаданныеТипЕдиницы
		И НЕ МодульОбъекта().ВнешнееХранилище Тогда
		Элементы.НадписьПризнакНоменклатурыНастроить.Видимость = Истина;
	КонецЕсли;
	
	Если НЕ ЕстьМетаданныеТипЕдиницы Тогда
		ПризнакНоменклатуры = "Товар";
		Элементы.ПризнакНоменклатуры.Доступность = Ложь;
	Иначе
		Если ТипЕдиницы = "Services" Тогда
			ПризнакНоменклатуры = "Услуга";
		ИначеЕсли ТипЕдиницы = "RC" Тогда
			ПризнакНоменклатуры = "Возвратная тара";
		Иначе
			ПризнакНоменклатуры = "Товар";
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры // ОформитьПодсказкиЭлементовУправления()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Партнер) Тогда
		Если Параметры.МодальностьЗапрещена = истина Тогда
			Выполнить("ПоказатьПредупреждение(Новый ОписаниеОповещения(""ОбработчикЗакрытьФорму"", ЭтаФорма,),""Для установки соответствий номенклатуры в форму должен быть передан партнер."");");
		Иначе
			Предупреждение("Для установки соответствий номенклатуры в форму должен быть передан партнер.");
		КонецЕсли;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПараметрыАвтотестирования) Тогда
		ЗаписатьИЗакрыть();
	КонецЕсли;

	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "Номенклатура_ЭлементУправляемая");

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеОсновнойНоменклатуры()
	
	Если СписокНоменклатуры.Количество()>0 Тогда
		
		НайденнаяСтрока = Неопределено;
		Для Каждого СтрокаТЧ из СписокНоменклатуры Цикл
			Если СтрокаТЧ.Основной Тогда 
				НайденнаяСтрока=СтрокаТЧ;
			КонецЕсли;
			
		КонецЦикла;
		
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			СписокНоменклатуры[0].Основной = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипКолонки1С(ИмяПоля)
	
	ПолеФормы	= Элементы["СписокНоменклатуры"+ИмяПоля];
	ТипПоля		= МодульОбъекта().ПолучитьТипЗначенияОбъекта(ИмяПоля);
	
	ВХ = МодульОбъекта().ВнешнееХранилище;
	
	Если ТипПоля = Неопределено ИЛИ (ВХ И Найти(ТипПоля,"КонтурEDI_")>0) Тогда
		//Сообщить("Не задан тип объекта 1С для поля с типом "+Тип1С);
	Иначе	
		
		Элементы["СписокНоменклатуры"+ИмяПоля].ОграничениеТипа = Новый ОписаниеТипов(ТипПоля);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьНедобавленныеТовары()
	
    НедобавленныеТовары = ПолучитьТоварыПоКодуШтрихкоду();
	
	Если НедобавленныеТовары.Количество() = 0 Тогда
		Элементы.ПанельНайденныхПоШтрихкоду.Видимость = Ложь;
	Иначе
		Элементы.ПанельНайденныхПоШтрихкоду.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруВТаблицуПодобранныхТоваров(ТаблицаПодобранныхТоваров, СвойстваНоменклатура)

	НоваяСтрока = ТаблицаПодобранныхТоваров.Добавить();
					
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СвойстваНоменклатура);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОтбораНоменклатуры(СвойстваНоменклатуры)
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура"		, СвойстваНоменклатуры.Номенклатура);		
	Структура.Вставить("ЕдиницаИзмерения"	, СвойстваНоменклатуры.ЕдиницаИзмерения);
		
	Если ЗначениеЗаполнено(СвойстваНоменклатуры.ХарактеристикаНоменклатуры) Тогда
		Структура.Вставить("ХарактеристикаНоменклатуры", СвойстваНоменклатуры.ХарактеристикаНоменклатуры);
	КонецЕсли;

	Возврат Структура;

КонецФункции

&НаСервере
Процедура ИсключитьСопоставленныеТовары(ТаблицаПодобранныхТоваров)
	
	Индекс = ТаблицаПодобранныхТоваров.Количество() - 1;
	
	Пока Индекс >= 0 Цикл 
		
		СтрокаТаблицы = ТаблицаПодобранныхТоваров[Индекс];
		
		Отбор = ПараметрыОтбораНоменклатуры(СтрокаТаблицы);
		
		НайденныеСтроки = СписокНоменклатуры.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() Тогда		
			ТаблицаПодобранныхТоваров.Удалить(СтрокаТаблицы);
		КонецЕсли;
		
		Индекс = Индекс - 1;
		
	КонецЦикла;	
			
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоКодуШтрихкоду()
	
	ТаблицаПодобранныхТоваров = Новый ТаблицаЗначений;
	
	СписокСвойствНоменклатуры = "Код,Артикул,Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения";
	
	МодульОбъекта().ДобавитьКолонкиВТаблицуЗначений(ТаблицаПодобранныхТоваров, СписокСвойствНоменклатуры);
		
	Если ЗначениеЗаполнено(GTIN) Тогда
		
		НайденныеТоварыПоШК = МодульОбъекта().НайтиТоварыПоШтрихкоду(СокрЛП(GTIN), ТорговаяСеть, КодТовараПартнера);
		
		Если ТипЗнч(НайденныеТоварыПоШК) = Тип("ТаблицаЗначений") Тогда
			
			Для каждого СтрокаТаблицы Из НайденныеТоварыПоШК Цикл
				
				СвойстваНоменклатуры = Новый Структура(СписокСвойствНоменклатуры,"","");
				
				ЗаполнитьЗначенияСвойств(СвойстваНоменклатуры, СтрокаТаблицы);
				
				СвойстваНоменклатуры.Код = СтрокаТаблицы.Номенклатура.Код;
					
				Если ЕстьАртикул Тогда 
					СвойстваНоменклатуры.Артикул = СтрокаТаблицы.Номенклатура.Артикул;
				КонецЕсли;
				
				ДобавитьНоменклатуруВТаблицуПодобранныхТоваров(ТаблицаПодобранныхТоваров, СвойстваНоменклатуры);
												
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;		
	
	// сеть указала internalSupplierCode, попробуем найти этот товар в справочнике поставщика по его коду
	Если ЗначениеЗаполнено(КодТовараВнутренний) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникНоменклатура.Ссылка КАК Номенклатура,
		|	СправочникНоменклатура.Код,
		|	&ПолеАртикул КАК Артикул,
		|   &ПолеХарактеристика КАК ХарактеристикаНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК СправочникНоменклатура
		|ГДЕ
		|	СправочникНоменклатура.Код = &Код";		
		
		Запрос.УстановитьПараметр("Код", КодТовараВнутренний);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Номенклатура", "Справочник." + мИмяСправочникаНоменклатура);
		
		Если ЕстьАртикул Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПолеАртикул", "СправочникНоменклатура.Артикул");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПолеАртикул", " """" ");
		КонецЕсли;
						
		ТипХарактеристики = МодульОбъекта().ПолучитьТипЗначенияОбъекта("ХарактеристикаНоменклатуры", , Истина);
		
		Если ТипХарактеристики <> Неопределено Тогда			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПолеХарактеристика", "Значение(Справочник." + ТипХарактеристики + ".ПустаяСсылка)");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПолеХарактеристика", "Неопределено");	
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			СвойстваНоменклатуры = Новый Структура(СписокСвойствНоменклатуры,"","");
			
			ЗаполнитьЗначенияСвойств(СвойстваНоменклатуры, Выборка);
			
			СвойстваНоменклатуры.ЕдиницаИзмерения = МодульОбъекта().УФ_ПолучитьБазовуюЕдиницуИзмерения(Выборка.Номенклатура);
			
			ДобавитьНоменклатуруВТаблицуПодобранныхТоваров(ТаблицаПодобранныхТоваров, СвойстваНоменклатуры);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Для УФ_БП поиск будет по справочнику НоменклатураПоставщиков что, конечно несовсем корректно, ведь в этом контексте речь идет скорее о покупателях, однако, клиенты, как оказалось, часто имеют соответствия именно здесь
	Если ЗначениеЗаполнено(КодТовараПартнера) 
		И МодульОбъекта().ИмяКонфигурации1С = "УФ_БП" Тогда
		
		// поиск по спр. Номенклатура поставщиков (там привязка к контрагенту)
		Если ЗначениеЗаполнено(ТорговаяСеть) Тогда 
			//ищем всех контрагентов этой сети
			
			НайденныеКонтрагентыСети = МодульОбъекта().ПолучитьСписокЭлементовСправочника("ЮрФизЛицаСторонние",ТорговаяСеть);
			
			// у этой сети есть контрагенты
			Если НайденныеКонтрагентыСети <> Неопределено Тогда  
				МассивКонтрагентов = НайденныеКонтрагентыСети.ВыгрузитьКолонку("ЮрФизЛицо");
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	НоменклатураПоставщиков.Номенклатура,
				|	НоменклатураПоставщиков.Артикул,
				|	НоменклатураПоставщиков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
				|ИЗ
				|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
				|ГДЕ
				|	НоменклатураПоставщиков.Владелец В(&МассивКонтрагентов)
				|	И НоменклатураПоставщиков.Артикул = &Артикул";
				
				Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
				Запрос.УстановитьПараметр("Артикул", КодТовараПартнера);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				
				Пока Выборка.Следующий() Цикл					
					ДобавитьНоменклатуруВТаблицуПодобранныхТоваров(ТаблицаПодобранныхТоваров, Выборка);					
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаПодобранныхТоваров.Свернуть(СписокСвойствНоменклатуры);
	
	Если СписокНоменклатуры.Количество() Тогда		
		ИсключитьСопоставленныеТовары(ТаблицаПодобранныхТоваров);
	КонецЕсли;
	
	Возврат ТаблицаПодобранныхТоваров;
	
КонецФункции

&НаКлиенте
Процедура НадписьДобавитьНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ДобавитьНедобавленныеСервер();
	ПроверитьНаличиеОсновнойНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНедобавленныеСервер()
	НедобавленныеТовары = ПолучитьТоварыПоКодуШтрихкоду();
	#Если Клиент Тогда 
		//на сервере на клиенте - толстый клиент
		Если НЕ НедобавленныеТовары.ВыбратьСтроку("Данная номенклатура будет добавлена в соответствие:")=Неопределено Тогда //переделать !!!на тонком не заработает!!!
			
			Для Каждого Стр Из НедобавленныеТовары Цикл
				НоваяСтрока = СписокНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
				ЗаполнитьЕдиницуИзмеренияEDI(НоваяСтрока);
				НоваяСтрока.КоэффициентEDIВ1С = 1;
				НоваяСтрока.Пересчет = ТекстПересчета_КонтурEDI_Сервер(НоваяСтрока.ЕдиницаИзмерения, НоваяСтрока.ЕдиницаEDI, НоваяСтрока.КоэффициентEDIВ1С);
			КонецЦикла;
			
		КонецЕсли;
	#Иначе
		//просто все закинем не спрашивая
		Для Каждого Стр Из НедобавленныеТовары Цикл
			НоваяСтрока = СписокНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
			ЗаполнитьЕдиницуИзмеренияEDI(НоваяСтрока);
			НоваяСтрока.КоэффициентEDIВ1С = 1;
			НоваяСтрока.Пересчет = ТекстПересчета_КонтурEDI_Сервер(НоваяСтрока.ЕдиницаИзмерения, НоваяСтрока.ЕдиницаEDI, НоваяСтрока.КоэффициентEDIВ1С);
		КонецЦикла;
		
	#КонецЕсли
		ПроверитьНедобавленныеТовары();
	
КонецПроцедуры

&НаСервере
Функция УФ_БазоваяЕИ(Номенклатура)
	Возврат МодульОбъекта().УФ_ПолучитьБазовуюЕдиницуИзмерения(Номенклатура);
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПередУдалением(Элемент, Отказ)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	СписокВыбора= новый СписокЗначений;
	
	УФ_СоставитьСписокЕдиницИзмерения(СписокВыбора,Элементы.СписокНоменклатуры.ТекущиеДанные.Номенклатура);
	
	ВыбранноеЗначение = Неопределено;
	
	Если Параметры.МодальностьЗапрещена Тогда 
		Выполнить("ПоказатьВыборИзСписка(Новый ОписаниеОповещения(""СписокНоменклатурыЕдиницаИзмеренияНачалоВыбораЗавершение"", ЭтаФорма), СписокВыбора,Элемент,)");
	Иначе
		ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора,Элемент,);
		СписокНоменклатурыЕдиницаИзмеренияНачалоВыбораЗавершение(ВыбранноеЗначение, );
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЕдиницаИзмеренияНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
	ВыбранноеЗначение = ВыбранныйЭлемент;
    
    Если ВыбранноеЗначение=неопределено или НЕ ЗначениеЗаполнено(ВыбранноеЗначение.Значение)  Тогда
        Элементы.СписокНоменклатуры.ТекущиеДанные.ЕдиницаИзмерения=УФ_БазоваяЕИ(Элементы.СписокНоменклатуры.ТекущиеДанные.Номенклатура);
    иначе
        Элементы.СписокНоменклатуры.ТекущиеДанные.ЕдиницаИзмерения=ВыбранноеЗначение.Значение;
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УФ_СоставитьСписокЕдиницИзмерения(СписокВыбора,Номенклатура)
	МодульОбъекта().УФ_ЗаполнитьСписокЕдиницИзмерения(Номенклатура,СписокВыбора);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	ИдентификаторТекСтроки = Элементы.СписокНоменклатуры.ТекущиеДанные.ПолучитьИдентификатор();
	СписокНоменклатурыНоменклатураПриИзмененииСервер(ИдентификаторТекСтроки)
КонецПроцедуры

&НаСервере
Процедура СписокНоменклатурыНоменклатураПриИзмененииСервер(ИдентификаторТекСтроки)
	
	ТекСтрока = СписокНоменклатуры.НайтиПоИдентификатору(ИдентификаторТекСтроки);
	ПроставитьКодИАртикулПоСтроке(ТекСтрока);
	
	Если ТекСтрока<>Неопределено Тогда 
		
		ТекСтрока.ЕдиницаИзмерения = МодульОбъекта().ПолучитьПустуюСсылкуОбъекта("ЕдиницаИзмерения");
		ТекСтрока.ХарактеристикаНоменклатуры = МодульОбъекта().ПолучитьПустуюСсылкуОбъекта("ХарактеристикаНоменклатуры");
		
		Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда 
			ТекСтрока.ЕдиницаИзмерения = УФ_БазоваяЕИ(ТекСтрока.Номенклатура);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроставитьКодИАртикулПоСтроке(ТекСтрока)
	
	СтруктураКодАртикул = Новый Структура("Код,Артикул");
	ЗаполнитьЗначенияСвойств(СтруктураКодАртикул, ТекСтрока.Номенклатура);
	
	ТекСтрока.Код = СтруктураКодАртикул.Код;
	Если ЕстьАртикул=истина Тогда 
		ТекСтрока.Артикул = СтруктураКодАртикул.Артикул;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНажатие(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ЗаписатьИЗакрыть();

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть()
	
	Если Не ЗначениеЗаполнено(GTIN) И Не ЗначениеЗаполнено(КодТовараПартнера) Тогда
		СообщениеПользователю=Новый СообщениеПользователю;
		СообщениеПользователю.Текст="Необходимо указать GTIN или код товара в торговой сети!";
		СообщениеПользователю.Поле="GTIN";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
	сч = 0;
	Для каждого Стр Из СписокНоменклатуры Цикл
		сч = сч+1;
		НомерТекСтроки=(сч-1);	
		Если НЕ ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			
			СообщениеПользователю=Новый СообщениеПользователю;
			СообщениеПользователю.Текст="В строке "+СокрЛП(НомерТекСтроки)+" не указана номенклатура!";
			СообщениеПользователю.Поле = "СписокНоменклатуры["+Формат(НомерТекСтроки,"ЧГ=")+"].Номенклатура";
			СообщениеПользователю.Сообщить();
			Возврат;
			
		КонецЕсли;
		
		Если НЕ ТипЕдиницы = "Services" И НЕ ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
			
			СообщениеПользователю=Новый СообщениеПользователю;
			СообщениеПользователю.Текст="В строке "+СокрЛП(НомерТекСтроки)+" не указана единица измерения!";
			СообщениеПользователю.Поле = "СписокНоменклатуры["+Формат(НомерТекСтроки,"ЧГ=")+"].ЕдиницаИзмерения";
			СообщениеПользователю.Сообщить();
			Возврат;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.КоэффициентEDIВ1С)
			И Не ЗначениеЗаполнено(Стр.ЕдиницаEDI) Тогда
			
			СообщениеПользователю=Новый СообщениеПользователю;
			СообщениеПользователю.Текст="В строке "+СокрЛП(НомерТекСтроки)+" не указана единица измерения EDI!";
			СообщениеПользователю.Поле = "СписокНоменклатуры["+Формат(НомерТекСтроки,"ЧГ=")+"].ЕдиницаEDI";
			СообщениеПользователю.Сообщить();
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПроверитьНаличиеОсновнойНоменклатуры();
	
	КоличествоОшибок = СохранитьСоответствиеСервер();
	
	Если КоличествоОшибок = 0 Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СохранитьСоответствиеСервер()
	
	РезультатСохранения = МодульОбъекта().СоответствиеТоваров_Сохранить(
	СписокНоменклатуры,
	GTIN,
	КодТовараПартнера,
	Наименование,
	Параметры.Партнер,
	ТекущееСоответствие,
	ТипЕдиницы);
	
	КоличествоОшибок=1;
	Если ЗначениеЗаполнено(РезультатСохранения) 
		И РезультатСохранения.ТаблицаОшибок.Количество() = 0 Тогда
		
		КоличествоОшибок = 0;
	
	КонецЕсли;
	
	Возврат КоличествоОшибок;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикЗакрытьФорму(ДополнительныеПараметры) Экспорт
	Если ЭтаФорма.Открыта() Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НадписьЕстьОсобенностиНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ТекстПредупреждения = ОписаниеОсобенностейСинхронизацииКодов();
	Если Параметры.МодальностьЗапрещена Тогда 
		Выполнить("ПоказатьПредупреждение(,ТекстПредупреждения,,""Контур.EDI"")");
	Иначе
		Предупреждение(ТекстПредупреждения,,"Контур.EDI");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеОсобенностейСинхронизацииКодов()

	Если МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Параметры.Партнер, "СинхронизироватьТоварыТолькоПоGTIN") = Истина Тогда 
		Текст= "У этой торговой сети настроена синхронизация товаров только по GTIN.
		|В исходящих сообщениях код товара покупателя будет взят из ORDERS или RECADV.";	
	ИначеЕсли МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Параметры.Партнер, "СинхронизироватьТоварыТолькоПоКодуПартнера") = Истина  Тогда
		Текст= "У этой торговой сети настроена синхронизация товаров только по КОДУ ПАРТНЕРА.
		|При записи соответствия GTIN не будет сохранен. В исходящих сообщениях GTIN будет отправлен из соответствия.";	
	КонецЕсли;
	
    Возврат Текст;
КонецФункции // ОписаниеОсобенностейСинхронизацииКодов()

&НаКлиенте
Процедура СписокНоменклатурыХарактеристикаНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ПараметрыФормыВыбора = Новый Структура;
	ДополнительныеПараметры = Новый Структура("ТекущиеДанные", ТекущиеДанные);
	
	Если ИмяКонфигурации1С = "УФ_УТ" Тогда 
		ПараметрыФормыВыбора.Вставить("ТекущийЭлемент"  , ТекущиеДанные.ХарактеристикаНоменклатуры);
		ПараметрыФормыВыбора.Вставить("Номенклатура"    , ТекущиеДанные.Номенклатура);
		
	ИначеЕсли ИмяКонфигурации1С = "УФ_УНФ" Тогда
		ОтборХарактеристик = Новый Структура;
		ОтборХарактеристик.Вставить("Владелец",ТекущиеДанные.Номенклатура);
		ПараметрыФормыВыбора.Вставить("Отбор"  , ОтборХарактеристик);
		ПараметрыФормыВыбора.Вставить("ТекущаяСтрока"  , ТекущиеДанные.ХарактеристикаНоменклатуры);
		
	ИначеЕсли ИмяКонфигурации1С = "УФ_Розница" Тогда
		ПараметрыФормыВыбора.Вставить("ПараметрВладелец" , ТекущиеДанные.Номенклатура);
		ПараметрыФормыВыбора.Вставить("ТекущийЭлемент"  , ТекущиеДанные.ХарактеристикаНоменклатуры);
		ПараметрыФормыВыбора.Вставить("Номенклатура"    , ТекущиеДанные.Номенклатура);	
		
	Иначе
		Возврат; //на БП30 нет характеристик
	КонецЕсли;
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора", "", ПараметрыФормыВыбора, ЭтаФорма, "ДобавитьХарактеристикуЗавершение", ЭтаФорма, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьХарактеристикуЗавершение(Результат,ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	Характеристика = Результат;
	Если Характеристика = Неопределено Тогда
		Возврат;
	Иначе
	ТекущиеДанные.ХарактеристикаНоменклатуры = Характеристика;	
	КонецЕсли;

КонецПроцедуры // 

&НаКлиенте
Процедура НадписьПризнакНастроитьНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ТекстВопроса = "Для работы с дополнительными признаками номенклатуры (услуга, возвратная тара) в модуле Контур.EDI требуется обновить конфигурацию:
					| + реквизит ""ТипЕдиницы"" в рег. сведений ""КонтурEDI_СоответствияТоваров"".
					|
					|Сохранить файл обновления на диск?";
	
	ПредложитьОбновитьОбъектыМетаданныхКонтурEDI(ТекстВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьОбновитьОбъектыМетаданныхКонтурEDI(ТекстВопроса = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ТекстВопроса) Тогда
		
		КнопкиВопроса=новый СписокЗначений;
		КнопкиВопроса.Добавить("Да");
		КнопкиВопроса.Добавить("Нет");
		ДопПараметрДляПередачиВОбработчик=Неопределено;
		РезультатВопроса = Неопределено;
		
		Если Параметры.МодальностьЗапрещена Тогда
			Выполнить("ПоказатьВопрос(Новый ОписаниеОповещения(""ОбработчикСогласияСохраненияФайла"", ЭтаФорма, ДопПараметрДляПередачиВОбработчик), ТекстВопроса, КнопкиВопроса,,,""Контур.EDI"")");
		Иначе
			РезультатВопроса = Вопрос(ТекстВопроса, КнопкиВопроса,,,"Контур.EDI");
			ОбработчикСогласияСохраненияФайла(РезультатВопроса,ДопПараметрДляПередачиВОбработчик);
		КонецЕсли;
		
	Иначе
		ОбработчикСогласияСохраненияФайла("Да","Не задан вопрос");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСогласияСохраненияФайла(РезультатВопроса, ДопПараметр) Экспорт

	Если НЕ РезультатВопроса = "Да" Тогда 
		Возврат;
	КонецЕсли;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Заголовок		= "Укажите файл, в который нужно сохранить обновление для вашей конфигурации";
	ДиалогВыбора.Фильтр			= "Файл конфигурации 1С (*.cf)|*.cf";      
	ДиалогВыбора.ПолноеИмяФайла = "КонтурEDI_upd.cf";
	
	Если ДиалогВыбора.Выбрать() Тогда      
		ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
	Иначе
		Возврат;
	КонецЕсли;
	
	ИмяМакетаОбновления = "ОбновлениеДляХраненияДанных";
	
	Макет = ПолучитьМакетВызовСервера(ИмяМакетаОбновления);
	Макет.Записать(ПутьКФайлу);
	
	//еще высветим на экране текстовый документ с описанием того, что надо делать
	Чтиво = Новый ТекстовыйДокумент;
	Чтиво.УстановитьТекст(
						"ВНИМАНИЕ! 
						|При добавлении оптимизированных объектов хранения данных в окне ""Сравнение, объединение"" НЕОБХОДИМО снять флажок с раздела ""Свойства""!
						|Кроме того, в справочнике ""КонтурEDI_Сообщения"" для реквизита ""Документ"" желательно установить составной тип данных
						|и указать только необходимые документы: заказы, реализации/поступления, возвраты и т.д."
						);
	Чтиво.Показать();
	
КонецПроцедуры // ОбработчикСогласияСохраненияФайла()

&НаСервере
Функция ПолучитьМакетВызовСервера(ИмяМакетаОбновления)

	Возврат МодульОбъекта().ПолучитьМакет(ИмяМакетаОбновления);	

КонецФункции // ПолучитьМакет(ИмяМакетаОбновления)()

&НаКлиенте
Процедура ПризнакНоменклатурыПриИзменении(Элемент)
	
	Если ПризнакНоменклатуры = "Услуга" Тогда
		ТипЕдиницы = "Services";
	ИначеЕсли ПризнакНоменклатуры = "Возвратная тара" Тогда
		ТипЕдиницы = "RC";
	Иначе
		ТипЕдиницы = "";
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокНоменклатурыПересчет" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущаяСтрока = Элементы.СписокНоменклатуры.ТекущиеДанные;
		
		ПараметрыФормы = Новый Структура;
				
		ПараметрыФормы.Вставить("GTIN"							, GTIN);
		ПараметрыФормы.Вставить("КодТовараПартнера"				, КодТовараПартнера);
		ПараметрыФормы.Вставить("ЕдиницаEDI"					, ТекущаяСтрока.ЕдиницаEDI);
		ПараметрыФормы.Вставить("ЕдиницаИзмерения"				, ТекущаяСтрока.ЕдиницаИзмерения);
		ПараметрыФормы.Вставить("КоэффициентEDIВ1С"				, ТекущаяСтрока.КоэффициентEDIВ1С);
		ПараметрыФормы.Вставить("Номенклатура"					, ТекущаяСтрока.Номенклатура);
		ПараметрыФормы.Вставить("ХарактеристикаНоменклатуры"	, ТекущаяСтрока.ХарактеристикаНоменклатуры);
		ПараметрыФормы.Вставить("ВыбраннаяСтрока"				, ВыбраннаяСтрока);
		
		МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI(
		"ФормаПересчетаЕдиницEDI_В_1С_Управляемая", 
		, 
		ПараметрыФормы, 
		ЭтаФорма, 
		"ОбработчикПослеВведенияПересчета_КонтурEDI", 
		ЭтаФорма, 
		ПараметрыФормы);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеВведенияПересчета_КонтурEDI(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ТекущаяСтрока = СписокНоменклатуры.НайтиПоИдентификатору(ДопПараметры.ВыбраннаяСтрока);
		
		ТекущаяСтрока.КоэффициентEDIВ1С	= Результат.КоэффициентEDIВ1С;
		ТекущаяСтрока.ЕдиницаEDI		= Результат.ЕдиницаEDI;
		  		
		ТекущаяСтрока.Пересчет = ТекстПересчета_КонтурEDI_Сервер(ТекущаяСтрока.ЕдиницаИзмерения, ТекущаяСтрока.ЕдиницаEDI, ТекущаяСтрока.КоэффициентEDIВ1С);	
		
	КонецЕсли;	

КонецПроцедуры        

&НаКлиенте
Процедура СписокНоменклатурыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущаяСтрока = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаEDI) Тогда
			ТекущаяСтрока.ЕдиницаEDI = ЕдиницаEDI_ПоЕдиницеИзмерения(ТекущаяСтрока.ЕдиницаИзмерения);
		КонецЕсли;
				
		ТекущаяСтрока.Пересчет = ТекстПересчета_КонтурEDI_Сервер(ТекущаяСтрока.ЕдиницаИзмерения, ТекущаяСтрока.ЕдиницаEDI, ТекущаяСтрока.КоэффициентEDIВ1С);
		
	КонецЕсли;   	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "Номенклатура_ЭлементУправляемая");
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура АкцепторДобавленнойКнопки(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	// действия, которые нужно выполнить на клиенте, например что-то спросить
	КлиентскийКодОбработчика = ПолучитьКлиентскийКодОбработчикаНажатияКнопки(Команда.Имя);
	
	Если КлиентскийКодОбработчика<>неопределено Тогда 
		// в этот моент мы знаем Команда.Имя и можем выполнить нужный код внутри КлиентскийКодОбработчика смотри описание функции ПолучитьКлиентскийКодОбработчикаНажатияКнопки
		// для дальнейшей передачи на сервер для обработки Использовать  ОбработчикИнтерактивногоДействияДобавленнойкнопки(РезультатДействия,ИмяКоманды)
		Выполнить(КлиентскийКодОбработчика); 	
	КонецЕсли;
	
	// Вне зависимости от наличия клиентского обработчика выполняем серверную процедуру	
	АкцепторДобавленнойКнопкиСервер(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикИнтерактивногоДействияДобавленнойкнопки(РезультатКлиента, ИмяКоманды) Экспорт
	
	АкцепторДобавленнойКнопкиСервер(ИмяКоманды, РезультатКлиента);	
	
КонецПроцедуры 

&НаСервере
Процедура АкцепторДобавленнойКнопкиСервер(ИмяКоманды, РезультатКлиента = Неопределено)

	СтандартнаяОбработкаEDI = Истина;

	ПараметрыПМ = Новый Структура(
	"ИмяКоманды, Форма, РезультатКлиента", 
	ИмяКоманды, ЭтаФорма, РезультатКлиента);
	
	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("КнопкаФормыНоменклатурыНажатие", СтандартнаяОбработкаEDI, ПараметрыПМ);
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОповещениеИзПодключаемогоМодуля" Тогда
		
		АкцепторДобавленнойКнопкиСервер(Параметр.ИмяКоманды, Параметр.Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлиентскийКодОбработчикаНажатияКнопки(ИмяКоманды)
	
	СтандартнаяОбработкаEDI = Истина;
	
	ПараметрыПМ = Новый Структура("ИмяКоманды,Сообщение,Параметры,Форма", ИмяКоманды, Неопределено, Параметры, ЭтаФорма);
	
	КлиентскийКодОбработчика = 
	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ПолучениеКодаКлиентскогоОбработчика", СтандартнаяОбработкаEDI, ПараметрыПМ);
	
	Если ЗначениеЗаполнено(СокрЛП(КлиентскийКодОбработчика)) Тогда 
		Возврат КлиентскийКодОбработчика;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ПолучитьКлиентскийКодОбработчикаНажатияКнопки()

&НаКлиенте
Функция ПолучитьАдресСтраницыПоВладельцуФорму()
	
	ЗаголовокИнструкции = "СопоставлениеНомеклатурыПересчеты";
	
	ИмяВладельцаФормы = Неопределено;
	ЭтоФормаПартнера = МодульОбъектаКлиент().ПеременнаяСодержитСвойство(ЭтаФорма.ВладелецФормы, "ТаблицаНоменклатуры");
	
	Если Не ЭтоФормаПартнера Тогда
		ЗаголовокИнструкции = "ОшибкиПриСопоставленииТоваров";	
	КонецЕсли;
	
	Возврат Объект.ПараметрыКлиентСервер.URLАдреса[ЗаголовокИнструкции];
	
КонецФункции

&НаКлиенте
Процедура ОткрытьИнструкциюСопоставленияТоваров(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	АдресСтраницы = ПолучитьАдресСтраницыПоВладельцуФорму();
	
	МодульОбъектаКлиент().ОткрытьИнструкциюКлиент(Команда, ЭтаФорма, АдресСтраницы);
	
КонецПроцедуры

