
// #Область ОписаниеПеременных

&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

&НаКлиенте
Перем НужноСкрытьАктивизациюСтроки;

// #КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	
	ВходящиеУведомления = Неопределено;
	
	Если Параметры.Свойство("УведомленияEDI", ВходящиеУведомления) 
		И ТипЗнч(ВходящиеУведомления) = Тип("ФиксированныйМассив") Тогда
		
		МодульОбъекта().УведомленияEDI_ОбработатьПодменыПараметровКонтента(ВходящиеУведомления);
		
		Для Каждого Уведомление Из ВходящиеУведомления Цикл			
			НайденныеУведомления = Уведомления.НайтиСтроки(Новый Структура("Идентификатор", Уведомление.Идентификатор));  
					
			Если НайденныеУведомления.Количество() > 0 Тогда
				Продолжить;	
			КонецЕсли;
			
			НоваяСтрока = Уведомления.Добавить();
			НоваяСтрока.Важное = Уведомление.Приоритет = "high"; 			
            ЗаполнитьЗначенияСвойств(НоваяСтрока, Уведомление);
			
			Если НЕ НоваяСтрока.Прочитано Тогда 
				НоваяСтрока.ИндексКартинки = 2 - Число(НоваяСтрока.Важное);				
			КонецЕсли;					
		КонецЦикла;	
		
		Уведомления.Сортировать("Прочитано Возр, ДатаНачала Убыв");
		
		ТолькоВажные = Параметры.ТолькоВажные;
		
	КонецЕсли; 
	
	УстановитьЗаглушкуHTML();
	
	ДобавитьУсловноеОформлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)          
	
	ИнтерфейсныеПравки();
	
	ТолькоВажныеПриИзменении(Неопределено);
	
	УстановитьАктивнуюСтрокуПриОткрытии();
	КоличествоНепрочитанныхУведомлений = КоличествоНепрочитанныхУведомлений();
	
	UseFullRedNotificationBell = МодульОбъектаКлиент().ПолучитьФункциональнуюОпциюEDI("UseFullRedNotificationBell", Ложь);
	
	НоваяМетрика().Категория("Сервис_ЦентрУведомленийУправляемая")
				  .ОткрытаФорма(ЭтаФорма)
				  .ДобавитьПеременную("КоличествоНепрочитанныхУведомлений", КоличествоНепрочитанныхУведомлений)
				  .ДобавитьПеременную("ТолькоВажные", ТолькоВажные)
				  .ДобавитьПеременную("ИспользоватьАльтернативнуюИконку", UseFullRedNotificationBell)
				  .ПоместитьВОчередь();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтерфейсныеПравки()
	
	Попытка
		Элементы.ВыбранноеУведомление.ТолькоПросмотр = Ложь;
	Исключение
	 	;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОтправитьМетрикуДлительностиПросмотра();
	
	Отбор = Новый Структура;
	Отбор.Вставить("Прочитано", Ложь); 
	НепрочитанныеУведомления = Уведомления.НайтиСтроки(Отбор);
	
	Оповестить("ЗакрытиеЦентраУведомлений", Булево(НепрочитанныеУведомления.Количество()));
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ТолькоВажныеПриИзменении(Элемент)

	Если ТолькоВажные Тогда
		Отбор = Новый ФиксированнаяСтруктура("Важное", Истина);	
		Элементы.Уведомления.ОтборСтрок = Отбор;
		УстановитьВидимостьЭлементов();
	Иначе
		
		ВыделенныеСтрокиУведомления = МодульОбъектаКлиент().ВыделенныеСтрокиТаблицыФормы_КонтурEDI(Элементы.Уведомления);
		ВыделенныеСтрокиУведомления.Очистить();
	    	
		Элементы.Уведомления.ОтборСтрок = Неопределено;
		УстановитьЗаглушкуHTML();
		Элементы.УведомлениеПросмотрено.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеПрочитаноПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Уведомления.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;  
		
	ТекущиеДанные.Прочитано = Истина;
	ТекущиеДанные.ИндексКартинки = 0;
	
	УстановитьХешСуммуУведомленияEDIСервер(ТекущиеДанные.Идентификатор, ТекущиеДанные.ХешСумма);
	
	Элементы.УведомлениеПросмотрено.Доступность = Ложь;
	
	ОтправитьМетрикуДлительностиПросмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбратитьсяВТехподдержкуНажатие(Элемент)
	
	НоваяМетрика().НажатаНадпись(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	МодульОбъектаКлиент().ОткрытьЦентрПоддержки();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыУведомления

&НаКлиенте
Процедура ВыбранноеУведомлениеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ВРег(ДанныеСобытия.Event.srcElement.nodeName) <> "A" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Уведомления.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	href = ДанныеСобытия.Event.srcElement.href;
	name = ДанныеСобытия.Event.srcElement.outerText;
	
	Если ЗначениеЗаполнено(href) Тогда
		
		РезультатОткрытия = Новый Структура();
		РезультатОткрытия.Вставить("БраузерОткрылся" , Ложь);
		РезультатОткрытия.Вставить("ТекстОшибки"	 , "");
		
		МодульОбъектаКлиент().ПерейтиНаСтраницуСайта(href, РезультатОткрытия);
		
		Если РезультатОткрытия.БраузерОткрылся Тогда 
			НоваяМетрика().НаФорме(ЭтаФорма)
						  .Категория("Сервис_ЦентрУведомленийУправляемая")
						  .НажатаСсылка(name, href)
						  .ДобавитьПеременную("ИдентификаторУведомления", ТекущиеДанные.Идентификатор)
						  .ДобавитьПеременную("ЗаголовокУведомления", ТекущиеДанные.ЗаголовокКонтента)
						  .ПоместитьВОчередь();
		КонецЕсли;
					  
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура УбратьАктивизациюСтрокиПриОткрытии() экспорт
	
	ВыделенныеСтрокиУведомления = МодульОбъектаКлиент().ВыделенныеСтрокиТаблицыФормы_КонтурEDI(Элементы.Уведомления);
	ВыделенныеСтрокиУведомления.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАктивнуюСтрокуПриОткрытии()
	
	Отбор = Новый Структура;
	Отбор.Вставить("Прочитано", Ложь);
	Отбор.Вставить("Важное", Истина); 
	НепрочитанныеУведомления = Уведомления.НайтиСтроки(Отбор);
	
	Если НепрочитанныеУведомления.Количество() <> 0 Тогда
		СтрокаТЗ = НепрочитанныеУведомления[0]; 
		ИдентификаторСтроки = СтрокаТЗ.ПолучитьИдентификатор();
		Элементы.Уведомления.ТекущаяСтрока = ИдентификаторСтроки;
	Иначе 
		НужноСкрытьАктивизациюСтроки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте                                                
Процедура УведомленияПриАктивизацииСтроки(Элемент)
	
	Если НужноСкрытьАктивизациюСтроки = Истина Тогда
        Элементы.УведомлениеПросмотрено.Видимость = Ложь;
		ПодключитьОбработчикОжидания("УбратьАктивизациюСтрокиПриОткрытии", 0.1, Истина);
		НужноСкрытьАктивизациюСтроки = Ложь;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Уведомления.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Если НЕ ПредыдущаяСтрокаВажное Тогда
			ОтправитьМетрикуДлительностиПросмотра();	
		КонецЕсли;
		
		ПредыдущаяСтрокаВажное 			= ТекущиеДанные.Важное;
		ПредыдущаяСтрокаЗаголовок 		= ТекущиеДанные.ЗаголовокКонтента;
		ПредыдущаяСтрокаИдентификатор 	= ТекущиеДанные.Идентификатор;
		
		Если НЕ ТекущиеДанные.Прочитано Тогда
			НачалоПросмотраУведомления = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Иначе
			НачалоПросмотраУведомления = Дата('00010101');
		КонецЕсли;
		
		УстановитьТелоКонтентаHTML(ТекущиеДанные.ТелоКонтента);
		
		Если НЕ ТекущиеДанные.Прочитано 
			И НЕ ТекущиеДанные.Важное Тогда
			
			ТекущиеДанные.Прочитано = Истина;
			ТекущиеДанные.ИндексКартинки = 0;
			
			УстановитьХешСуммуУведомленияEDIСервер(ТекущиеДанные.Идентификатор, ТекущиеДанные.ХешСумма);
			
		КонецЕсли;
		
	КонецЕсли;

	УстановитьВидимостьЭлементов();
		
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули();
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Ошибка! Не удалось получить контекст основной формы.";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

&НаСервере
Процедура ДобавитьУсловноеОформлениеФормы()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт( , , Истина));
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Уведомления.Прочитано");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Ложь;
	ЭлементУсловия.Использование  = Истина; 
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("УведомленияЗаголовок");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаглушкуHTML()
	
	МакетЗаглушки = МодульОбъекта().ПолучитьМакет_КонтурEDI("ЗаглушкаЦентрУведомлений_html", "html", Истина, Ложь, Истина, Ложь);
	ТекстHTML = МакетЗаглушки.ПолучитьТекст();
	
	Если Уведомления.Количество() Тогда
		ТекстЗамены = "Для просмотра уведомления выберите его из списка";
	Иначе     
		ТекстЗамены = "Список уведомлений пуст";
	КонецЕсли;  
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{ТекстСообщения}", ТекстЗамены);
	
	ВыбранноеУведомление = ТекстHTML;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	ТекущиеДанные = Элементы.Уведомления.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.УведомлениеПросмотрено.Видимость = Ложь;	
	Иначе   
		Элементы.УведомлениеПросмотрено.Доступность = НЕ ТекущиеДанные.Прочитано;
		
		Если ТекущиеДанные.Важное Тогда
			Элементы.УведомлениеПросмотрено.Видимость = Истина;
		Иначе
			Элементы.УведомлениеПросмотрено.Видимость = Ложь;	
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьХешСуммуУведомленияEDIСервер(Знач Идентификатор, Знач ХешСумма)
	
	МодульОбъекта().УведомленияEDI_УстановитьХешСумму(Идентификатор, ХешСумма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТелоКонтентаHTML(Знач ТелоКонтента)
	
	ВыбранноеУведомление = ТелоКонтента;	
	
КонецПроцедуры

&НаКлиенте
Функция КоличествоНепрочитанныхУведомлений()

	Отбор = Новый Структура;
	Отбор.Вставить("Прочитано", Ложь);
	НепрочитанныеУведомления = Уведомления.НайтиСтроки(Отбор);
	КоличествоНепрочитанныхУведомлений = НепрочитанныеУведомления.Количество();
	Возврат КоличествоНепрочитанныхУведомлений; 
	
КонецФункции

&НаКлиенте
Процедура ОтправитьМетрикуДлительностиПросмотра()
	
	Если ЗначениеЗаполнено(НачалоПросмотраУведомления) Тогда
		
		КонецПросмотраУведомления = ТекущаяУниверсальнаяДатаВМиллисекундах();	
		ВремяПросмотра = КонецПросмотраУведомления - НачалоПросмотраУведомления;
		
		НачалоПросмотраУведомления = 0;
        МиллисекундВСекунде = 1000;
		
		НоваяМетрика().Категория("Сервис_ЦентрУведомленийУправляемая")
		              .Поведение()
					  .Событие("ПросмотрУведомления")
					  .НаФорме(ЭтаФорма)
					  .ДобавитьПеременную("ИдентификаторУведомления", ПредыдущаяСтрокаИдентификатор)
					  .ДобавитьПеременную("ЗаголовокУведомления", ПредыдущаяСтрокаЗаголовок)
					  .ДобавитьПеременную("ДлительностьПросмотра", ВремяПросмотра / МиллисекундВСекунде)
					  .ПоместитьВОчередь();
		
	КонецЕсли;	
	
КонецПроцедуры

// #КонецОбласти
