&НаСервере
Перем МодульОбъекта;

&НаСервере
Перем ОсобенностиСообщений;

&НаСервере
Перем ПараметрыАвтотестирования Экспорт;

////Перем Сообщение; // для создания формы  перенесено в реквизиты формы
//Перем НастройкаФормы;
Перем МетаданныеСообщения;
Перем ВнешнееХранилище;
Перем СообщениеАлко;
Перем ПараметрыДействия;
Перем СтруктураВременногоХранилища;

&НаКлиенте
Перем ЗакрытиеРазрешено;

&НаКлиенте
Перем МодульОбъектаКлиент;

&НаКлиенте
Перем ОсобенностьВыбранаИзСпискаВыбора;

&НаКлиенте
Перем КлассификаторПеречислений_КонтурEDI;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

&НаКлиенте
Функция КлассификаторПеречислений()
	
	Если КлассификаторПеречислений_КонтурEDI = Неопределено Тогда
		КлассификаторПеречислений_КонтурEDI = МодульОбъектаКлиент().ВыполнитьМетодМодуляОбъекта("Функция", "ПолучитьКлассификаторПеречисленийEDI");
	КонецЕсли;
	
	Возврат КлассификаторПеречислений_КонтурEDI;
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	// TODO устаревший параметр
	Параметры.МодальностьЗапрещена = Объект.ПараметрыКлиентСервер.МодальностьЗапрещена;
	ТолькоПросмотрСообщения = Параметры.ТолькоПросмотр;
	
	ТипСообщения = Параметры.ТипСообщения;   //нужны для условного оформления
	РежимРаботы = Параметры.РежимРаботы;     

	МодульОбъекта().ДлительнаяОперация_Начать();   
	
	СформироватьСообщениеДляОткрытияКарточки(); //Здесь заполняем ключевой реквизит формы "Сообщение"
	
	//заполнение формы
	ПроизвестиПервоначальноеЗаполнениеПолейНаФорме();
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();

	ЗаполнитьОписаниеТиповЗначенийОбъектовEDI();
	
	УстановитьЗаголовокФормы_КонтурEDI();
	
	Если Объект.ПараметрыКлиентСервер.ТекущийВариантИнтерфейса = "Версия8_5" Тогда
		АдаптироватьФормуПодИнтерфейс85();
	КонецЕсли;
	
	КонтурЛогистика_НастроитьЭлементыФормы();
	
	МодульОбъекта().ДлительнаяОперация_Завершить();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьФормуПодИнтерфейс85()
	
	Элементы.Товары.РежимВыделения = РежимВыделенияТаблицы.Одиночный;	
	
КонецПроцедуры

//Формирование сообщения которое будет показываться в карточке
&НаСервере
Процедура СформироватьСообщениеДляОткрытияКарточки()

	Если Параметры.ПроизвольныеПараметры = Неопределено Тогда
		Параметры.ПроизвольныеПараметры = Новый Структура;
	КонецЕсли;
	
	// В ТабСообщения направление может не соответствовать сообщению, которое формируем,
	// поэтому будем проверять направление по совокупности факторов: тип сообщения и режим работы
	НаправлениеСообщения = МодульОбъекта().ПолучитьНаправлениеСообщения(ТипСообщения, Параметры.РежимРаботы);
	
	Если ТолькоПросмотрСообщения
		ИЛИ НаправлениеСообщения = "Входящее" Тогда
		
		// открываем уже существующее сообщение по ссылке и это все только для просмотра
		Сообщение = МодульОбъекта().ПрочитатьСообщение(Параметры.СообщениеСсылка, , ТипСообщения, Параметры.СообщениеСсылка.Направление);
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.СообщениеСсылка) Тогда
		
		// похоже здесь так, потому что в основном списке задач может быть строка с другим типом сообщения 
		НайденноеСообщениеСсылка = МодульОбъекта().НайтиСообщениеДокумента(Параметры.Документ1С, ТипСообщения, "Исходящее");
		Параметры.ПроизвольныеПараметры.Вставить("СообщениеСсылка", НайденноеСообщениеСсылка);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПереотправляемоеСообщениеСсылка) Тогда
		
		// сообщение существует, но пользователь хочет его переотправить
		Параметры.ПроизвольныеПараметры.Вставить("Действие", 						"Переотправка"); 		
		Параметры.ПроизвольныеПараметры.Вставить("ПереотправляемоеСообщениеСсылка", Параметры.ПереотправляемоеСообщениеСсылка);		
		
	КонецЕсли;
	
	//Проверка будет выполнена при первоначальном заполнении полей
	Параметры.ПроизвольныеПараметры.Вставить("ПропуститьПроверкуСообщения", Истина);
	
	Сообщение = МодульОбъекта().ПодготовитьИсходящееСообщение(ТипСообщения, Параметры.Документ1С, Параметры.ПроизвольныеПараметры);

КонецПроцедуры // СвормироватьСообщениеДляОткрытияКарточки()

&НаСервере
Процедура ЗаполнитьОписаниеТиповЗначенийОбъектовEDI()
	
	ТипыЗначенийОбъектовEDI = Новый Структура;
	
	Для каждого ТипЗначенияОбъекта Из МодульОбъекта().ТаблицаТипов Цикл
		
		Попытка
			ТипыЗначенийОбъектовEDI.Вставить(ТипЗначенияОбъекта.ИмяОбъекта, ТипЗначенияОбъекта.ИмяТипа);
		Исключение
			Продолжить;
		КонецПопытки;	
			
		Если Не ТипЗначенияОбъекта.ИмяТипа = Неопределено Тогда
			ИмяТипаВМетаданных = МодульОбъекта().ИмяТипаОбъектаВМетаданных_КонтурEDI(ТипЗначенияОбъекта.ИмяТипа);
			ТипыЗначенийОбъектовEDI.Вставить(ТипЗначенияОбъекта.ИмяОбъекта + "ВМетаданных", ИмяТипаВМетаданных); 
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ДозаполнитьАртикулКодПолноеНаименованиеТЧТовары()
	
	ТЗТовары = РеквизитФормыВЗначение("Товары");
	ТЗТовары.Сортировать("НомерСтроки");
	
	МодульОбъекта().ДозаполнитьАртикулКодПолноеНаименованиеВТаблицеТоваров(ТЗТовары);
	
	ЗначениеВРеквизитФормы(ТЗТовары,"Товары");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроанализироватьСостояниеЮЗсчф()
	
	Если (Сообщение.ТипСообщения = "INVOIC" ИЛИ Сообщение.ТипСообщения = "COINVOIC")
		И ЗначениеЗаполнено(Сообщение.СообщениеСсылка) 
		И Сообщение.Направление = "Исходящее"
		И ЗначениеЗаполнено(messageId)
		И ЗначениеЗаполнено(boxId) Тогда 
		
		Состояние("Получение статусов из Диадока...");
		
		Если СтатусыЮЗДО = Неопределено Тогда
			
			СтруктураИдентификаторов = Новый Структура;
			СтруктураИдентификаторов.Вставить("boxId",boxId); //идентификаторы определены при создании на сервере в ПроверитьЗаполнениеПолей - по сути это проверка
			СтруктураИдентификаторов.Вставить("messageId",messageId);
			СтруктураИдентификаторов.Вставить("invoiceId",invoiceId);
			СтруктураИдентификаторов.Вставить("torg12Id",torg12Id);
			СтруктураИдентификаторов.Вставить("UniversalTransferDocumentId",UniversalTransferDocumentId);
			СтруктураИдентификаторов.Вставить("Документ",Документ1С);
			
			ОсновнаяФорма().МодульОбменКлиент().СброситьПроверкиДанныхАвторизации();
			
			СтатусыЮЗДО = ОсновнаяФорма().МодульОбменКлиент().УзнатьСостояниепоСФ(Отправитель1С,СтруктураИдентификаторов.boxId,СтруктураИдентификаторов.messageId,ИдентификаторыДоверенностей);
			ОсновнаяФорма().МодульОбменКлиент().СброситьПарольКонтейнераДанныхАвторизации();
			
		КонецЕсли;
		
		Если СтатусыЮЗДО.Успешно = Ложь Тогда 
			
			НоваяСтрока = ТаблицаОшибок.Добавить();
			НоваяСтрока.ТекстОшибки = "Не удалось получить статус из Диадок.";
			НоваяСтрока.Действие 	= "Информация";
			НоваяСтрока.ИмяПоля		= "СтатусДиадок";
			
			НоваяСтрока = ТаблицаОшибок.Добавить();
			НоваяСтрока.ТекстОшибки = СтатусыЮЗДО.ОписаниеОшибки;
			НоваяСтрока.Действие 	= "Информация";
			НоваяСтрока.ИмяПоля		= "СтатусДиадок";
			
			СтатусыЮЗДО = Неопределено;

		Иначе
			
			КлассификаторСтатусовДД = ОсновнаяФорма().ПолучитьКлассификаторСтатусовДД();
			
			ВывестиВОшибкиСостояниеЮЗДО(СтатусыЮЗДО, ТаблицаОшибок, КлассификаторСтатусовДД, ДоверенностиСообщения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроанализироватьСостояниеЮЗсчф()

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиВОшибкиСостояниеЮЗДО(СтатусыЮЗДО, ТаблицаОшибок, КлассификаторСтатусовДД, ДоверенностиСообщения) //они не являются ошибками, это уведомления
	
	Если СтатусыЮЗДО = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если КлассификаторСтатусовДД <> Неопределено Тогда
				
		МассивСвойств = Новый СписокЗначений;
		МассивСвойств.Добавить("СтатусСФ", "Статус СФ");
		МассивСвойств.Добавить("СтатусТорг12", "Статус Торг12");
		МассивСвойств.Добавить("СтатусУПД", "Статус");
		МассивСвойств.Добавить("КомментарийКЗапросуУточнения", "Комментарий к запросу уточнения");
		МассивСвойств.Добавить("КомментарийКОтказуВПодписи", "Комментарий к отказу");
		МассивСвойств.Добавить("КомментарийКЗапросуАннулированияСФ", "Запрос аннулирования СФ");
		МассивСвойств.Добавить("КомментарийКЗапросуАннулированияТОРГ12", "Запрос аннулирования Торг12");
		МассивСвойств.Добавить("КомментарийКЗапросуАннулированияУПД", "Запрос аннулирования УПД");
		МассивСвойств.Добавить("СтатусАннулированияСФ", "Статус аннулирования СФ");   
		МассивСвойств.Добавить("СтатусАннулированияТорг12", "Статус аннулирования Торг12");
		МассивСвойств.Добавить("СтатусАннулированияУПД", "Статус аннулирования УПД");
		
		Для Каждого СвойствоДокумента Из МассивСвойств Цикл
			
			ЗначениеСвойства = "";
			СтатусыЮЗДО.Свойство(СвойствоДокумента.Значение, ЗначениеСвойства);
			
			Если ЗначениеСвойства <> "" И ЗначениеСвойства <> Неопределено Тогда
				
				ТекстОшибки = "";
				
				Если Лев(СвойствоДокумента.Значение,11) = "Комментарий" Тогда
					
					ТекстОшибки = СвойствоДокумента.Представление+": """ + ЗначениеСвойства + """";
					
				Иначе
					
					ПсевдонимСтатуса = КлассификаторСтатусовДД.НайтиПоЗначению(ЗначениеСвойства);
					Если ПсевдонимСтатуса <> Неопределено Тогда 
						
						ТекстОшибки = СвойствоДокумента.Представление + ": " + ПсевдонимСтатуса.Представление;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ТекстОшибки <> "" 
					И ТаблицаОшибок.НайтиСтроки(Новый Структура("ТекстОшибки", ТекстОшибки)).Количество() = 0 Тогда
					
					НоваяСтрока = ТаблицаОшибок.Добавить();
					НоваяСтрока.ТекстОшибки = ТекстОшибки;
					НоваяСтрока.ИмяПоля		= "СтатусДиадок";
					НоваяСтрока.Действие	= "Информация";
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	Если СтатусыЮЗДО.МашиночитаемыеДоверенности.Входящие.Количество() > 0 
			ИЛИ СтатусыЮЗДО.МашиночитаемыеДоверенности.Исходящие.Количество() > 0 Тогда
		
		НоваяСтрока = ТаблицаОшибок.Добавить();
		НоваяСтрока.ТекстОшибки = "Машиночитаемые доверенности документа";
		НоваяСтрока.ИмяПоля = "МашиночитаемыеДоверенности";
		НоваяСтрока.Действие = "Показать";
		
		ДоверенностиСообщения = СтатусыЮЗДО.МашиночитаемыеДоверенности;
		
	КонецЕсли;
	
	Если СтатусыЮЗДО.ОшибкиПолученияМЧД.Количество() > 0 Тогда
		
		ТекстОшибок = "Ошибки при получении информации о доверенностях";
		
		Для каждого ОшибкаПолученияМЧД Из СтатусыЮЗДО.ОшибкиПолученияМЧД Цикл
			ТекстОшибок = ТекстОшибок + Символы.ПС + ОшибкаПолученияМЧД;
		КонецЦикла;
		
		НоваяСтрока = ТаблицаОшибок.Добавить();
		НоваяСтрока.ТекстОшибки = ТекстОшибок;
		НоваяСтрока.ИмяПоля = "СтатусДиадок";
		НоваяСтрока.Действие = "Информация";
		
	КонецЕсли;
	
КонецПроцедуры // ВывестиСостояниеЮЗДО()

&НаСервере   
Процедура УстановитьЗаголовкиРеквизитов()

	Если  МодульОбъекта().ЭтоОбратнаяОтгрузка(Сообщение.ТипСообщения) Тогда
		Элементы.НадписьЮрФизЛицоСвое.Заголовок			= "Контрагент";
		Элементы.НадписьЮрФизЛицоСтороннее.Заголовок	= "Организация";
	Конецесли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//доступность реквизитов и значения типов установлены при создании на сервере
	//Здесь только мелкие штрихи
	
	ПроанализироватьСостояниеЮЗсчф();//если это INVOIC	
	
	Если СообщениеСодержитДанныеОбУпаковках Тогда
		ОбновитьДанныеРазмещения("ПриОткрытии");		
		//Элементы.ТранспортныеУпаковки.Развернуть(ТранспортныеУпаковки.ПолучитьЭлементы()[0].ПолучитьИдентификатор());
	КонецЕсли;
	
	Если Элементы.ГруппаТранспортировка.Видимость = Истина Тогда 
		Сообщить("В заказе указаны врата времени РЦ");
		УстановитьВысотуСпискаВрат();
	КонецЕсли;   	
	
	Если ТаблицаОшибок.Количество() = 0 Тогда
		ЗакрытьПанельОшибокКлиент();
	Иначе
		ОткрытьПанельОшибокКлиент();
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Параметры.ПараметрыАвтотестирования) Тогда
		ПодключитьОбработчикОжидания("ЗапуститьАвтотесты",0.1,Истина);
	КонецЕсли;
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "ФормаСообщенияУправляемая");
	
КонецПроцедуры

&НаКлиенте
Функция Автотесты_ПолучитьКодСледующегоШага()
	
	Код = Неопределено;
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.ПараметрыАвтотестирования);

	Для Каждого Стр Из СтруктураПараметров.ВыполняемыйКод Цикл
		
		Если Стр.Выполнено Тогда
			Продолжить;
		КонецЕсли;
		Если Стр.ФормаОбработки = "ФормаСообщения" Тогда
			Код = Стр.ВыполняемыйКод;
			Прервать;
		Иначе
			Прервать;//есть невыполненный код в другой форме
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Код;
	
КонецФункции

&НаКлиенте
Процедура Автотесты_ПометитьПоследнийШагКакВыполненный()
	
	Код = Неопределено;
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.ПараметрыАвтотестирования);
	Для Каждого Стр Из СтруктураПараметров.ВыполняемыйКод Цикл
		
		Если Стр.Выполнено Тогда
			Продолжить;
		КонецЕсли;
		Если Стр.ФормаОбработки = "ФормаСообщения" Тогда
			Стр.Выполнено = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(СтруктураПараметров,Параметры.ПараметрыАвтотестирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьАвтотесты()
	
	Пока Истина Цикл
		
		Код = Автотесты_ПолучитьКодСледующегоШага();
		
		Если Код = Неопределено Тогда
			
			Прервать;
			
		Иначе
			
			Выполнить(Код);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроизвестиПервоначальноеЗаполнениеПолейНаФорме() Экспорт
	
	Элементы.СтраницаАлкоголь.Видимость = Ложь;
	
	КтоМы = МодульОбъекта().ОпределитьКемМыЯвляемся(Сообщение);
	
	СтатусДляФормированияДействий = ОпределитьСтатусДляФормированияДействий(Сообщение);
	
	НастройкаФормы = МодульОбъекта().ПолучитьНастройкиФормыСообщения(Сообщение.ТипСообщения,Сообщение.Направление,СтатусДляФормированияДействий);
	
	НастройкаСсылокИсправленияОшибок = МодульОбъекта().ПолучитьНастройкуВыводаСсылокНаОбъектыСообщения();
	
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	
	МетаданныеСообщения = МодульОбъекта().ПолучитьМетаданныеСообщения(Сообщение.ТипСообщения,Сообщение.Направление);
	
	Если ТолькоПросмотрСообщения Тогда
		НастройкаФормы.ТолькоПросмотрПолей1С = Истина;
		НастройкаФормы.ТолькоПросмотрПолейEDI = Истина;
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ЭтоАрхивноеСообщение = Сообщение.Свойство("Архив") И Сообщение.Архив = Истина;
    
	Если Сообщение.Направление = "Входящее" И Не ЭтоАрхивноеСообщение Тогда
		МодульОбъекта().КонвертироватьСообщениеEDIв1С(Сообщение); //сообщене следует переконвертировать т.к. с момента его загрузки могли измениться настройки соответствий и проч.
	КонецЕсли;
	
	ИспользоватьДопПараметрыУпаковки = (МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Сообщение.Партнер, "ИспользоватьДопПараметрыУпаковки") = Истина);

	УстановитьЗаголовкиРеквизитов();
	
	СоздатьКнопки(НастройкаФормы.КнопкиКоманднойПанели);
	СоздатьКнопкиДопРеквизитов(НастройкаФормы.КнопкиДопРеквизитов);
	
	//Заполним Особенности
	ЗаполнитьОсобенностиСообщенияНаФорме_ОсновнойМодуль();
	ПоместитьИдентификаторыОсобенностейСообщенияВДанныеФормы();
	МодульОбъекта().ДобавитьУсловноеОформлениеОсобенностейСообщения(ЭтаФорма);
	НужноКонвертироватьОсобенностиВСообщении = МодульОбъекта().НужноКонвертироватьОсобенностиВСообщении(Сообщение); 
	
	ЗаполнитьСпискиВыбораКолонок();
	ЗаполнитьПоляНаФорме();
	МодульОбъекта().ЗаполнитьОсобенностиСтруктурТоваровСообщения(Товары, Сообщение);
	УстановитьТипыПолей1С();
	УстановитьВидимость();
	УстановитьДоступностьПолей();
	МодульОбъекта().УстановитьФорматЭлементаФормы_КонтурEDI(Элементы.ТоварыКоэффициентEDIВ1С);
	
	Если ЗначениеЗаполнено(Сообщение.СообщениеСсылка) Тогда 
		МодульОбъекта().Метки_ПриСозданииеФормы(ЭтаФорма, Сообщение.СообщениеСсылка);
	КонецЕсли;
	
	МодульОбъекта().ПриОткрытииФормыСообщения(Сообщение,ЭтаФорма);//только вызов ПМ
	
	НетОшибок = Истина;
	
	Если НастройкаФормы.ПроверятьПоляПриОткрытииФормы Тогда
		
		НетОшибок = ПроверитьЗаполнениеПолей();
		
		ВывестиПредупреждениеОВосстановленииКодовМаркировки();
		
		Если НетОшибок = Истина Тогда
			Сообщение.СодержитОшибки = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Сообщение.Направление = "Входящее" 
			И Сообщение.ТипСообщения = "ORDERS" Тогда
		ЗаполнитьСписокВерсийORDERS();	
	КонецЕсли;
	
	Если Сообщение.Направление = "Входящее" Тогда
		Элементы.ТоварыНоменклатура.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	ЗаполнитьТипыТранспортныхУпаковок(); 
	ЗаполнитьIDСущностейДД();
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьИдентификаторыОсобенностейСообщенияВДанныеФормы();
	
	ОсобенностиСообщений = МодульОбъекта().ОсобенностиСообщений;
	
	Для каждого Особенность Из ОсобенностиСообщений Цикл
		ИдентификаторыОсобенностейСообщения.Добавить(Особенность.ПолныйИдентификаторОсобенности);
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ВывестиПредупреждениеОВосстановленииКодовМаркировки()
	
	Если МодульОбъекта().ПеременнаяСодержитСвойство(Сообщение,"КодыМаркировкиОтредактированыВручную") 
		И Сообщение.КодыМаркировкиОтредактированыВручную = Истина
		И ОтправлятьКодыМаркировки 
		И Не ТолькоПросмотрСообщения Тогда
		
		Предупреждение = ТаблицаОшибок.Добавить();
		Предупреждение.ТекстОшибки = "Коды маркировки были восстановлены из сохраненного сообщения. Перезаполнить по данным 1С можно в окне просмотра кодов.";
		Предупреждение.Действие = "Открыть коды маркировки";
		Предупреждение.ИмяПоля = "КодыМаркировки";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьIDСущностейДД()
	
	Если Сообщение.ТипСообщения = "INVOIC" или Сообщение.ТипСообщения = "COINVOIC" Тогда
		
		СтруктураИдентификаторовДД = МодульОбъекта().ПолучитьСписокСвойствEDI("boxId,messageId,invoiceId,torg12Id,UniversalTransferDocumentId", Сообщение.ДокументСсылка);
		
		boxId 				= СтруктураИдентификаторовДД.boxId;
		messageId 			= СтруктураИдентификаторовДД.messageId;
		invoiceId 			= СтруктураИдентификаторовДД.invoiceId;
		torg12Id 			= СтруктураИдентификаторовДД.torg12Id;
		UniversalTransferDocumentId = СтруктураИдентификаторовДД.UniversalTransferDocumentId;
		
		ИдентификаторыДоверенностей = МодульОбъекта().ПолучитьИдентификаторыДоверенностейСообщения(Сообщение.СообщениеСсылка);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыТранспортныхУпаковок()
	
	Если Элементы.СтраницаТранспортныеУпаковки.Видимость Тогда	
		
		ТипыТранспортныхУпаковок = МодульОбъекта().ТипыТранспортныхУпаковок_КонтурEDI();
		
		Для Каждого ТипУпаковки Из ТипыТранспортныхУпаковок Цикл
			
			КодУпаковки = ТипУпаковки.Ключ;
			НаименованиеУпаковки = Строка(ТипУпаковки.Значение.Наименование);
			
			// транспортная упаковка
			Команда = Команды.Найти("ВыбратьУпаковку" + КодУпаковки);
			
			Если Команда = Неопределено Тогда
				
				Команда = Команды.Добавить("ВыбратьУпаковку" + КодУпаковки);
				Команда.Действие 	= "ВыбратьТипУпаковки";
				Команда.Заголовок 	= НаименованиеУпаковки;
				Команда.Отображение	= ОтображениеКнопки.Текст;
				
			КонецЕсли;
			
			НоваяКнопка = Элементы.Найти(Команда.Имя);
			
			Если НоваяКнопка = Неопределено Тогда
				
				НоваяКнопка = Элементы.Добавить(Команда.Имя, Тип("КнопкаФормы"), Элементы.ТранспортныеУпаковкиВыбратьТипУпаковки);
				НоваяКнопка.ИмяКоманды = Команда.Имя;
				
			КонецЕсли;
			
			// вложенная упаковка
			КомандаВложеннаяУпаковка = Команды.Найти("ВыбратьВложеннуюУпаковку" + КодУпаковки);
			
			Если КомандаВложеннаяУпаковка = Неопределено Тогда
				
				КомандаВложеннаяУпаковка = Команды.Добавить("ВыбратьВложеннуюУпаковку" + КодУпаковки);
				КомандаВложеннаяУпаковка.Действие 	= "ВыбратьТипВложеннойУпаковки";
				КомандаВложеннаяУпаковка.Заголовок 	= НаименованиеУпаковки;
				КомандаВложеннаяУпаковка.Отображение	= ОтображениеКнопки.Текст;
				
			КонецЕсли;
			
			НоваяКнопкаВложенная = Элементы.Найти(КомандаВложеннаяУпаковка.Имя);
			
			Если НоваяКнопкаВложенная = Неопределено Тогда
				
				НоваяКнопкаВложенная = 
				Элементы.Добавить(КомандаВложеннаяУпаковка.Имя, Тип("КнопкаФормы"), Элементы.ТранспортныеУпаковкиВыбратьТипВложеннойУпаковки);
				
				НоваяКнопкаВложенная.ИмяКоманды = КомандаВложеннаяУпаковка.Имя;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы_КонтурEDI()
	
	ПредставлениеТипаСообщения = НастройкаФормы.Заголовок;
	ПредставлениеДатыСообщения = МодульОбъекта().ПолучитьПредставлениеДатыСообщения(Сообщение);
	
	ЭтаФорма.Заголовок = ПредставлениеТипаСообщения + " (" + Сообщение.ТипСообщения + ") " + ПредставлениеДатыСообщения;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораКолонок()
	
	СпискиВыбораКолонок = НастройкаФормы.СпискиВыбораКолонок;
	
	Для каждого ТекСписок Из СпискиВыбораКолонок Цикл
	    ЗаполнитьСписокВыбораЭлемента(Элементы["Товары" + ТекСписок.Ключ], ТекСписок.Значение);
	КонецЦикла;
	
	// Для транспортных упаковок
	СписокЕдиницИзмеренияВеса = Новый СписокЗначений;
	СписокЕдиницИзмеренияВеса.Добавить("KGM", "KGM (кг)");
	СписокЕдиницИзмеренияВеса.Добавить("GRM", "GRM (г)");
	СписокЕдиницИзмеренияВеса.Добавить("MGM", "MGM (мг)");
	
	СписокЕдиницИзмеренияГабаритов = Новый СписокЗначений;
	СписокЕдиницИзмеренияГабаритов.Добавить("MTR", "MTR (м)");
	СписокЕдиницИзмеренияГабаритов.Добавить("DMT", "DMT (дм)");
	СписокЕдиницИзмеренияГабаритов.Добавить("CMT", "CMT (см)");
	СписокЕдиницИзмеренияГабаритов.Добавить("MMT", "MMT (мм)");
	
	СпискиВыбораТранспортныхУпаковок = Новый Структура;
	СпискиВыбораТранспортныхУпаковок.Вставить("КодЕдиницыИзмеренияВесаНетто", 	СписокЕдиницИзмеренияВеса);
	СпискиВыбораТранспортныхУпаковок.Вставить("КодЕдиницыИзмеренияВесаБрутто", 	СписокЕдиницИзмеренияВеса);
	СпискиВыбораТранспортныхУпаковок.Вставить("КодЕдиницыИзмеренияДлины", 		СписокЕдиницИзмеренияГабаритов);
	СпискиВыбораТранспортныхУпаковок.Вставить("КодЕдиницыИзмеренияШирины", 		СписокЕдиницИзмеренияГабаритов);
	СпискиВыбораТранспортныхУпаковок.Вставить("КодЕдиницыИзмеренияВысоты", 		СписокЕдиницИзмеренияГабаритов);
	
	Для каждого ТекСписок Из СпискиВыбораТранспортныхУпаковок Цикл
	    ЗаполнитьСписокВыбораЭлемента(Элементы["ТранспортныеУпаковки" + ТекСписок.Ключ], ТекСписок.Значение);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораЭлемента(Элемент, Список)
	
	Элемент.СписокВыбора.Очистить();
	
	Для каждого Эл Из Список Цикл
		Элемент.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;	

КонецПроцедуры

//Заполним список версий, если он есть
	//1. Получить все похожие сообщения - ИЗ МОДУЛЯ ИНТЕГРАЦИИ. 
	//По партнеру, номеру заказа, дате (+- месяц, например)
	//формат: таблица - ссылка, дата, номер (на всякий случай)
	//последнее сообщение должно быть актуальным
	//и пронумеровать их
	//2. Создать кнопки версий
	//каждая кнопка должна открывать нужное сообщение
	//причем остальные кнопки должны быть доступны только в актуальном сообщении! Т.е. создавать документы можно только из актуального
	//и если документы уже были созданы в каком-то старом сообщении, то их надо переподцепить к новому
	//тоже через МОДУЛЬ ИНТЕГРАЦИИ            
&НаСервере
Процедура ЗаполнитьСписокВерсийORDERS()
	
	Дубли = МодульОбъекта().ПолучитьДублирующиеСообщения(Сообщение.СообщениеСсылка);

	Если Дубли.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;   
	
	ПроверкаВерсий = Дубли.НайтиСтроки(Новый Структура("Ссылка", Сообщение.СообщениеСсылка));
	
	Если ПроверкаВерсий.Количество() = Дубли.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ВерсииСообщения.Загрузить(Дубли);
		
	Элементы.СписокВерсий.Видимость=Истина;
	
	ГлавнаяКнопка = Неопределено;
	Если Элементы.ОсновноеДействиеФормы1.ИмяКоманды<>"NOP" Тогда 
		ГлавнаяКнопка = Элементы.ОсновноеДействиеФормы1;
	ИначеЕсли Элементы.ОсновноеДействиеФормы2.ИмяКоманды<>"NOP" Тогда
		ГлавнаяКнопка = Элементы.ОсновноеДействиеФормы2;
	ИначеЕсли Элементы.ОсновноеДействиеФормы3.ИмяКоманды<>"NOP" Тогда
		ГлавнаяКнопка = Элементы.ОсновноеДействиеФормы3;
	ИначеЕсли Элементы.ОсновноеДействиеФормы4.ИмяКоманды<>"NOP" Тогда
		ГлавнаяКнопка = Элементы.ОсновноеДействиеФормы4;
	КонецЕсли;
	
	Если ГлавнаяКнопка <> Неопределено Тогда
		ГлавнаяКнопка.Заголовок = "Обработать новую версию";
		ГлавнаяКнопка.ИмяКоманды = "КнопкаДействияФормыВыборВерсииНажатие";//подменим на клиентскую команду, которая будет задавать вопрос о дальнейшей судьбе
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСписокВерсийORDERS()

&НаСервере
Функция ПроверитьЗаполнениеПолей() Экспорт
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	ОчиститьПометкиПолей();
	
	ТаблицаОшибок.Очистить();
	
	ЕстьОшибкиВПрикрепленных = Ложь;
	
	// смотрим на статусное сообщение
	Если Сообщение.Направление = "Исходящее" Тогда
		
		СтатусноеСообщениеОбОшибке = МодульОбъекта().ПрочитатьСообщение(,Сообщение.ДокументСсылка,Сообщение.ТипСообщения);
		
		Если НЕ СтатусноеСообщениеОбОшибке = Неопределено Тогда
			
			СтатусноеСообщениеОбъект = МодульОбъекта().ПолучитьОбъектСообщения(СтатусноеСообщениеОбОшибке.СообщениеСсылка);
			ТекстОшибки = СтатусноеСообщениеОбъект.ОписаниеОшибки;
			
			МодульОбъекта().ОбработатьТекстОшибки(ТекстОшибки, ТаблицаОшибок, Истина);
			
			РеквизитОписаниеОшибкиALCRPT = СтатусноеСообщениеОбъект.ДополнительныеРеквизиты.Найти("ОшибкаALCRPT","ИмяРеквизита");
			
			Если РеквизитОписаниеОшибкиALCRPT <> Неопределено Тогда
				ТекстОшибки = РеквизитОписаниеОшибкиALCRPT.ЗначениеСтрока;				
				МодульОбъекта().ОбработатьТекстОшибки(ТекстОшибки, ТаблицаОшибок);       				
			КонецЕсли; 			
			
		КонецЕсли;
						
		Если ЗначениеЗаполнено(СообщениеАлко) Тогда
			
			СтатусноеСообщениеОбОшибке = МодульОбъекта().ПрочитатьСообщение(,СообщениеАлко.ДокументСсылка,СообщениеАлко.ТипСообщения,,Истина);
			
			Если НЕ СтатусноеСообщениеОбОшибке = Неопределено Тогда
				
				ТекстОшибки = СтатусноеСообщениеОбОшибке.СообщениеСсылка.ОписаниеОшибки;
				
				НоваяСтрока = ТаблицаОшибок.Добавить();
				НоваяСтрока.ТекстОшибки = ТекстОшибки;
				
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого Стр ИЗ ТаблицаПрикрепленныхСообщений Цикл
			
			Если ЗначениеЗаполнено(Стр.Примечание) Тогда
				
				НоваяСтрока = ТаблицаОшибок.Добавить();
				НоваяСтрока.ТекстОшибки = "В прикрепленных сообщениях были найдены ошибки: "+СокрЛП(Стр.Примечание);
				ЕстьОшибкиВПрикрепленных = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	//
	
	// проверка алко полей
	ЕстьАлкоОшибки = Ложь;
	Если ЗначениеЗаполнено(СообщениеАлко) Тогда
		Если СообщениеАлко.СодержитОшибки = Истина Тогда
			
			ЕстьАлкоОшибки=Истина;	
			РезультатПроверки = МодульОбъекта().ПроверитьПоляСообщения(СообщениеАлко,Неопределено);
			Для Каждого Стр Из РезультатПроверки.СписокОшибок Цикл
				НоваяСтрока = ТаблицаОшибок.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
			КонецЦикла;
			
		КонецЕсли;
		//проверки перенесены в МО.ПроверитьПоляСообщения
	КонецЕсли;
	
	ПроверитьЗаполнениеОбязательныхПолей();    
	
	КопияСообщения = МодульОбъекта().ПолучитьКопиюСообщения(Сообщение);
	
	Если Сообщение.Направление = "Входящее" Тогда
		
		ПеренестиПоля1СвСообщение(КопияСообщения);
		
		Если РежимРаботы = "Поставщик"
			И Сообщение.СтатусСсылки = "ВходящийНеПрошелВалидацию" Тогда
			СообщениеОбъект = МодульОбъекта().ПолучитьОбъектСообщения(Сообщение.СообщениеСсылка);
			ОшибкиВалидации = МодульОбъекта().ПолучитьОшибкиВалидацииИзОбъектаСообщения(СообщениеОбъект);
			Для Каждого ОшибкаВалидации Из ОшибкиВалидации Цикл
				НоваяСтрока = ТаблицаОшибок.Добавить();
				НоваяСтрока.ИмяПоля = "ОшибкаВалидации";
				НоваяСтрока.ТекстОшибки = ОшибкаВалидации.Значение;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьДействиеЮрФизЛицаСервер("ЮрФизЛицоСвое",		"Подробнее");
	УстановитьДействиеЮрФизЛицаСервер("ЮрФизЛицоСтороннее",	"Подробнее");
	УстановитьДействиеЮрФизЛицаСервер("Грузоотправитель",		"Подробнее");
	УстановитьДействиеЮрФизЛицаСервер("Грузополучатель",		"Подробнее");
	
	РезультатПроверки = МодульОбъекта().ПроверитьПоляСообщения(КопияСообщения);
	
	Если НЕ РезультатПроверки.Успешно Тогда
		
		СписокОшибок = РезультатПроверки.СписокОшибок;
		
		Элементы.ОткрытьИнструкциюСопоставленияТоваров.Видимость = Ложь;
		
		НайденнаяСтрока = СписокОшибок.Найти("Номенклатура", "ИмяПоля");
		
		Если НайденнаяСтрока <> Неопределено Тогда
			Элементы.ОткрытьИнструкциюСопоставленияТоваров.Видимость = Истина;
		КонецЕсли;
		
		Для Каждого Стр Из СписокОшибок Цикл
				
			НоваяСтрока = ТаблицаОшибок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
			
			НайденнаяСтрока = НастройкаСсылокИсправленияОшибок.Найти(Стр.ИмяПоля,"ИмяПоля");
			Если Не НайденнаяСтрока = Неопределено Тогда
				НоваяСтрока.Действие = НайденнаяСтрока.ТекстСсылки;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Стр.ИмяТабличнойЧасти) Тогда
			
				Поле = Элементы.Найти(Стр.ИмяПоля);
				Если Не Поле = Неопределено Тогда
				    Поле.ЦветФона = WebЦвета.ЛососьСветлый;
				КонецЕсли;
				
			Иначе
				
				Если НЕ Стр.ИмяПоля = Стр.ИмяТабличнойЧасти И Стр.ИмяТабличнойЧасти = "Товары" Тогда
					
					ТекКолонка = Элементы.Найти(Стр.ИмяТабличнойЧасти+Стр.ИмяПоля);    //это поле формы а не колонка
					
					Если НЕ ТекКолонка = Неопределено Тогда
						Если ТекКолонка.Видимость = Ложь Тогда
							
							ТекКолонка.Видимость	= Истина;
							ТекКолонка.Доступность	= Истина;
							
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Стр.ИмяПоля = "Продавец1С" Тогда
				
				Если КтоМы = "Поставщик" Тогда
					УстановитьДействиеЮрФизЛицаСервер("ЮрФизЛицоСвое",		"Нажмите, чтобы настроить", Истина);
				Иначе
					УстановитьДействиеЮрФизЛицаСервер("ЮрФизЛицоСтороннее",	"Нажмите, чтобы настроить", Истина);
				КонецЕсли;
				
			ИначеЕсли Стр.ИмяПоля = "ПродавецEDI" Тогда
				
				Если КтоМы = "Поставщик" Тогда
					УстановитьДействиеЮрФизЛицаСервер("ЮрФизЛицоСвое",		"Исправить ошибки", Истина);
				Иначе
					УстановитьДействиеЮрФизЛицаСервер("ЮрФизЛицоСтороннее",	"Исправить ошибки", Истина);
				КонецЕсли;
				
			ИначеЕсли Стр.ИмяПоля = "Покупатель1С" Тогда
				
				Если КтоМы = "Поставщик" Тогда
					УстановитьДействиеЮрФизЛицаСервер("ЮрФизЛицоСтороннее",	"Нажмите, чтобы настроить", Истина);
				Иначе
					УстановитьДействиеЮрФизЛицаСервер("ЮрФизЛицоСвое",		"Нажмите, чтобы настроить", Истина);
				КонецЕсли;
				
			ИначеЕсли Стр.ИмяПоля = "ПокупательEDI" Тогда
				
				Если КтоМы = "Поставщик" Тогда
					УстановитьДействиеЮрФизЛицаСервер("ЮрФизЛицоСтороннее",	"Исправить ошибки", Истина);
				Иначе
					УстановитьДействиеЮрФизЛицаСервер("ЮрФизЛицоСвое",		"Исправить ошибки", Истина);
				КонецЕсли;
				
			ИначеЕсли Стр.ИмяПоля = "ГрузополучательEDI" Тогда	
				
				УстановитьДействиеЮрФизЛицаСервер("Грузополучатель",	"Исправить ошибки", Истина);
				
			ИначеЕсли Стр.ИмяПоля = "ГрузоотправительEDI" Тогда	
				
				УстановитьДействиеЮрФизЛицаСервер("Грузоотправитель",	"Исправить ошибки", Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ВывестиВОшибкиСостояниеЮЗДО(СтатусыЮЗДО, ТаблицаОшибок, КлассификаторСтатусовДД, ДоверенностиСообщения);
	
	ВывестиОшибкиПроверкиДоверенностей();
	
	Если ТаблицаОшибок.Количество()=0 Тогда
		ЗакрытьПанельОшибокСервер();
	Иначе
		ОткрытьПанельОшибокСервер();
	КонецЕсли;       	
	
	Если РезультатПроверки.Успешно Тогда
		РезультатПроверки.Успешно = НЕ ЕстьАлкоОшибки;
	КонецЕсли;
	
	Если РезультатПроверки.Успешно Тогда
		РезультатПроверки.Успешно = НЕ ЕстьОшибкиВПрикрепленных;
	КонецЕсли;
	
	Если НЕ РезультатПроверки.Успешно Тогда
		Если Сообщение.Направление = "Исходящее" Тогда
			ВывестиПанельИнформации("В сообщении найдены ошибки, их необходимо исправить перед отправкой.","Плохо");
		Иначе
			ВывестиПанельИнформации("Для загрузки сообщения проставьте соответствия.","Плохо");
		КонецЕсли;
	Иначе
		Если Сообщение.Направление = "Исходящее" Тогда
			Если Не ТаблицаОшибок.Количество() = 0 Тогда
				ВывестиПанельИнформации("В сообщении найдены ошибки, их необходимо исправить перед отправкой.");		
			Иначе
				ВывестиПанельИнформации("Поздравляем! Все ошибки исправлены, теперь можно отправить сообщение.","Хорошо");
			КонецЕсли;
		Иначе
			ВывестиПанельИнформации("Поздравляем! Все соответствия проставлены, теперь можно загрузить сообщение.","Хорошо");
		КонецЕсли;
	КонецЕсли;
	
	КопияСообщения = Неопределено;
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
		
	Возврат РезультатПроверки.Успешно;
	
КонецФункции 

&НаСервере
Процедура ВывестиОшибкиПроверкиДоверенностей()                 
	
	Если НЕ ЗначениеЗаполнено(Сообщение.СообщениеСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбъекта().ВывестиОшибкиПроверкиДоверенностейНаФорме(ЭтаФорма, Сообщение.СообщениеСсылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьПанельОшибокСервер()
	
	Элементы.ПанельОшибок.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОткрытьПанельОшибокСервер()
	
	Элементы.ПанельОшибок.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПанельОшибокКлиент()
	
	Элементы.ПанельОшибок.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПанельОшибокКлиент()
	
	Элементы.ПанельОшибок.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДействиеЮрФизЛицаСервер(ИмяПоля,Текст,ЕстьОшибки = Ложь)
	
	Надпись = Элементы["Действие"+ИмяПоля];	
	Надпись.Заголовок = Текст;
	Если ЕстьОшибки Тогда
		Надпись.ЦветТекста = WebЦвета.Коричневый;
	Иначе
		Надпись.ЦветТекста = WebЦвета.СинийСоСтальнымОттенком;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиПоля1СвСообщение(ТекСообщение)
	
	ТекСообщение.Продавец1С 		= Продавец1С;
	ТекСообщение.Покупатель1С 		= Покупатель1С;
	ТекСообщение.Грузоотправитель1С = Грузоотправитель1С;
	ТекСообщение.Грузополучатель1С	= Грузополучатель1С;
	ТекСообщение.Валюта1С			= Валюта1С;
	
	ТекСообщение.Отправитель1С		= Отправитель1С;
	ТекСообщение.Получатель1С		= Получатель1С;
	
	ПереформироватьЕдиницыИзмерения=Ложь;
	
	ИсключаяСвойства = "СтранаEDI,НомерГТДEDI,Наименование";
	
	Если ТекСообщение.ТипСообщения = "RECADV" Тогда
		ИсключаяСвойства = ИсключаяСвойства + ",КоличествоКВозвратуИПричинаEDI,КоличествоКВозвратуИПричина1С";	
	КонецЕсли;
		
	сч = 0;
	
	Для каждого Стр Из Товары Цикл
		
		ТекСтрокаТоваров = ТекСообщение.Товары[сч];
 		ЗаполнитьЗначенияСвойств(ТекСтрокаТоваров, Стр, , ИсключаяСвойства);
		Если ТипЗнч(ТекСтрокаТоваров.ЕдиницаИзмерения) <> ТипЗнч(Стр.ЕдиницаИзмерения) Тогда
			ПереформироватьЕдиницыИзмерения = Истина;
		КонецЕсли;
		
		сч = сч+1;
		
	КонецЦикла;
	
	Если ПереформироватьЕдиницыИзмерения Тогда //замена типа единицы измерения интерактивными действиями 
		ТекСообщение.Товары.Колонки.Удалить(ТекСообщение.Товары.Колонки.ЕдиницаИзмерения);
		ТекСообщение.Товары.Колонки.Добавить("ЕдиницаИзмерения");
		сч = 0;
		Для каждого Стр Из Товары Цикл
			ТекСтрокаТоваров = ТекСообщение.Товары[сч];
			ТекСтрокаТоваров.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
			сч = сч+1;
		КонецЦикла;
	КонецЕсли;//
	
	
	Если ТекСообщение.Направление = "Входящее" Тогда
		
		ТекСообщение.Партнер = Отправитель1С;
		
	Иначе
		
		ТекСообщение.Партнер = Получатель1С;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьПометкиПолей()
	
	//рефакторинг оживить пометки
	
	//ЭлементыФормы.ПометкаПродавец1С.Видимость = Ложь;
	//ЭлементыФормы.ПометкаПродавецEDI.Видимость = Ложь;
	//ЭлементыФормы.ПометкаПокупатель1С.Видимость = Ложь;
	//ЭлементыФормы.ПометкаПокупательEDI.Видимость = Ложь;
	//
	//ЭлементыФормы.ПометкаГрузоотправитель1С.Видимость = Ложь;
	//ЭлементыФормы.ПометкаГрузоотправительEDI.Видимость = Ложь;
	//ЭлементыФормы.ПометкаГрузополучатель1С.Видимость = Ложь;
	//ЭлементыФормы.ПометкаГрузополучательEDI.Видимость = Ложь;
	//
	//ЭлементыФормы.ПометкаВалюта1С.Видимость = Ложь;
	//ЭлементыФормы.ПометкаВалютаEDI.Видимость = Ложь;
	//
	//ЭлементыФормы.ПометкаСтатус.Видимость = Ложь;
	//ЭлементыФормы.ПометкаКомментарий.Видимость = Ложь;
	//
	//ЭлементыФормы.ПометкаДатаВремяПоставки.Видимость = Ложь;
	//ЭлементыФормы.ПометкаДоговор.Видимость = Ложь;
	//
	//ЭлементыФормы.ПометкаЗаказ1С.Видимость = Ложь;
	//ЭлементыФормы.ПометкаЗаказEDI.Видимость = Ложь;
	//ЭлементыФормы.ПометкаНакладная1С.Видимость = Ложь;
	//ЭлементыФормы.ПометкаНакладнаяEDI.Видимость = Ложь;
	//ЭлементыФормы.ПометкаПриемка1С.Видимость = Ложь;
	//ЭлементыФормы.ПометкаПриемкаEDI.Видимость= Ложь;
	//ЭлементыФормы.ПометкаСчетФактура1С.Видимость = Ложь;
	//ЭлементыФормы.ПометкаСчетФактураEDI.Видимость= Ложь;
	//
	//ЭлементыФормы.ПометкаОтправитель1С.Видимость = Ложь;
	//ЭлементыФормы.ПометкаОтправительEDI.Видимость = Ложь;
	//ЭлементыФормы.ПометкаПолучатель1С.Видимость = Ложь;
	//ЭлементыФормы.ПометкаПолучательEDI.Видимость = Ложь;
	//
	//ЭлементыФормы.ПометкаСуммаВсего.Видимость = Ложь;
	//ЭлементыФормы.ПометкаСуммаВсегоБезНДС.Видимость = Ложь;
	//ЭлементыФормы.ПометкаСуммаВсегоНДС.Видимость = Ложь;
	//
	//ЭлементыФормы.ПометкаДатаОтгрузки.Видимость = Ложь;
	
	
	
КонецПроцедуры

&НаСервере
Процедура СделатьНевидимымЭлементФормы(ИмяЭлементаФормы)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлементаФормы);
	Если НЕ НайденныйЭлемент = Неопределено Тогда
		
		НайденныйЭлемент.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	//НастройкаФормы была получена в МодульОбъекта().ПолучитьНастройкиФормыСообщения()
	
	НевидимыеПоля = НастройкаФормы.НевидимыеПоля;
	
	Для Каждого Стр ИЗ НевидимыеПоля Цикл
		
		ИмяПоля = Стр.Значение;
		
		// пробуем всевозможные варианты
		СделатьНевидимымЭлементФормы("Надпись"+ИмяПоля);
		СделатьНевидимымЭлементФормы("НадписьНомер"	+ ИмяПоля);
		СделатьНевидимымЭлементФормы("НадписьДата"	+ ИмяПоля);
		СделатьНевидимымЭлементФормы(ИмяПоля);
		СделатьНевидимымЭлементФормы(ИмяПоля+"1С");
		СделатьНевидимымЭлементФормы(ИмяПоля+"EDI");
		СделатьНевидимымЭлементФормы(ИмяПоля+"Номер");
		СделатьНевидимымЭлементФормы(ИмяПоля+"Дата");
		
	КонецЦикла;
	
	НевидимыеКолонки = НастройкаФормы.НевидимыеКолонки;
	
	Для Каждого Колонка ИЗ Элементы.Товары.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(Колонка) = Тип("ПолеФормы") Тогда 
			
			НайденнаяКолонка = НевидимыеКолонки.НайтиПоЗначению(Сред(Колонка.Имя,7));
			
			Если НайденнаяКолонка = Неопределено Тогда
				Колонка.Видимость	= Истина;
				Колонка.Доступность = Истина;
			Иначе
				Колонка.Видимость	= Ложь;
				Колонка.Доступность	= Ложь;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Колонка) = Тип("ГруппаФормы") Тогда
			
			Для Каждого Колонка ИЗ Колонка.ПодчиненныеЭлементы Цикл
				
				НайденнаяКолонка = НевидимыеКолонки.НайтиПоЗначению(Сред(Колонка.Имя,7));
				
				Если НайденнаяКолонка = Неопределено Тогда
					Колонка.Видимость	= Истина;
					Колонка.Доступность = Истина;
				Иначе
					Колонка.Видимость	= Ложь;
					Колонка.Доступность	= Ложь;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Если НЕ Элементы.Заказ1С.Видимость И НЕ Элементы.Накладная1С.Видимость И НЕ Элементы.Приемка1С.Видимость И НЕ Элементы.СчетФактура1С.Видимость Тогда
		Элементы.СтраницыСообщения.ПодчиненныеЭлементы.СтранницаСвязанныеДокументы.Видимость = Ложь;
	КонецЕсли;
	
	Если ОбязательныйКодТовараПокупателя = Истина Тогда
		КолонкаКода = Элементы.ТоварыКодТовараПокупателя;
		КолонкаКода.Видимость = Истина;
		КолонкаКода.ТолькоПросмотр = Ложь;
		КолонкаКода.Доступность = Истина;
	КонецЕсли;
	
	Если (Сообщение.ТипСообщения = "ORDERS" ИЛИ Сообщение.ТипСообщения = "RECADV" ИЛИ Сообщение.ТипСообщения = "RETANN") 
		И Сообщение.Направление = "Входящее" Тогда
		Элементы.ТоварыНеЗагружать.Видимость = Истина;
	Иначе
		Элементы.ТоварыНеЗагружать.Видимость = Ложь;
	КонецЕсли;
	
	Если Сообщение.ТипСообщения = "ORDRSP"
		ИЛИ Сообщение.ТипСообщения = "RECADV" Тогда
		Элементы.ТоварыКомментарий.Видимость = Истина;
		Элементы.ТоварыКомментарий.Доступность = Истина;
	КонецЕсли;
	
	Элементы.ТоварыКомментарий.ТолькоПросмотр = НЕ (Сообщение.ТипСообщения = "ORDRSP");
	
	Если (Сообщение.ТипСообщения = "DESADV" И Сообщение.Направление = "Исходящее")
		 ИЛИ (Сообщение.ТипСообщения = "ORDRSP" И Сообщение.Направление = "Исходящее")
		 ИЛИ (Сообщение.ТипСообщения = "PORDERS" И Сообщение.Направление = "Исходящее")
	Тогда
		Элементы.ДействиеДатаПоставки.Видимость = Истина;
	КонецЕсли;
	
	Если Сообщение.ТипСообщения = "INVOIC" Тогда
		
		Если НЕ ЗначениеЗаполнено(ДатаПоставки) Тогда
			Элементы.ДействиеДатаПоставки.Видимость = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(Статус) Тогда 
			Элементы.Статус.Видимость = Истина;	
		КонецЕсли;	
		
	КонецЕсли;
	
	Если Сообщение.ТипСообщения = "ORDERS" И Сообщение.Направление = "Входящее" Тогда
		Если Сообщение.Свойство("ОбратныйЗаказ1С") И ЗначениеЗаполнено(Сообщение.ОбратныйЗаказ1С) Тогда
            Элементы.ТоварыНеЗагружать.Доступность = Ложь;
			Элементы.ТоварыНеЗагружать.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// устанавливаем видимой закладку "Данные об упаковках"
	Элементы.СтраницаТранспортныеУпаковки.Видимость = ОтправлятьДанныеОбУпаковках ИЛИ СообщениеСодержитДанныеОбУпаковках;

	// для упаковок SSCC добавились параметры: вес, габариты, температурный режим
	Если Элементы.СтраницаТранспортныеУпаковки.Видимость Тогда
		
		ВидимостьДопПараметровУпаковки = ИспользоватьДопПараметрыУпаковки ИЛИ Сообщение.Направление = "Входящее";
		
		ТипУпаковкиПоУмолчанию = "201";
		ВыбраннаяУпаковкаЗаголовок = "Евро-палета (201)";
		УстановитьЗаголовокВыбраннойУпаковкиСервер(ВыбраннаяУпаковкаЗаголовок);
		
		ТипВложеннойУпаковки = "CT";
		ВыбраннаяВложеннаяУпаковкаЗаголовок = "Коробка (CT)";
		УстановитьЗаголовокВыбраннойВложеннойУпаковкиСервер(ВыбраннаяВложеннаяУпаковкаЗаголовок);  
				
		Элементы.ТранспортныеУпаковкиГруппаВесНетто.Видимость 			= ВидимостьДопПараметровУпаковки;		
		Элементы.ТранспортныеУпаковкиГруппаВесБрутто.Видимость 			= ВидимостьДопПараметровУпаковки;		
		Элементы.ТранспортныеУпаковкиГруппаДлина.Видимость 				= ВидимостьДопПараметровУпаковки;		
		Элементы.ТранспортныеУпаковкиГруппаШирина.Видимость 			= ВидимостьДопПараметровУпаковки;		
		Элементы.ТранспортныеУпаковкиГруппаВысота.Видимость 			= ВидимостьДопПараметровУпаковки;		
		Элементы.ТранспортныеУпаковкиГруппаТемпературныйРежим.Видимость = ВидимостьДопПараметровУпаковки;
		Элементы.ТранспортныеУпаковкиКодыМаркировкиПредставление.Видимость = ОтправлятьКодыМаркировки;
		Элементы.ТранспортныеУпаковкиКодыМаркировкиУпаковок.Видимость = ОтправлятьКодыМаркировки;
			
	КонецЕсли;
	
	// Врата X5
	Если  ((Сообщение.ТипСообщения = "ORDERS" И Сообщение.Направление = "Входящее") ИЛИ (Сообщение.ТипСообщения = "ORDRSP" И Сообщение.Направление = "Исходящее"))
		и Сообщение.Свойство("Транспортировка")
		и Сообщение.Транспортировка<>Неопределено
		и Сообщение.Транспортировка.Свойство("ДатаВремяПрибытия") 
		и Сообщение.Транспортировка.ДатаВремяПрибытия<>неопределено 
		и Сообщение.Транспортировка.ДатаВремяПрибытия.Количество()>0
		Тогда 
		Элементы.ГруппаТранспортировка.Видимость = истина;
	Иначе
		Элементы.ГруппаТранспортировка.Видимость = Ложь;
	КонецЕсли;
	
	ОтображатьКонтакты = Ложь;
	МассивТипыСообщений = МодульОбъекта().EDI_РазложитьСтрокуВМассивСлов("ORDERS,ORDRSP,DESADV", ",");
	
	Если МассивТипыСообщений.Найти(Сообщение.ТипСообщения) <> Неопределено И 
		ЗначениеЗаполнено(Элементы.ПредставлениеКонтакты.Заголовок) Тогда
		
		ОтображатьКонтакты = Истина;
		
	КонецЕсли;
			
	Элементы.ГруппаКонтакты.Видимость = ОтображатьКонтакты;		
	Элементы.ДействиеДатаПоставки.Ширина = ?(ОтображатьКонтакты, 8, Элементы.ДействиеЮрФизЛицоСвое.Ширина);

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПолей()
	
	// пока опускаем грузоотправителя
	Элементы.Грузоотправитель1С.ТолькоПросмотр = Истина;
	
	ТолькоПросмотрПолей1С = НастройкаФормы.ТолькоПросмотрПолей1С;
	
	//Если НастройкаФормы.ТолькоПросмотрПолей1С Тогда
	
	Элементы.Документ1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	
	Элементы.Покупатель1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.Продавец1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.Грузоотправитель1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.Грузополучатель1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.Договор.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.Валюта1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	
	Элементы.Возврат1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.Заказ1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.Накладная1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.Приемка1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.СчетФактура1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	
	Элементы.Отправитель1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.Получатель1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	
	Элементы.ТоварыНоменклатура.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.ТоварыХарактеристикаНоменклатуры.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.ТоварыЕдиницаИзмерения.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.ТоварыСтавкаНДС1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.ТоварыСтрана1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.ТоварыНомерГТД1С.ТолькоПросмотр = ТолькоПросмотрПолей1С;
	Элементы.ТоварыРешениеПоВозврату.ТолькоПросмотр = ТолькоПросмотрПолей1С;	
	
	Элементы.ТоварыПричинаРешения.ТолькоПросмотр = ТолькоПросмотрСообщения;
	
	//КонецЕсли;
	
	ТолькоПросмотрПолейEDI = НастройкаФормы.ТолькоПросмотрПолейEDI;
	
	Элементы.ПокупательEDI.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ПродавецEDI.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ГрузоотправительEDI.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ГрузополучательEDI.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	
	Элементы.ВалютаEDI.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	
	Элементы.ВозвратНомер.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ВозвратДата.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ОбратныйЗаказНомер.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ЗаказНомер.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ЗаказДата.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.НакладнаяНомер.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.НакладнаяДата.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ПриемкаНомер.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ПриемкаДата.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.СчетФактураНомер.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.СчетФактураДата.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	
	Элементы.ОтправительEDI.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ПолучательEDI.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	
	Элементы.ТоварыGTIN.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Если ОбязательныйКодТовараПокупателя = Истина Тогда
		Элементы.ТоварыКодТовараПокупателя.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ТоварыКодТовараПокупателя.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	КонецЕсли;
	Элементы.ТоварыКодТовараПоставщика.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ТоварыНаименование.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ТоварыКодЕдиницыИзмеренияEDI.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	
	Элементы.ТоварыСтавкаНДСEDI.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ТоварыСтранаEDI.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ТоварыНомерГТДEDI.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ТоварыКоличествоКВозвратуИПричинаEDI.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	Элементы.ТоварыКоличествоКВозвратуИПричина1С.ТолькоПросмотр = ТолькоПросмотрПолейEDI;
	
	//КонецЕсли;
	
	Элементы.ТоварыКоличество.ТолькоПросмотр = Истина;
	Элементы.ТоварыЦенаСНДС.ТолькоПросмотр = Истина;
	Элементы.ТоварыЦенаБезНДС.ТолькоПросмотр = Истина;
	Элементы.ТоварыСуммаСНДС.ТолькоПросмотр = Истина;
	Элементы.ТоварыСуммаБезНДС.ТолькоПросмотр = Истина;
	Элементы.ТоварыСуммаНДС.ТолькоПросмотр = Истина;
	
	Элементы.ТоварыКоличествоСверхпоставки.ТолькоПросмотр = Истина;
	Элементы.ТоварыКоличествоНедопоставки.ТолькоПросмотр = Истина;
	
	Если ТолькоПросмотрСообщения ИЛИ Сообщение.Направление = "Входящее" Тогда 
		
		Элементы.ТоварныеПозиции.ТолькоПросмотр = Истина;
		Элементы.ТранспортныеУпаковки.ТолькоПросмотр = Истина;
		
		Элементы.РазместитьКаждыйТоварВОтдельнойУпаковке.Доступность = Ложь;
		
		Элементы.ТранспортныеУпаковки.КоманднаяПанель.Доступность 	= Ложь;
		Элементы.ГруппаРазделительИУправляющиеКнопки.Доступность	= Ложь;
					
	КонецЕсли;
	
	Элементы.Комментарий.ТолькоПросмотр = ТолькоПросмотрСообщения 
	ИЛИ НЕ МодульОбъекта().ПередаватьКомментарийВИсходящихСообщениях(Сообщение.Направление, Сообщение.ТипСообщения, Сообщение.Партнер);   
	
	Элементы.Особенности.ТолькоПросмотр = Параметры.ТолькоПросмотр;
	
	Элементы.ТипыМаркируемойПродукции.ТолькоПросмотр = ТолькоПросмотрСообщения;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипПоля1С(ИмяПоля)
	
	Если МетаданныеСообщения=Неопределено Тогда 
		МетаданныеСообщения=МодульОбъекта().ПолучитьМетаданныеСообщения(Сообщение.ТипСообщения,Сообщение.Направление);
	КонецЕсли;
	
	СтрокаМетаданных = МетаданныеСообщения.Найти(ИмяПоля,"ИмяПоля");
	
	Если НЕ СтрокаМетаданных = Неопределено Тогда
		
		Тип1С = СтрокаМетаданных.Тип1С;
		Если ЗначениеЗаполнено(Тип1С) Тогда
			
			Если СтрокаМетаданных.Принадлежность = "1С" ИЛИ СтрокаМетаданных.Принадлежность = "=" Тогда
				ИмяНаФорме = ИмяПоля;
			Иначе
				ИмяНаФорме = ИмяПоля+"1С";
			КонецЕсли;
			
			ПолеФормы	= Элементы[ИмяНаФорме];
			ТипПоля		= МодульОбъекта().ПолучитьТипЗначенияОбъекта(Тип1С);
			
			Если ТипПоля = Неопределено ИЛИ (ВнешнееХранилище И Найти(ТипПоля,"КонтурEDI_")>0) Тогда
				//Сообщить("Не задан тип объекта 1С для поля с типом "+Тип1С);
			Иначе	
				
				Элементы[ИмяНаФорме].ОграничениеТипа = Новый ОписаниеТипов(ТипПоля);
				                     
				Если НЕ ЗначениеЗаполнено(Сообщение[ИмяНаФорме]) Тогда
					
					ЭтаФорма[ИмяНаФорме] = МодульОбъекта().ПолучитьПустуюСсылкуОбъекта(Тип1С);
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьТипКолонки1С(ИмяПоля)
	
	СвойстваПоля = МодульОбъекта().ПолучитьСвойстваПоля(ИмяПоля,МетаданныеСообщения);
	
	Если ЗначениеЗаполнено(СвойстваПоля.ИмяНаФорме1С) И ЗначениеЗаполнено(СвойстваПоля.Тип1С) Тогда
		
		ПолеФормы	= Элементы["Товары"+СвойстваПоля.ИмяНаФорме1С];
		ТипПоля		= МодульОбъекта().ПолучитьТипЗначенияОбъекта(СвойстваПоля.Тип1С);
		
		Если ТипПоля = Неопределено Тогда
			
			//Сообщить("Не задан тип объекта 1С для поля с типом "+СвойстваПоля.Тип1С);
			
		Иначе	
			
			ПолеФормы.ОграничениеТипа = Новый ОписаниеТипов(ТипПоля);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыПолей1С()
	
	УстановитьТипПоля1С("Документ");
	
	УстановитьТипПоля1С("Продавец");
	УстановитьТипПоля1С("Покупатель");
	УстановитьТипПоля1С("Грузоотправитель");
	УстановитьТипПоля1С("Грузополучатель");
	УстановитьТипПоля1С("Договор");
	УстановитьТипПоля1С("Валюта");
	УстановитьТипПоля1С("Заказ");
	УстановитьТипПоля1С("Накладная");
	УстановитьТипПоля1С("Приемка");
	
	ТипЮрФизЛицоСвое = МодульОбъекта().ПолучитьТипЗначенияОбъекта("ЮрФизЛицоСвое");
	Если ЗначениеЗаполнено(ТипЮрФизЛицоСвое) Тогда
		
		ОписаниеТиповЮрФизЛицо = Новый ОписаниеТипов(ТипЮрФизЛицоСвое);
		
		Если Сообщение.Направление = "Исходящее" Тогда
			Элементы.Отправитель1С.ОграничениеТипа = ОписаниеТиповЮрФизЛицо;
			УстановитьТипПоля1С("Получатель");
		Иначе
			Элементы.Получатель1С.ОграничениеТипа = ОписаниеТиповЮрФизЛицо;
			УстановитьТипПоля1С("Отправитель");
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьТипКолонки1С("Номенклатура");
	УстановитьТипКолонки1С("ХарактеристикаНоменклатуры");
	УстановитьТипКолонки1С("ЕдиницаИзмерения");
	УстановитьТипКолонки1С("СтавкаНДС");
	УстановитьТипКолонки1С("Страна");
	УстановитьТипКолонки1С("НомерГТД");
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПрикрепленныеСообщения()
	
	ТаблицаПрикрепленныхСообщений.Очистить();
	
	ОтправкаТолькоALCRPT = Ложь;
	
	Накладная = Неопределено;

	Если МодульОбъекта().СтрСодержит_КонтурEDI("DESADV,INVOIC", Сообщение.ТипСообщения) Тогда
		Если Сообщение.ТипСообщения = "DESADV" И МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Сообщение.Получатель1С,"ОтправлятьALCRPT") = Истина Тогда
			 Накладная = Сообщение.Документ1С;
		ИначеЕсли Сообщение.ТипСообщения = "INVOIC" И МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Сообщение.Получатель1С,"ОтправлятьALCRPTсINVOIC") = Истина Тогда
			 Накладная = МодульОбъекта().ПолучитьНакладнуюСчетаФактуры(Сообщение.Документ1С);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Накладная) Тогда // Нужно отправить ALCRPT
		
		Элементы.СтраницаАлкоголь.Видимость = Истина;
		
		АлкоТовары.Очистить();
		
		СообщениеАлко = МодульОбъекта().ПодготовитьИсходящееСообщение("ALCRPT",Накладная);
		//!! если сделать произвольным реквизитом при передаче на клиент упадет! или чистить ТЗ у неё
		
		Для каждого Стр Из СообщениеАлко.Товары Цикл
			
			НоваяСтрока = АлкоТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
			
			НоваяСтрока.АлкоЛицензияПоставщика	= МодульОбъекта().ПолучитьПредставлениеАлкоЛицензии(Стр.АлкоЛицензияПоставщика); 
			НоваяСтрока.АлкоСертификатПродукции = МодульОбъекта().ПолучитьПредставлениеАлкоЛицензии(Стр.АлкоСертификатПродукции); 
			
		КонецЦикла;
		
		НомерТТН	= СообщениеАлко.ТранспортнаяНакладнаяEDI.Номер;
		ДатаТТН		= СообщениеАлко.ТранспортнаяНакладнаяEDI.Дата;
		
		//отправляем только алко если desadv уже дошел и явно не указано что это переотправка desadv
		Если Сообщение.ТипСообщения = "DESADV" Тогда
			Если МодульОбъекта().ПолучитьСтатусСообщения(, Накладная, "DESADV") = "Доставлен" 
				И НЕ ЗначениеЗаполнено(Параметры.ПереотправляемоеСообщениеСсылка) Тогда
				ОтправкаТолькоALCRPT = Истина;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПрикрепленныхСообщений.Добавить();
		НоваяСтрока.СообщениеПредставление = "Данные об алкогольной продукции (ALCRPT)";
		НоваяСтрока.Документ = Сообщение.ДокументСсылка;
		
	КонецЕсли;
	
	Если Сообщение.ТипСообщения = "DESADV" Тогда
		
		Если МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Сообщение.Получатель1С,"ОтправлятьINVOICсDESADV") = Истина Тогда
			
			СчетФактура = МодульОбъекта().ПолучитьСчетФактуруНакладной(Сообщение.Документ1С);
			//!! если сделать произвольным реквизитом при передаче на клиент упадет! или чистить ТЗ у неё
			
			Если ЗначениеЗаполнено(СчетФактура) Тогда
				СообщениеСФ = МодульОбъекта().ПодготовитьИсходящееСообщение("INVOIC",СчетФактура);
				
				НоваяСтрока = ТаблицаПрикрепленныхСообщений.Добавить();
				НоваяСтрока.СообщениеПредставление = "Счет-фактура (INVOIC)";
				НоваяСтрока.Документ = СчетФактура;
				
			Иначе
				
				НоваяСтрока = ТаблицаПрикрепленныхСообщений.Добавить();
				НоваяСтрока.СообщениеПредставление = "Счет-фактура (INVOIC)";
				НоваяСтрока.Документ = СчетФактура;
				НоваяСтрока.Примечание = "Не найден счет-фактура!";
				НоваяСтрока.ЕстьОшибки = Истина;
				
			КонецЕсли;
			
		КонецЕсли
		
	КонецЕсли;
	
	Если ТаблицаПрикрепленныхСообщений.Количество()=0 Тогда
		
		Элементы.ПанельДопИнформации.ТекущаяСтраница = Элементы.ПанельДопИнформации.ПодчиненныеЭлементы.СтраницаНаименований;
		
	Иначе
		
		Элементы.ПанельДопИнформации.ТекущаяСтраница = Элементы.ПанельДопИнформации.ПодчиненныеЭлементы.СтраницаПрикрепленныхСообщений;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляНаФорме()
	
	Если НЕ Сообщение = Неопределено Тогда
		
		Документ1С			= Сообщение.Документ1С;
		
		ПолучитьПрикрепленныеСообщения();
		
		НадписьЗаголовок = Элементы.НадписьОткрытьДокумент;
		
		Если ЗначениеЗаполнено(Документ1С) Тогда
			НадписьЗаголовок.Заголовок = СокрЛП(Документ1С);
			НадписьЗаголовок.Гиперссылка = Истина;
			НадписьЗаголовок.ЦветТекста = WebЦвета.СинийСоСтальнымОттенком;
		Иначе
			Если Сообщение.ТипСообщения = "ORDERS" Тогда
				НадписьЗаголовок.Заголовок = "не создан";
			Иначе
				НадписьЗаголовок.Заголовок = "не привязан";
			КонецЕсли;
			НадписьЗаголовок.Гиперссылка = Ложь;
			НадписьЗаголовок.ЦветТекста = Элементы.НадписьЮрФизЛицоСвое.ЦветТекста;
		КонецЕсли;
		
		ДокументНомер		= Сообщение.ДокументEDI.Номер;
		ДокументДата		= Сообщение.ДокументEDI.Дата;
		
		ПродавецEDI			= Сообщение.ПродавецEDI.GLN;
		ПокупательEDI		= Сообщение.ПокупательEDI.GLN;
		ГрузоотправительEDI = Сообщение.ГрузоотправительEDI.GLN;
		ГрузополучательEDI	= Сообщение.ГрузополучательEDI.GLN;
		ВалютаEDI			= Сообщение.ВалютаEDI;
		
		ОтправительEDI	= Сообщение.ОтправительEDI.GLN;
		ПолучательEDI	= Сообщение.ПолучательEDI.GLN;
		
		Продавец1С			= Сообщение.Продавец1С;
		Покупатель1С		= Сообщение.Покупатель1С;
		Грузополучатель1С	= Сообщение.Грузополучатель1С;
		Грузоотправитель1С  = Сообщение.Грузоотправитель1С;
		
		Элементы.НадписьПримечание.Видимость = Ложь;
		
		ТекНомерСерииЗаказов = "";
		Если Сообщение.Свойство("НомерСерииЗаказов",ТекНомерСерииЗаказов) Тогда
			Если ЗначениеЗаполнено(ТекНомерСерииЗаказов) Тогда
				Элементы.НадписьПримечание.Заголовок = "№ серии заказов: " + СокрЛП(ТекНомерСерииЗаказов);
				Элементы.НадписьПримечание.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Сообщение.Свойство("Комментарий") Тогда
			ТипПоставки = МодульОбъекта().ТипПоставкиСообщения(Сообщение);
			Комментарий = ""+Сообщение.Комментарий + ?(ТипПоставки = "",""," Тип поставки: "+ТипПоставки);
		КонецЕсли;
		
		Если Сообщение.Свойство("ПромоНомер") Тогда
			ПромоНомер	= Сообщение.ПромоНомер;
		КонецЕсли;
		
		Если Сообщение.Свойство("Контракт") Тогда
			КонтрактНомер	= Сообщение.Контракт.Номер;
			КонтрактДата	= Сообщение.Контракт.Дата;
			Если Не ЗначениеЗаполнено(КонтрактНомер) и не ЗначениеЗаполнено(КонтрактДата) Тогда
				НастройкаФормы.НевидимыеПоля.Добавить("Контракт");;	
			КонецЕсли;
		КонецЕсли;
		
		// представления юр\физ лиц
		Если КтоМы=Неопределено Тогда 
			КтоМы = МодульОбъекта().ОпределитьКемМыЯвляемся(Сообщение);
		КонецЕсли;

		Если КтоМы = "Поставщик" Тогда
			Элементы.ПредставлениеЮрФизЛицоСвое.Заголовок		= МодульОбъекта().ПолучитьПредставлениеЮрФизЛица(Сообщение.ПродавецEDI, Сообщение.Продавец1С);
			Элементы.ПредставлениеЮрФизЛицоСтороннее.Заголовок = МодульОбъекта().ПолучитьПредставлениеЮрФизЛица(Сообщение.ПокупательEDI, Сообщение.Покупатель1С);
		Иначе
			Элементы.ПредставлениеЮрФизЛицоСвое.Заголовок		= МодульОбъекта().ПолучитьПредставлениеЮрФизЛица(Сообщение.ПокупательEDI, Сообщение.Покупатель1С);
			Элементы.ПредставлениеЮрФизЛицоСтороннее.Заголовок = МодульОбъекта().ПолучитьПредставлениеЮрФизЛица(Сообщение.ПродавецEDI, Сообщение.Продавец1С);
		КонецЕсли;
		
		Элементы.ПредставлениеГрузополучатель.Заголовок	= МодульОбъекта().ПолучитьПредставлениеЮрФизЛица(Сообщение.ГрузополучательEDI,	Сообщение.Грузополучатель1С,	Истина);
		Элементы.ПредставлениеГрузоотправитель.Заголовок	= МодульОбъекта().ПолучитьПредставлениеЮрФизЛица(Сообщение.ГрузоотправительEDI,	Сообщение.Грузоотправитель1С);
	
		Если Элементы.ПредставлениеЮрФизЛицоСвое.Заголовок = "не указан" Тогда
			Элементы.ПредставлениеЮрФизЛицоСвое.Заголовок = "не указана";
			Элементы.ДействиеЮрФизЛицоСвое.Видимость = Ложь;
		Иначе
			Элементы.ДействиеЮрФизЛицоСвое.Видимость = Истина;
		КонецЕсли;
		Если Элементы.ПредставлениеЮрФизЛицоСтороннее.Заголовок = "не указан" Тогда
			Элементы.ДействиеЮрФизЛицоСтороннее.Видимость = Ложь;
		Иначе
			Элементы.ДействиеЮрФизЛицоСтороннее.Видимость = Истина;
		КонецЕсли;
		Если Элементы.ПредставлениеГрузоотправитель.Заголовок = "не указан" Тогда
			Элементы.ДействиеГрузоотправитель.Видимость = Ложь;
		Иначе
			Элементы.ДействиеГрузоотправитель.Видимость = Истина;
		КонецЕсли;
		Если Элементы.ПредставлениеГрузополучатель.Заголовок = "не указан" Тогда
			Элементы.ДействиеГрузополучатель.Видимость = Ложь;
		Иначе
			Элементы.ДействиеГрузополучатель.Видимость = Истина;
		КонецЕсли;
		
		//+для АТАК
		Если Сообщение.Свойство("ДатаПоставкиФактическая") 
			И ЗначениеЗаполнено(Сообщение.ДатаПоставкиФактическая) Тогда
			Элементы.ПредставлениеДатыПоставки.Заголовок		= МодульОбъекта().ПолучитьПредставлениеДатыПоставки_КонтурEDI(Сообщение.ДатаПоставкиФактическая)	
		//-
		Иначе
			Элементы.ПредставлениеДатыПоставки.Заголовок		= МодульОбъекта().ПолучитьПредставлениеДатыПоставки_КонтурEDI(Сообщение.ДатаПоставки);
			Если Сообщение.ТипСообщения = "ORDRSP" Тогда
				Результат = ПроверитьИзменениеДатыПоставки();
				Если Результат.Изменение Тогда
					Элементы.ПредставлениеДатыПоставки.ЦветТекста = WebЦвета.ТемноОранжевый;
				Иначе
					Элементы.ПредставлениеДатыПоставки.ЦветТекста = WebЦвета.ТемноЗеленый;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Элементы.ПредставлениеКонтакты.Заголовок = ПолучитьПредставлениеКонтактногоЛицаПоЗаказу();

		Отправитель1С		= Сообщение.Отправитель1С;
		Получатель1С		= Сообщение.Получатель1С;
		
		Валюта1С			= Сообщение.Валюта1С;
		
		Если Не ЗначениеЗаполнено(Сообщение.Договор) Тогда
			Сообщение.Договор = МодульОбъекта().ПолучитьДоговорКонтрагентаДляСообщения(Сообщение,МодульОбъекта().ОпределитьКемМыЯвляемся(Сообщение));
		КонецЕсли;
		Договор				= Сообщение.Договор;
		
		Статус				= ПеревестиСтатус(Сообщение.Статус);
		
		Если НЕ ЗначениеЗаполнено(Статус) И ЗначениеЗаполнено(Сообщение.СообщениеСсылка) Тогда 
			Статус = ПолучитьЗначениеДопРеквизитаСправочника_КонтурEDIНаСервере(Сообщение.СообщениеСсылка,"СтатусАрхив"); 
		КонецЕсли;	
		
		Заказ1С				= Сообщение.Заказ1С;
		Накладная1С			= Сообщение.Накладная1С;
		Приемка1С			= Сообщение.Приемка1С;
		Если Сообщение.Свойство("СчетФактура1С") Тогда
			СчетФактура1С		= Сообщение.СчетФактура1С;
		КонецЕсли;
		
		Если Сообщение.Свойство("ОбратныйЗаказEDI") Тогда
			ОбратныйЗаказНомер  = Сообщение.ОбратныйЗаказEDI.Номер;
		КонецЕсли;
		
		ЗаказНомер			= Сообщение.ЗаказEDI.Номер;
		ЗаказДата			= Сообщение.ЗаказEDI.Дата;
		НакладнаяНомер		= Сообщение.НакладнаяEDI.Номер;
		НакладнаяДата		= Сообщение.НакладнаяEDI.Дата;
		ПриемкаНомер		= Сообщение.ПриемкаEDI.Номер;
		ПриемкаДата			= Сообщение.ПриемкаEDI.Дата;
		Если Сообщение.Свойство("СчетФактураEDI") Тогда
			СчетФактураНомер	= Сообщение.СчетФактураEDI.Номер;
			СчетФактураДата		= Сообщение.СчетФактураEDI.Дата;
		КонецЕсли;
		
		Если (Сообщение.ТипСообщения = "INVOIC") ИЛИ (Сообщение.ТипСообщения = "COINVOIC") Тогда
			
			Если Сообщение.Исправление = Истина Тогда
				
				Исправление = Сообщение.Исправление;
				НомерИсправления = Сообщение.ДокументEDI.НомерИсправления;
				
				Элементы.ГруппаСтатусИсправление.Видимость=Истина;
				
			КонецЕсли;
			
		КонецЕсли;	
		
		Если Сообщение.Свойство("ТипыМаркируемойПродукции") И ТипЗнч(Сообщение.ТипыМаркируемойПродукции) = Тип("СписокЗначений") Тогда
			ТипыМаркируемойПродукции = Сообщение.ТипыМаркируемойПродукции.Скопировать();
		КонецЕсли;
		
		Если Сообщение.ТипСообщения = "COINVOIC" Тогда
			
			СуммаВсегоУвеличение		= Сообщение.СуммаВсегоУвеличение;
			СуммаВсегоНДСУвеличение		= Сообщение.СуммаВсегоНДСУвеличение;
			СуммаВсегоБезНДСУвеличение	= Сообщение.СуммаВсегоБезНДСУвеличение;
			
			СуммаВсегоУменьшение		= Сообщение.СуммаВсегоУменьшение;
			СуммаВсегоНДСУменьшение		= Сообщение.СуммаВсегоНДСУменьшение;
			СуммаВсегоБезНДСУменьшение	= Сообщение.СуммаВсегоБезНДСУменьшение;
			
			Элементы.ПанельСумм.ТекущаяСтраница = Элементы.ГруппаИтогиТабличнойЧастиПлюсМинус;
			
		Иначе
			
			СуммаВсего			= Сообщение.СуммаВсего;
			СуммаВсегоНДС		= Сообщение.СуммаВсегоНДС;
			СуммаВсегоБезНДС	= Сообщение.СуммаВсегоБезНДС;
			
		КонецЕсли;
		
		КоличествоСтрок		= Сообщение.Товары.Количество();
		
		Если КоличествоСтрок = 0 Тогда
			НадписьТовары = "Товары";
		Иначе
			НадписьТовары = "Товары ("+КоличествоСтрок+")";
		КонецЕсли;
		
		Элементы.СтраницаТовары.Заголовок = НадписьТовары;
		
		Товары.Очистить();
		ТоварныеПозиции.Очистить();
		НомСтр = 1;
				
		ПробоватьСчитатьУпаковки 			= Ложь;
		ПоказыватьКоличествоУпаковок 		= Ложь;
		ПоказыватьКоличествоВОдномМесте 	= Ложь;
		ЕстьКонечныйГрузополучательВТоварах = Ложь;
		ЕстьКоличествоКВозвратуИПричина 	= Ложь;
		ЕстьКоличествоСверхпоставки 		= Ложь;
		ЕстьКоличествоНедопоставки 			= Ложь;
		
		Если Сообщение.ТипСообщения = "ORDERS" Тогда
			Если НЕ Сообщение.Товары.Колонки.Найти("КоличествоВОдномМесте")=Неопределено Тогда
				ПробоватьСчитатьУпаковки = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ОтправлятьДанныеОбУпаковках 		= МодульОбъекта().ОтправлятьДанныеОТранспортныхУпаковках(Сообщение);
		СообщениеСодержитДанныеОбУпаковках 	= МодульОбъекта().СообщениеСодержитТранспортныеУпаковки(Сообщение);
		ОбязательныйКодТовараПокупателя 	= (МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Сообщение.Партнер, "ОбязательныйКодТовараТорговойСети") = Истина);
		ОтправлятьКодыМаркировки			= МодульОбъекта().ОтправлятьКодыМаркировки(Сообщение);
		СообщениеСодержитКодыМаркировки		= МодульОбъекта().СообщениеСодержитКодыМаркировки(Сообщение);
		
		Для каждого Стр Из Сообщение.Товары Цикл
			
			НоваяСтрока = Товары.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
			НоваяСтрока.НомерСтроки = НомСтр;
			НомСтр = НомСтр + 1;
			
			Если НЕ ЗначениеЗаполнено(Стр.Номенклатура) Тогда
				
				Если ТипЗнч(Стр.СписокНоменклатуры) = Тип("СписокЗначений") И Стр.СписокНоменклатуры.Количество() > 0 Тогда
					
					НоваяСтрока.Номенклатура					= "Несколько позиций: " + Строка(Стр.СписокНоменклатуры);
					НоваяСтрока.НаименованиеНоменклатурыПолное	= НоваяСтрока.Номенклатура;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ПробоватьСчитатьУпаковки Тогда
				
				Если НоваяСтрока.КодЕдиницыИзмеренияEDI = "CT" ИЛИ НоваяСтрока.КодЕдиницыИзмеренияEDI = "PA" Тогда
					НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
				Иначе
					Если ЗначениеЗаполнено(НоваяСтрока.КоличествоВОдномМесте) И ЗначениеЗаполнено(НоваяСтрока.Количество) Тогда
						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество/НоваяСтрока.КоличествоВОдномМесте;
					КонецЕсли;						
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НоваяСтрока.КоличествоУпаковок) Тогда
					ПоказыватьКоличествоУпаковок = Истина;
				КонецЕсли;					
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоваяСтрока.КоличествоВОдномМесте) Тогда
				ПоказыватьКоличествоВОдномМесте = Истина;
			КонецЕсли;
			
			Если Сообщение.ТипСообщения = "ORDERS" И Сообщение.Товары.Колонки.Найти("КонечныйГрузополучательGLN")<>Неопределено  и Значениезаполнено(Стр.КонечныйГрузополучательGLN) Тогда
				НоваяСтрока.КонечныйГрузополучательПредставление = Стр.КонечныйГрузополучательGLN;
				ЕстьКонечныйГрузополучательВТоварах=Истина;
			иначе
				НоваяСтрока.КонечныйГрузополучательПредставление = "";
			КонецЕсли;
			
			Если Сообщение.ТипСообщения = "RECADV" Тогда
				Если Сообщение.Товары.Колонки.Найти("КоличествоКВозвратуИПричина1С") <> Неопределено
					И ЗначениеЗаполнено(НоваяСтрока.КоличествоКВозвратуИПричина1С) Тогда
					ЕстьКоличествоКВозвратуИПричина = Истина;
				КонецЕсли;
				
				Если Сообщение.Товары.Колонки.Найти("КоличествоСверхпоставки") <> Неопределено
					И ЗначениеЗаполнено(НоваяСтрока.КоличествоСверхпоставки) Тогда
					ЕстьКоличествоСверхпоставки = Истина;
				КонецЕсли;
				
				Если Сообщение.Товары.Колонки.Найти("КоличествоНедопоставки") <> Неопределено
					И ЗначениеЗаполнено(НоваяСтрока.КоличествоНедопоставки) Тогда
					ЕстьКоличествоНедопоставки = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если Сообщение.ТипСообщения = "COINVOIC" Тогда
				НоваяСтрока.КодыМаркировкиДоПредставление = МодульОбъекта().ПредставлениеКодовМаркировки(Стр.КодыМаркировкиДо);
				НоваяСтрока.КодыМаркировкиПослеПредставление = МодульОбъекта().ПредставлениеКодовМаркировки(Стр.КодыМаркировкиПосле);
			Иначе
				НоваяСтрока.КодыМаркировкиПредставление = МодульОбъекта().ПредставлениеКодовМаркировки(Стр.КодыМаркировки);
			КонецЕсли;
			
		КонецЦикла;
		
		ДозаполнитьАртикулКодПолноеНаименованиеТЧТовары();
		
		Если ОтправлятьДанныеОбУпаковках И Не СообщениеСодержитДанныеОбУпаковках Тогда
			Для каждого СтрокаТоваров Из Товары Цикл
				ДобавитьТоварнуюПозицию(СтрокаТоваров);
			КонецЦикла;
		КонецЕсли;
		
		НастройкаФормы.НевидимыеКолонки.Добавить("КоличествоКВозвратуИПричинаEDI");
		Если НЕ ЕстьКоличествоКВозвратуИПричина Тогда
			НастройкаФормы.НевидимыеКолонки.Добавить("КоличествоКВозвратуИПричина1С");
		КонецЕсли;
		Если НЕ ЕстьКоличествоСверхпоставки Тогда
			НастройкаФормы.НевидимыеКолонки.Добавить("КоличествоСверхпоставки");
		КонецЕсли;
		Если НЕ ЕстьКоличествоНедопоставки Тогда
			НастройкаФормы.НевидимыеКолонки.Добавить("КоличествоНедопоставки");
		КонецЕсли;
		
		Если НЕ ЕстьКонечныйГрузополучательВТоварах Тогда
			НастройкаФормы.НевидимыеКолонки.Добавить("КонечныйГрузополучательПредставление");
		КонецЕсли;
		Если НЕ ПоказыватьКоличествоВОдномМесте Тогда
			НастройкаФормы.НевидимыеКолонки.Добавить("КоличествоВОдномМесте");
		КонецЕсли;
		Если НЕ ПоказыватьКоличествоУпаковок Тогда
			НастройкаФормы.НевидимыеКолонки.Добавить("КоличествоУпаковок");
		КонецЕсли;
		
		Если НЕ ОтправлятьКодыМаркировки И НЕ СообщениеСодержитКодыМаркировки Тогда
			НастройкаФормы.НевидимыеКолонки.Добавить("КодыМаркировкиПредставление");
		КонецЕсли;
		
		КоличествоВсего	= Товары.Итог("Количество");
		
		Если СуммаВсего = 0 Тогда
			СуммаВсего = Товары.Итог("СуммаСНДС");
		КонецЕсли;
		Если СуммаВсегоБезНДС = 0 Тогда
			СуммаВсегоБезНДС = Товары.Итог("СуммаБезНДС");
		КонецЕсли;
		Если СуммаВсегоНДС = 0 Тогда
			СуммаВсегоНДС = Товары.Итог("СуммаНДС");
		КонецЕсли;	
		
		Если Сообщение.ТипСообщения = "ORDERS" 
			И Сообщение.Направление = "Входящее" Тогда
			
			//вызов ПМ по товарной группе товаров
			ЗаполнитьТоварнуюГруппуТаблицыТоваровВызовСервера();
		Иначе
			НастройкаФормы.НевидимыеКолонки.Добавить("ТоварнаяГруппа");
			//еще можно скрывать, если товарные группы не используются или если все товары вошли в одну группу.
		КонецЕсли;
		
		//если партнер может отправлять данные об упаковках и есть элемент справочника "Сообщения" (т.е. сообщение открыто на просмотр) и транспортные упаковки присутствуют в сообщении
		//тогда заполняем данные о распределении товаров в упаковках
		//иначе очищаем данные об упаковках
		Если СообщениеСодержитДанныеОбУпаковках Тогда
			
			ДеревоТранспортныхУпаковок = РеквизитФормыВЗначение("ТранспортныеУпаковки");
			
			ДеревоТранспортныхУпаковок.Строки.Очистить();
			МодульОбъекта().ЗаполнитьСвойстваСтрокДереваЗначенийРекурсивно(ДеревоТранспортныхУпаковок, Сообщение.ТранспортныеУпаковки);
			
			ЗначениеВРеквизитФормы(ДеревоТранспортныхУпаковок, "ТранспортныеУпаковки");
			
		Иначе
			
			ТранспортныеУпаковки.ПолучитьЭлементы().Очистить();
			
		КонецЕсли;
		
		//Врата времени Х5
		Если ((Сообщение.ТипСообщения = "ORDERS" И Сообщение.Направление = "Входящее") ИЛИ (Сообщение.ТипСообщения = "ORDRSP" И Сообщение.Направление = "Исходящее"))
			и Сообщение.Свойство("Транспортировка") и Сообщение.Транспортировка<>Неопределено Тогда 
			
			ОригинальныйСписок = Сообщение.Транспортировка.ДатаВремяПрибытия.Скопировать();
			МассивУдаляемыхСтрок = Новый Массив;
			
			Для Каждого Стр ИЗ ОригинальныйСписок Цикл
				Если Стр.Значение = "" Тогда
					МассивУдаляемыхСтрок.Добавить(Стр);
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
				ОригинальныйСписок.Удалить(УдаляемаяСтрока);	
			КонецЦикла;
			
			Транспортировка = ОригинальныйСписок;
			для каждого Элемент из Транспортировка цикл
				Элемент.Представление = МодульОбъекта().ДатаXML_в_ДатаВремя1С(Элемент.Значение);
			конеццикла;
		КонецЕсли;
			
		ЗаполнитьСтруктураОтбораДокумента();
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктураОтбораДокумента()
	
	Если Сообщение.ТипСообщения = "RETDES"
		ИЛИ (Сообщение.ТипСообщения = "DESADV" И Сообщение.Направление = "Входящее")
		ИЛИ (Сообщение.ТипСообщения = "INVOIC" и Сообщение.Направление = "Входящее") Тогда
		
		ОрганизацияВСообщении = Сообщение.Покупатель1С;
		КонтрагентВСообщении = Сообщение.Продавец1С;
		
	Иначе
		
		ОрганизацияВСообщении = Сообщение.Продавец1С;
		КонтрагентВСообщении = Сообщение.Покупатель1С;
		
	КонецЕсли;
	
	СтруктураОтбораДокумента = Новый Структура("Организация,Контрагент", ОрганизацияВСообщении, КонтрагентВСообщении);

КонецПроцедуры

&НаСервере
Функция ПеревестиСтатус(Статус) 
	
	СтатусВерхнийРегистр = ВРег(Статус);
	
	Если СтатусВерхнийРегистр = "CANCELED" Тогда
	    Статус = "Отмена";
	ИначеЕсли СтатусВерхнийРегистр = "REPLACE" Тогда
		Статус = "Замена";
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

&НаСервере
Функция ПроверитьИзменениеДатыПоставки()
	
	РезультатПроверки = Новый Структура("Изменение", Ложь);
	
	Партнер = МодульОбъекта().ОпределитьПартнера(Новый Структура("ТипЗначения, ЮрФизЛицо, Сообщение","ЮрФизЛицо", Сообщение.Покупатель1С, Сообщение));
	_СтатусChangedДляИзмененнойДатыПоставкиORDRSP = МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Партнер, "СтатусChangedДляИзмененнойДатыПоставкиORDRSP");
	
	Если Не _СтатусChangedДляИзмененнойДатыПоставкиORDRSP = Истина Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	ВходящийЗаказ = МодульОбъекта().ПрочитатьСообщение(,Сообщение.Заказ1С,"ORDERS","Входящее");
	
	Если Не ЗначениеЗаполнено(ВходящийЗаказ) Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВходящийЗаказ.ДатаПоставки) И Не Сообщение.ДатаПоставки = ВходящийЗаказ.ДатаПоставки Тогда
		РезультатПроверки.Вставить("Изменение", Истина);
		РезультатПроверки.Вставить("Значение",  ВходящийЗаказ.ДатаПоставки);
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

//добавление / изменение / удаление данных
&НаСервере
Процедура ДобавитьТоварнуюПозицию(Строка)
	
    НоваяСтрока = ТоварныеПозиции.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	Если Не ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
		НоваяСтрока.Номенклатура = Строка.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкиДопРеквизитов(НастройкаКнопок)
	
	Если ЗначениеЗаполнено(НастройкаКнопок) Тогда
		КнопкиЕщеДопРеквизиты = Элементы.ЕщеДополнительныеРеквизиты;			
		
		Для каждого Кнопка Из НастройкаКнопок Цикл
			
			Если ЭтаФорма.Команды.Найти(Кнопка.ИмяКнопки) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяКоманда = ЭтаФорма.Команды.Добавить(Кнопка.ИмяКнопки);
			НоваяКоманда.Действие = "ЕщеДополнительныеРеквизиты_Нажатие";
			НоваяКоманда.Заголовок = Кнопка.Представление;
			
			НовыйЭлемент = Элементы.Добавить(Кнопка.ИмяКнопки, Тип("КнопкаФормы"),КнопкиЕщеДопРеквизиты);
			НовыйЭлемент.ИмяКоманды = Кнопка.ИмяКнопки;
			
		КонецЦикла; 	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопки(НастройкаКнопок)
	
	СоздатьКнопкиОсновныхДействий(НастройкаКнопок);
	УстановитьВидимостьДополнительныхДействийФормы();	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкиОсновныхДействий(НастройкаКнопок)
	
	КнопкиКоманднойПанели = КоманднаяПанель.ПодчиненныеЭлементы;
	Для каждого Кнопка Из КнопкиКоманднойПанели Цикл
		Если Найти(Кнопка.Имя, "ОсновноеДействиеФормы") > 0 Тогда
			Кнопка.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если ТолькоПросмотрСообщения Тогда
		Возврат;
	КонецЕсли;
	
	ОтборКнопок = Новый Структура;
	ОтборКнопок.Вставить("ВидКнопки", "Кнопка");
	
	ДобавляемыеКнопки = НастройкаКнопок.НайтиСтроки(ОтборКнопок);
	
	СчетчикКнопок = 0;
	
	Для Каждого ОписаниеКнопки Из ДобавляемыеКнопки Цикл
		
		Если ПропуститьДобавлениеКнопки(ОписаниеКнопки) Тогда
			Продолжить;
		КонецЕсли;
		
		СчетчикКнопок = СчетчикКнопок + 1;
		
		НоваяКнопка = Элементы["ОсновноеДействиеФормы" + СчетчикКнопок];
		
		НоваяКнопка.Заголовок 		  = ПредставлениеКнопки(ОписаниеКнопки);
		НоваяКнопка.ИмяКоманды 		  = ОписаниеКнопки.Имя; 
		НоваяКнопка.Видимость 		  = ОписаниеКнопки.Видимость;
		НоваяКнопка.Доступность 	  = Истина;
		НоваяКнопка.КнопкаПоУмолчанию = ОписаниеКнопки.КнопкаПоУмолчанию;
		
		Если Объект.ПараметрыКлиентСервер.ТекущийВариантИнтерфейса = "Версия8_5"
				И ОписаниеКнопки.КнопкаПоУмолчанию = Истина Тогда
				
			НоваяКнопка.Важность = Вычислить("ВажностьКнопки.Главная");
			
		КонецЕсли;
			
		Если ОписаниеКнопки.Имя = "СоздатьЗаказ" 
			И ЗначениеЗаполнено(Сообщение.СообщениеСсылка) 
			И Сообщение.СообщениеСсылка.ОтклоненоОтправителем Тогда
			
			НоваяКнопка.Доступность = Ложь;
			НоваяКнопка.Заголовок = "Заказ отклонен отправителем";
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеКнопки(ОписаниеКнопки)

	ПредставлениеКнопки = ОписаниеКнопки.Представление;
	
	Если (ОписаниеКнопки.Имя = "ЗагрузитьВозврат" 
			Или ОписаниеКнопки.Имя = "ЗагрузитьУведомлениеОбОтгрузкеВозврата") 
			И МодульОбъекта().НужноСоздатьКорректировкуИзВозврата(Сообщение)
			И ЗначениеЗаполнено(Сообщение.Накладная1С) Тогда 
		
		ДокПоУмолчанию = МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Сообщение.Партнер, "ДокументПоУмолчанию" + Сообщение.ТипСообщения);  
		Если ДокПоУмолчанию = "Создавать документ Возврат товаров от клиента" Тогда 
			ПредставлениеКнопки = "Создать документ ""Возврат товаров от клиента""";
		Иначе 
			ПредставлениеКнопки = "Создать документ ""Корректировка реализации""";	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОписаниеКнопки.Имя = "СоздатьЗаказ"
		И Сообщение.ТипСообщения = "ORDERS"
		И Сообщение.Свойство("ОбратныйЗаказ1С") 
		И ЗначениеЗаполнено(Сообщение.ОбратныйЗаказ1С) Тогда
		
		ПредставлениеКнопки = "Загрузить входящий заказ";
		
	КонецЕсли;
	
	Возврат ПредставлениеКнопки;	
	
КонецФункции

&НаСервере
Функция ПропуститьДобавлениеКнопки(ОписаниеКнопки)
	
	ПропуститьДобавление = Ложь;
	
	Если ОписаниеКнопки.Имя = "ПропуститьИсходящееСообщение"
		И ОписаниеКнопки.КнопкаПоУмолчанию
		И НЕ МодульОбъекта().НужноПропуститьИсходящееСообщение(Сообщение) Тогда
		
		ПропуститьДобавление = Истина;
		
	КонецЕсли;
	
	Если ОписаниеКнопки.КнопкаПоУмолчанию
		И МодульОбъекта().НужноПропуститьИсходящееСообщение(Сообщение)
		И НЕ ОписаниеКнопки.Имя = "ПропуститьИсходящееСообщение" Тогда
		
		ПропуститьДобавление = Истина;
		
	КонецЕсли;
	
	// кнопка КонтурЛогистика_ОткрытьПеревозочные выведена явным образом
	Если ОписаниеКнопки.Имя = "КонтурЛогистика_ОткрытьПеревозочные" Тогда
		ПропуститьДобавление = Истина;
	КонецЕсли;
	
	Возврат ПропуститьДобавление;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьДополнительныхДействийФормы()
	
	КнпокиДополнительныхДействий = Элементы.ДополнительныеДействияФормы.ПодчиненныеЭлементы;  
	
	Для каждого Кнопка Из КнпокиДополнительныхДействий Цикл
		Кнопка.Видимость = Ложь;
	КонецЦикла;
	
	Если Сообщение.Направление = "Входящее" Тогда
		УстановитьВидимостьКнопокДействийВходящегоСообщения();
	Иначе
		УстановитьВидимостьКнопокДействийИсходящегоСообщения();
	КонецЕсли;
	
	УстановитьВидимостьОбщихКнопокДействий();

КонецПроцедуры 

&НаСервере
Процедура УстановитьВидимостьКнопокДействийВходящегоСообщения()

	ЭтоСообщениеСоздаетДокумент 		= МодульОбъекта().СтрСодержит_КонтурEDI("ORDERS,DESADV,RETANN,RETDES", Сообщение.ТипСообщения);			
	ЭтоСообщениеПривязываетсяКДокументу = МодульОбъекта().СтрСодержит_КонтурEDI("ORDERS,DESADV,RETANN,RETDES,INVOIC", Сообщение.ТипСообщения);
	ДокументПривязан					= ЗначениеЗаполнено(Сообщение.Документ1С);
	
	Если ДокументПривязан Тогда
		Элементы.ОтвязатьДокумент.Видимость = Истина;
	КонецЕсли;
	
	Если ЭтоСообщениеСоздаетДокумент И ДокументПривязан Тогда
		Элементы.ПерезаполнитьДокумент.Видимость = Истина;
	КонецЕсли;
	
	Если ЭтоСообщениеПривязываетсяКДокументу И Не ДокументПривязан Тогда
		Элементы.ПривязатьСообщение.Видимость = Истина;
	КонецЕсли;
	
	Если Сообщение.ТипСообщения = "ORDERS" 
		И Сообщение.СтатусСсылки <> "Отклонен"
		И МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Сообщение.Партнер, "ORDRSP_Исходящее") = Истина Тогда

		Элементы.ОтклонитьЗаказПолностью.Видимость = Истина;			
		
	КонецЕсли;
	
	Если Сообщение.ТипСообщения = "RETANN" 
		И Сообщение.СтатусСсылки <> "Отклонен" 
		И МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Сообщение.Партнер, "RETINS_Исходящее") = Истина Тогда
		
		Элементы.ОтклонитьВозвратПолностью.Видимость = Истина;
		
	КонецЕсли;
	
	Если Сообщение.ТипСообщения = "RETDES" 
		И Сообщение.СтатусСсылки <> "Отклонен" 
		И МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Сообщение.Партнер,"RETREC_Исходящее") = Истина Тогда
		
		Элементы.ОтклонитьВозвратПолностью.Видимость = Истина;
		
	КонецЕсли;

	Если МодульОбъекта().МожноПрекратитьОбработкуВходящегоСообщения(Сообщение) Тогда
		Элементы.ПрекратитьОбработкуВходящегоСообщения.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопокДействийИсходящегоСообщения()
	
	СообщениеСохранено 				= ЗначениеЗаполнено(Сообщение.СообщениеСсылка);
	ЭтоПереотправляемоеСообщение 	= МодульОбъекта().СтрСодержит_КонтурEDI("ORDRSP,DESADV,INVOIC,COINVOIC", Сообщение.ТипСообщения);
	
	Если Сообщение.ТипСообщения = "ORDRSP" 
		И Сообщение.Статус <> "Отклонен"
		И МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаEDI(Сообщение.Партнер, "ORDRSP_Исходящее") = Истина Тогда
		
		Элементы.ОтклонитьЗаказПолностью.Видимость = Истина;	
		
	КонецЕсли;
	
	Если Сообщение.ТипСообщения = "DESADV" И Сообщение.Статус <> "Отменен" Тогда
		Элементы.ОтменитьОтгрузку.Видимость = Истина;			
	КонецЕсли;
	
	Если (Сообщение.ТипСообщения = "RETINS" ИЛИ Сообщение.ТипСообщения = "RETREC") И Сообщение.Статус <> "Отклонен" Тогда
		Элементы.ОтклонитьВозвратПолностью.Видимость = Истина;
	КонецЕсли;
	
	Если МодульОбъекта().МожноПрекратитьОбработкуИсходящегоСообщения(Сообщение) Тогда
		Элементы.ПрекратитьОбработкуИсходящегоСообщения.Видимость = Истина;
	КонецЕсли;
	
	Если Не СообщениеСохранено И ПоказыватьКнопкуПрекратитьОбработкуНулевойСФ() Тогда
		Элементы.ПрекратитьОбработкуНулевойСФ.Видимость = Истина;
	КонецЕсли;
	
	Если СообщениеСохранено И ЭтоПереотправляемоеСообщение Тогда
		Элементы.ПереотправитьСообщение.Видимость = Истина;
	КонецЕсли;
	
	Если СообщениеСохранено И ПоказыватьКнопкуПереотправкиALCRPT() Тогда
		Элементы.ПереотправитьALCRPT.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ФормаВыгрузитьДанныеДляДиагностики.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОбщихКнопокДействий()

	Элементы.ОткрытьФайл.Видимость 				= Истина;	
	Элементы.НайтиСвязанныеСообщения.Видимость 	= Истина;
	
	Если МодульОбъекта().КэшПечатныхФормСообщений().Свойство("ПечатнаяФорма_" + Сообщение.ТипСообщения) Тогда
		Элементы.НапечататьСообщение.Видимость = Истина;
	КонецЕсли;
    
	Если ЗначениеЗаполнено(Сообщение.СообщениеСсылка) Тогда
	
		Элементы.УдалитьСообщение.Видимость = Истина;

		ТребуемоеДействиеСообщения = МодульОбъекта().ПолучитьЗначениеРеквизитаОбъекта_КонтурEDI(Сообщение.СообщениеСсылка, "ТребуемоеДействие");
		Если ТребуемоеДействиеСообщения <> "ВыполнитьОбмен"
			И ТребуемоеДействиеСообщения <> "ОбработатьСохраненноеСообщение" Тогда
			
			Если МодульОбъекта().ПротоколОбмена_КонтурEDI = "API" Тогда
				Элементы.ОткрытьСообщениеВМониторинге.Видимость = Истина;
			КонецЕсли;

			Если МодульОбъекта().ЭтоТипПодписываемогоДДСообщения(Сообщение.ТипСообщения) Тогда
				Элементы.ОткрытьЭлДокументыВДиадоке.Видимость = Истина;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоказыватьКнопкуПрекратитьОбработкуНулевойСФ()
	
	Если Сообщение.ТипСообщения = "INVOIC" И Сообщение.СуммаВсего = 0 И МодульОбъекта().ЕстьКоррИспрСФ Тогда
		
		ДокОснование = МодульОбъекта().ПолучитьЗначениеСвойстваОбъектаМетаданныхПоИмени("ДокументОснование", Сообщение.Документ1С);
		ТипИсходящийКСФ = МодульОбъекта().ПолучитьТипЗначенияОбъекта("ИсходящийКСФ");
		
		Если ЗначениеЗаполнено(ТипИсходящийКСФ) И ТипЗнч(ДокОснование) = Тип(ТипИсходящийКСФ) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;

	Возврат Ложь;	
	
КонецФункции

&НаСервере
Функция ПоказыватьКнопкуПереотправкиALCRPT()
	
	Если Не МодульОбъекта().СтрСодержит_КонтурEDI("DESADV,INVOIC", Сообщение.ТипСообщения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сообщение.Получатель1С) Тогда
		Возврат Ложь;
	КонецЕсли;

	Партнер = МодульОбъекта().ПолучитьЭлементСправочника("Партнеры", Сообщение.Получатель1С);
    ПоказыватьКнопкуПереотправкиALCRPT = Ложь;
	
	Если Сообщение.ТипСообщения = "DESADV" 
		И Партнер.Свойство("ОтправлятьALCRPT") 
		И Партнер.ОтправлятьALCRPT = Истина Тогда
		
		ПоказыватьКнопкуПереотправкиALCRPT = Истина;
		
	КонецЕсли;
	
	Если Сообщение.ТипСообщения = "INVOIC" 
		И Партнер.Свойство("ОтправлятьALCRPTсINVOIC") 
		И Партнер.ОтправлятьALCRPTсINVOIC = Истина Тогда
		
		ПоказыватьКнопкуПереотправкиALCRPT = Истина;
		
	КонецЕсли;
	
	Возврат ПоказыватьКнопкуПереотправкиALCRPT;
	
КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеОбязательныхПолей()
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	Для Каждого Стр Из НастройкаФормы.ОбязательныеПоля Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.ИмяТабличнойЧасти) Тогда
			
			Если ЗначениеЗаполнено(ЭтаФорма[Стр.ИмяПоля]) Тогда
				
			//	ПометкаПоля = ЭлементыФормы["Пометка"+Стр.ИмяПоля];
			//
			//	ПометкаПоля.Картинка = ЭлементыФормы.КартинкаГалочкаМаленькая.Картинка;
			//	ПометкаПоля.Видимость = Истина;
			
			//подкрасим в зеленый лосось :Р
				Поле = Элементы[Стр.ИмяПоля];
			
				//Поле.Картинка = ЭлементыФормы.КартинкаГалочкаМаленькая.Картинка; //(маленькая зеленая галочка)
				//Не уверен что будем добавять пометки галочки как в ОФ т.к. они слопают очень много места, особенно в такси! пока просто не будем ничего устанавливать
			КонецЕсли;
			
			Элементы[Стр.ИмяПоля].АвтоОтметкаНезаполненного = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПанельИнформации(Текст,Вид = Неопределено)
	
	// Возможные виды:
	//	- Хорошо
	//	- Плохо
	//	- Нейтрально
	
	Если Вид = "Хорошо" Тогда
		
		//Элементы.ПанельИнформации.ЦветФона		= WebЦвета.Роса;
		Элементы.ПанельИнформации.ЦветТекста		= WebЦвета.ЦианТемный;
		//Элементы.ПанельИнформации.ЦветРамки	= WebЦвета.ЗеленыйЛес;
		
		//ЭлементыФормы.ИконкаПанелиИнформации.Картинка = ПолучитьКартинкуEDI("ЭлементФормы","КартинкаГалочка");
		
	ИначеЕсли Вид = "Плохо" Тогда
		
		//Элементы.ПанельИнформации.ЦветФона		= WebЦвета.ТусклоРозовый;
		Элементы.ПанельИнформации.ЦветТекста		= WebЦвета.Киноварь;
		//Элементы.ПанельИнформации.ЦветРамки	= WebЦвета.Шоколадный;
		
		//ЭлементыФормы.ИконкаПанелиИнформации.Картинка = ПолучитьКартинкуEDI("ЭлементФормы","КартинкаИсправитьОшибки");
		
	Иначе	
		
		//Элементы.ПанельИнформации.ЦветФона		= WebЦвета.СлоноваяКость;
		Элементы.ПанельИнформации.ЦветТекста		= WebЦвета.ТемноОранжевый;
		//Элементы.ПанельИнформации.ЦветРамки	= WebЦвета.РыжеватоКоричневый;
		
		//Элементы.ИконкаПанелиИнформации.Картинка = ПолучитьКартинкуEDI("ЭлементФормы","КартинкаИнформация");
		
	КонецЕсли;
		
	Элементы.ПанельИнформации.Заголовок = СокрЛП(Текст);
				 
КонецПроцедуры

&НаСервере
Функция ПодготовитьСтруктуруИзмененныхРеквизитов()
	
	ИзмененныеРеквизиты = Новый Структура;
	
	Для Каждого ИзмененныйРеквизит Из ТаблицаИзмененныхРеквизитов Цикл
		ИзмененныеРеквизиты.Вставить(ИзмененныйРеквизит.Наименование, ИзмененныйРеквизит.Значение); 
	КонецЦикла;
	
	Возврат ИзмененныеРеквизиты;
	
КонецФункции

//пробегает по таблице значений Дубли и смотрит, были ли созданы по этим сообщениям документы
//если такой документ был создан, и в единственном экземпляре, то функция перепривяжет его к последнему сообщению
//а все остальные пометит как уже загруженные. В списке документов все равно будет светиться только одно из них
&НаСервере
Функция ПерепривязатьСообщенияИнтерактивно()
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	ПеренестиПоля1СвСообщение(Сообщение);
	МодульОбъекта().СохранитьСообщение(Сообщение);
	
	МодульОбъекта().МагическиОбработатьДублиORDERS(Сообщение,"НоваяВерсия",,Ложь);
	КопияСообщения = МодульОбъекта().ПрочитатьСообщение(Сообщение.СообщениеСсылка,,Сообщение.ТипСообщения,"Входящее");
	
	Если ЗначениеЗаполнено(КопияСообщения) Тогда
		
		КопияТоваров = Товары.Выгрузить();
		Сообщение = КопияСообщения;
		Сообщение.Документ1С = Сообщение.ДокументСсылка;
		ЗаполнитьПоляНаФорме();
		
		Товары.Загрузить(КопияТоваров);
		
		ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
		УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция УдалитьВиртуальныеORDERS(ВиртуальныеORDERS)
	
	Если ВиртуальныеORDERS.Количество() <= 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Для Каждого Стр Из ВиртуальныеORDERS Цикл
			
			Стр.Документ.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
			
			Если Стр.ЭтоТекущийДокумент Тогда
				СообщениеОбъект_ORDERS = МодульОбъекта().ПолучитьОбъектСообщения(Стр.ORDERS);
				СообщениеОбъект_ORDERS.Документ = Неопределено;
				МодульОбъекта().СохранитьОбъектСообщения(СообщениеОбъект_ORDERS);
			Иначе
				МодульОбъекта().УдалитьСообщение(Стр.ORDERS,,"#v");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Стр.ORDRSP) Тогда
				МодульОбъекта().УдалитьСообщение(Стр.ORDRSP,,"#v");
			КонецЕсли;
			
		КонецЦикла;	
		Документ1С = Неопределено;
		Сообщение.Документ1С = Неопределено;
		Сообщение.ДокументСсылка = Неопределено;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ТекстОшибки = "Не удалось перезаполнить документ 1С - " + ОписаниеОшибки();
		МодульОбъекта().ЗаписьЖурналаРегистрации_КонтурEDI(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		МодульОбъекта().Сообщить_КонтурEDI(ТекстОшибки);
		ВызватьИсключение ТекстОшибки;				
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПерезаполнитьДокумент1С(ПараметрыПерезаполнения = Неопределено)
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	ПеренестиПоля1СвСообщение(Сообщение);
	
	Если НЕ ЗначениеЗаполнено(Сообщение.ДокументСсылка) Тогда
		Сообщение.ДокументСсылка = Сообщение.Документ1С;
	КонецЕсли;
	
	Результат = ПерезаполнитьДокумент1С_ПереопределяемаяЧасть(ПараметрыПерезаполнения); 
	
	Если Результат.Успешно Тогда
		СообщениеОбъект = МодульОбъекта().ПолучитьОбъектСообщения(Сообщение.СообщениеСсылка);
		МодульОбъекта().СохранитьОбъектСообщения(СообщениеОбъект, Сообщение);
	КонецЕсли;
	
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();

	Если Результат.Успешно Тогда
		
		Если Сообщение.ТипСообщения = "ORDERS" Тогда
			МодульОбъекта().УстановитьСтатусСообщения(Сообщение.СообщениеСсылка,
													  Сообщение.ДокументСсылка,
													  Сообщение.ТипСообщения,
													  "ВходящийЗагружен");
		КонецЕсли;
		
	Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось перезаполнить документ!";
		СообщениеПользователю.Сообщить();
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Результат.Успешно;   
	
КонецФункции

&НаСервере
Функция ПерезаполнитьДокумент1С_ПереопределяемаяЧасть(ПараметрыПерезаполнения = Неопределено)
	
	Результат = Новый Структура("Успешно,ТекстОшибки", Истина, "");
	
	// ... вызов события пм
	СтандартнаяОбработкаEDI = Истина;
	
	ПараметрыПМ = 
	Новый Структура("Документ1С, Сообщение, Результат", Документ1С, Сообщение, Результат);
	
	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ПерезаполнитьДокумент1С", СтандартнаяОбработкаEDI, ПараметрыПМ);
	
	Если Не СтандартнаяОбработкаEDI = Истина Тогда
		
		Возврат Результат;
		
	КонецЕсли; 
	
	// ... стандартная обработка  	
	ПервоначальнаяЗагрузкаСообщения = Ложь;
	
	Если ЗначениеЗаполнено(Документ1С) Тогда
		
		Если ПараметрыПерезаполнения = Неопределено Тогда
			ВиртуальныеORDERS = МодульОбъекта().ПолучитьВиртуальныеСвязанныеORDERS(Документ1С);
		Иначе
			ВиртуальныеORDERS = ПараметрыПерезаполнения.ВиртуальныеORDERS;
		КонецЕсли;
		
		ПервоначальнаяЗагрузкаСообщения = УдалитьВиртуальныеORDERS(ВиртуальныеORDERS);
			
	Иначе
		ПервоначальнаяЗагрузкаСообщения = Истина;
	КонецЕсли;			
	
	РезультатПриемкиСообщения = МодульОбъекта().ПринятьВходящееСообщение(Сообщение,ПервоначальнаяЗагрузкаСообщения);
	
	Результат.Успешно = РезультатПриемкиСообщения.Успешно;
	
	Возврат Результат;

КонецФункции	

&НаСервере
Процедура УничтожитьТаблицыЗначенийПроизвольныхРеквизитов() Экспорт
	
	НастройкаСсылокИсправленияОшибок     = Неопределено;  

	Для Каждого ЭлементСтруктуры Из НастройкаФормы Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
			НастройкаФормы[ЭлементСтруктуры.Ключ] = Неопределено;	
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементСтруктуры Из Сообщение Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Или ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ДеревоЗначений") Тогда
			Сообщение[ЭлементСтруктуры.Ключ] = Неопределено;	
		КонецЕсли;
	КонецЦикла;

	Если Сообщение.Свойство("Транспортировка") Тогда
		Сообщение.Транспортировка.ДатаВремяПрибытия = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище() Экспорт
	
	СтруктураВременногоХранилища = Новый Структура;

	Если ТипЗнч(НастройкаСсылокИсправленияОшибок) = Тип("ТаблицаЗначений") Тогда
		СтруктураВременногоХранилища.Вставить("НастройкаСсылокИсправленияОшибок", НастройкаСсылокИсправленияОшибок);
	КонецЕсли;

	СтруктураНастройкаФормы = Новый Структура;
	Для Каждого ЭлементСтруктуры Из НастройкаФормы Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
			СтруктураНастройкаФормы.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);	
		КонецЕсли;
	КонецЦикла;
	Если СтруктураНастройкаФормы.Количество() > 0 Тогда 
		СтруктураВременногоХранилища.Вставить("НастройкаФормы", СтруктураНастройкаФормы);
	КонецЕсли;
	
	СтруктураСообщение = Новый Структура;
	Для Каждого ЭлементСтруктуры Из Сообщение Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Или ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ДеревоЗначений") Тогда
			СтруктураСообщение.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);	
		КонецЕсли;
	КонецЦикла;
	Если СтруктураСообщение.Количество() > 0 Тогда 
		СтруктураВременногоХранилища.Вставить("Сообщение", СтруктураСообщение);	
	КонецЕсли;
		
	Если СтруктураВременногоХранилища.Количество() > 0 Тогда 
		АдресВХПроизвольныеРеквизиты = ПоместитьВоВременноеХранилище(СтруктураВременногоХранилища, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища() Экспорт
	
	//извлечем из ВХ если не инициализированы реквизиты и при этом там хоть что-то есть
	
	ВосстановитьТаблицы = НебходимоВосстановитьТаблицы();  
	
	Если ВосстановитьТаблицы Тогда 
		
		СтруктураВременногоХранилища = ПолучитьИзВременногоХранилища(АдресВХПроизвольныеРеквизиты);
		Если СтруктураВременногоХранилища = Неопределено Тогда 
			ВызватьИсключение "Сервер потерял временное хранилище (откройте форму заново)";
		КонецЕсли;
		
		НастройкаСсылокИсправленияОшибок		= СтруктураВременногоХранилища.НастройкаСсылокИсправленияОшибок;

		Если Сообщение.Свойство("ТранспортныеУпаковки") Тогда
			Сообщение.ТранспортныеУпаковки = РеквизитФормыВЗначение("ТранспортныеУпаковки");
		КонецЕсли;
				
		Если СтруктураВременногоХранилища.Свойство("НастройкаФормы") И ТипЗнч(СтруктураВременногоХранилища.НастройкаФормы) = Тип("Структура") Тогда
			Для Каждого ЭлементСтруктуры Из СтруктураВременногоХранилища.НастройкаФормы Цикл
				НастройкаФормы[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;							
			КонецЦикла;				
		КонецЕсли;
		
		Если СтруктураВременногоХранилища.Свойство("Сообщение") И ТипЗнч(СтруктураВременногоХранилища.Сообщение) = Тип("Структура") Тогда
			Для Каждого ЭлементСтруктуры Из СтруктураВременногоХранилища.Сообщение Цикл
				Если ЭлементСтруктуры.Ключ = "ТранспортныеУпаковки" И Не (ТипСообщения = "ORDERS" ИЛИ ТипСообщения = "ORDRSP") Тогда
					Продолжить;
				КонецЕсли;
				Сообщение[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;							
			КонецЦикла;
		КонецЕсли;

		ПриВосстановленииТоваровСообщения(); 
		
		Если Сообщение.Свойство("Транспортировка") Тогда
			Сообщение.Транспортировка.ДатаВремяПрибытия = Транспортировка;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НебходимоВосстановитьТаблицы()
	
	ВосстановитьТаблицы = НЕ ПустаяСтрока(АдресВХПроизвольныеРеквизиты)
	И (НастройкаСсылокИсправленияОшибок 	 = Неопределено
	ИЛИ НастройкаФормы.ОбязательныеПоля 	 = Неопределено
	ИЛИ НастройкаФормы.КнопкиКоманднойПанели = Неопределено
	ИЛИ НастройкаФормы.КнопкиДопРеквизитов 	 = Неопределено)
	ИЛИ Сообщение.Товары					 = Неопределено
	ИЛИ (Сообщение.Свойство("Фасовка") И Сообщение.Фасовка = Неопределено)  
	ИЛИ (Сообщение.Свойство("ТранспортныеУпаковки") И Сообщение.ТранспортныеУпаковки = Неопределено)  
	ИЛИ (Сообщение.Свойство("ТочкиСамовывоза") И Сообщение.ТочкиСамовывоза = Неопределено)
	ИЛИ (Сообщение.Свойство("Прослеживаемость") И Сообщение.Прослеживаемость = Неопределено);
	
	Возврат ВосстановитьТаблицы;

КонецФункции

&НаСервере
Процедура ПриВосстановленииТоваровСообщения()
		
	Если Сообщение.ТипСообщения = "ORDRSP" Тогда	
		
		ИндексСтроки = 0;
		
		Для каждого Стр Из Товары Цикл 
			
			СтрокаСообщения = Сообщение.Товары.Получить(ИндексСтроки);
			
			СтрокаСообщения.Комментарий = Стр.Комментарий; 
			
			ИндексСтроки = ИндексСтроки + 1;	
			
		КонецЦикла;	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КнопкаВыборВерсииНажатие(ИмяКоманды)
	
	СписокКнопок = ПолучитьСписокИменКнопокДублей();	
	МодульОбъектаКлиент().ВыбратьИзМеню_КонтурEDI("ОбработчикВыбораВерсии", ЭтаФорма, Неопределено, СписокКнопок, Элементы.СуммаВсего);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораВерсии(ВыбраннаяВерсия = Неопределено,ДопПараметр = Неопределено)Экспорт
	
	Если ВыбраннаяВерсия<>Неопределено Тогда
		
		Если Лев(ВыбраннаяВерсия.Значение,6)="Версия" Тогда
			
			ГУИДСообщения = СтрЗаменить(Сред(ВыбраннаяВерсия.Значение,8),"_","-");
			ОбработчикВыбораВерсииСервер(ГУИДСообщения);
			ПриОткрытии(ложь);
			
		ИначеЕсли ВыбраннаяВерсия.Значение = "СравнитьВерсии" Тогда
			
			ВыбратьВерсиюИПоказатьСравнение();
			
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры // ОбработчикВыбораВерсии()

&НаКлиенте
Процедура ВыбратьВерсиюИПоказатьСравнение()
	
	ПараметрыСравнения = Новый Структура;
	ПараметрыСравнения.Вставить("ТекущаяВерсия", Сообщение.СообщениеСсылка);
	ПараметрыСравнения.Вставить("ПредставлениеТекущейВерсии");
	ПараметрыСравнения.Вставить("ВерсияДляСравнения");
	ПараметрыСравнения.Вставить("ПредставлениеВерсииДляСравнения");
	
	СписокВерсийДляВыбора = Новый СписокЗначений;
	
	Для каждого СтрокаВерсии Из ВерсииСообщения Цикл
		Если СтрокаВерсии.Ссылка = Сообщение.СообщениеСсылка Тогда
			ПараметрыСравнения.ПредставлениеТекущейВерсии = СтрокаВерсии.Представление;
		КонецЕсли;
		СписокВерсийДляВыбора.Добавить(СтрокаВерсии.Ссылка,СтрокаВерсии.Представление);
	КонецЦикла;
	
	КоличествоВерсий = СписокВерсийДляВыбора.Количество();
	Если КоличествоВерсий = 1 Тогда 
		ПоказатьФормуРасхождений(СписокВерсийДляВыбора[0], ПараметрыСравнения);
	Иначе
		
		ПоследняяВерсияВСписке = СписокВерсийДляВыбора[КоличествоВерсий - 1];
		ЗаголовокОкнаВыбора = "Выберите версию для сравнения с текущей";
		
		МодульОбъектаКлиент().ПоказатьВыборЭлемента_КонтурEDI("ПоказатьФормуРасхождений", 
															   ЭтаФорма, 
															   ПараметрыСравнения, 
															   СписокВерсийДляВыбора,
															   ПоследняяВерсияВСписке,
															   ЗаголовокОкнаВыбора);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуРасхождений(ВыбраннаяВерсияДляСравнения, ПараметрыСравнения) Экспорт
	
	Если ВыбраннаяВерсияДляСравнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСравнения.ВерсияДляСравнения = ВыбраннаяВерсияДляСравнения.Значение;
	ПараметрыСравнения.ПредставлениеВерсииДляСравнения = ВыбраннаяВерсияДляСравнения.Представление;
	
	ПараметрыФормыРасхождений = Новый Структура;
	ПараметрыФормыРасхождений.Вставить("ВидРасхождения", "РасхожденияВерсийЗаказа");
	ПараметрыФормыРасхождений.Вставить("Заказ",	Сообщение.СообщениеСсылка);
	ПараметрыФормыРасхождений.Вставить("Параметры",	ПараметрыСравнения);
			
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сервис_ПросмотрРасхожденийУправляемая", , ПараметрыФормыРасхождений, ЭтаФорма, , , , РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаСервере
Процедура ОбработчикВыбораВерсииСервер(ГУИДСообщения)
	
	СсылкаВыбранногоСообщения = Справочники.КонтурEDI_Сообщения.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДСообщения));
	ВыбранноеСообщение = МодульОбъекта().ПрочитатьСообщение(СсылкаВыбранногоСообщения,,Сообщение.ТипСообщения,"Входящее");
	
	Если ЗначениеЗаполнено(ВыбранноеСообщение) Тогда
		
		МодульОбъекта().КонвертироватьСообщениеEDIв1С(ВыбранноеСообщение);    //взято из оф - а в тут наверно можно выпилить
		
		ВыбранноеСообщение.СообщениеСсылка = СсылкаВыбранногоСообщения;
		Сообщение = ВыбранноеСообщение;
		Сообщение.Документ1С = СсылкаВыбранногоСообщения.Документ;
				
		Параметры.СообщениеСсылка	= СсылкаВыбранногоСообщения; 
		Параметры.Документ1С		= СсылкаВыбранногоСообщения.Документ;
		
		ПроизвестиПервоначальноеЗаполнениеПолейНаФорме();
		ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();	
		УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
		ДозаполнитьАртикулКодПолноеНаименованиеТЧТовары();
		
	КонецЕсли;
	
КонецПроцедуры // ()

&НаСервере
Функция ПолучитьСписокИменКнопокДублей()
		
	СписокКнопок = Новый СписокЗначений;
		
	Для Каждого ВерсияСообщения Из ВерсииСообщения Цикл
				
		ИмяКнопки = "Версия_" + СтрЗаменить(ВерсияСообщения.УникальныйИдентификатор,"-","_");
		НоваяКнопка = СписокКнопок.Добавить(ИмяКнопки,ВерсияСообщения.Представление);
		
		Если ВерсияСообщения.Ссылка = Сообщение.СообщениеСсылка Тогда
			НоваяКнопка.Картинка = БиблиотекаКартинок.СформироватьОтчет;
		КонецЕсли;
		
	КонецЦикла;
	
	НоваяКнопка = СписокКнопок.Добавить("СравнитьВерсии","Сравнить версии",,БиблиотекаКартинок.Отчет);
		
	Возврат СписокКнопок;		
	
КонецФункции

&НаКлиенте
Процедура КнопкаДействияФормыВыборВерсииНажатие(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ПерепривязатьСообщенияИнтерактивно();  
	
	ПараметрыОбработкиВерсий = ПодготовитьПараметрыОбработкиВерсий();
	РеквизитыВопросаПользователю = РеквизитыВопросаПриОбработкеВерсий(ПараметрыОбработкиВерсий);
	
	МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI("ОбработчикВыбораДействияНадДокументом1С",
												    ЭтаФорма,
												    ПараметрыОбработкиВерсий,
												    РеквизитыВопросаПользователю.ТекстВопроса,
												    РеквизитыВопросаПользователю.СписокКнопок);
														
КонецПроцедуры

&НаКлиенте
Функция РеквизитыВопросаПриОбработкеВерсий(ПараметрыОбработкиВерсий)
	
	СписокКнопок = Новый СписокЗначений;
	КнопкаОтветаДа 		= СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Да");
	КнопкаОтветаНет 	= СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Нет");
	КнопкаОтветаОтмена	= СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
	
	Если Не ПараметрыОбработкиВерсий.ЗаполненДокумент1С Тогда
		
		ТекстВопроса = "Создать документ 1С?";
		СписокКнопок.Удалить(КнопкаОтветаНет);
		
	ИначеЕсли ПараметрыОбработкиВерсий.ЕстьВиртуальныеORDERS Тогда 
		
		ТекстВопроса = "Следующие документы будут помечены на удаление:";
		Для Каждого Стр Из ПараметрыОбработкиВерсий.ВиртуальныеORDERS Цикл
			ТекстВопроса = ТекстВопроса + Символы.ПС + Стр.Документ;
		КонецЦикла;
		
		ТекстВопроса = ТекстВопроса + Символы.ПС + "Вместо них будут созданы новые документы. Продолжить?";
		КнопкаОтветаДа.Представление = "Да, пересоздать документы";
		КнопкаОтветаНет.Представление = "Нет, игнорировать изменения";
		
	Иначе	
		
		ТекстВопроса = "Документ " + Документ1С + " будет перезаполнен. Продолжить?";
		КнопкаОтветаДа.Представление = "Да, перезаполнить";
		КнопкаОтветаНет.Представление = "Нет, игнорировать изменения";
		
	КонецЕсли;

	РеквизитыВопроса = Новый Структура;
	РеквизитыВопроса.Вставить("ТекстВопроса", ТекстВопроса);
	РеквизитыВопроса.Вставить("СписокКнопок", СписокКнопок);
	
	Возврат РеквизитыВопроса;
	
КонецФункции

&НаСервере
Функция ПодготовитьПараметрыОбработкиВерсий()
	
	ЗаполненДокумент1С = ЗначениеЗаполнено(Документ1С);
	
	ПараметрыОбработкиВерсий = Новый Структура;
	ПараметрыОбработкиВерсий.Вставить("ЗаполненДокумент1С", ЗаполненДокумент1С);
	ПараметрыОбработкиВерсий.Вставить("ПервоначальнаяЗагрузкаСообщения", Не ЗаполненДокумент1С);
	
	Если ЗаполненДокумент1С Тогда
		ВиртуальныеORDERS = МодульОбъекта().ПолучитьВиртуальныеСвязанныеORDERS(Документ1С);
	Иначе
		ВиртуальныеORDERS = Новый Массив;
	КонецЕсли;
	
	Если ВиртуальныеORDERS.Количество() > 1 Тогда 
		ПараметрыОбработкиВерсий.Вставить("ВиртуальныеORDERS", МодульОбъекта().ТаблицаЗначенийВМассив_КонтурEDI(ВиртуальныеORDERS));
		ПараметрыОбработкиВерсий.Вставить("ЕстьВиртуальныеORDERS", Истина);
		ПараметрыОбработкиВерсий.ПервоначальнаяЗагрузкаСообщения = Истина;
	Иначе
		ПараметрыОбработкиВерсий.Вставить("ВиртуальныеORDERS", Новый Массив);
		ПараметрыОбработкиВерсий.Вставить("ЕстьВиртуальныеORDERS", Ложь);
	КонецЕсли;
	
	Возврат ПараметрыОбработкиВерсий;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикВыбораДействияНадДокументом1С(ВыбранноеЗначение = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = КодВозвратаДиалога.Да Тогда
		
		Если ПерезаполнитьДокумент1С(ДополнительныеПараметры) Тогда
			ЗакрытиеРазрешено = Истина;
			ЭтаФорма.Закрыть(Неопределено);
		КонецЕсли;
		
	ИначеЕсли ВыбранноеЗначение = КодВозвратаДиалога.Нет Тогда
		
		ОбработатьИгнорированиеНовойВерсии(ДополнительныеПараметры.ВиртуальныеORDERS);
		ЗакрытиеРазрешено = Истина;
		ЭтаФорма.Закрыть(Неопределено);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИгнорированиеНовойВерсии(ВиртуальныеORDERS)
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	Если Сообщение.ТипСообщения = "ORDERS" Тогда
		МодульОбъекта().УстановитьСтатусСообщения(Сообщение.СообщениеСсылка,
												  Сообщение.ДокументСсылка,
												  Сообщение.ТипСообщения,
												  "ВходящийЗагружен");
	КонецЕсли;
	
	Для Каждого ВиртуальныйORDERS Из ВиртуальныеORDERS Цикл
		МодульОбъекта().УстановитьСтатусСообщения(ВиртуальныйORDERS.ORDERS,
												  ВиртуальныйORDERS.Документ,
												  "ORDERS",
												  "ВходящийЗагружен");
	КонецЦикла;	
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПроизвольныеПараметрыФормы(ПараметрыДействия)
	 
	 ПроизвольныеПараметры = Параметры.ПроизвольныеПараметры;
	 
	 Если НЕ ПроизвольныеПараметры = Неопределено Тогда
		 
		 Для Каждого ПроизвольныйПараметр Из ПроизвольныеПараметры Цикл
			 ПараметрыДействия.Вставить(ПроизвольныйПараметр.Ключ,	ПроизвольныйПараметр.Значение);
		 КонецЦикла;
		 
	 КонецЕсли;
 
 КонецПроцедуры // ДобавитьПроизвольныеПараметрыФормы() 

//Обработчики команд нажатия кнопок - реализация иная чем в ОФ в связи с тем что в обработчик передается имя команды а не элемент формы
//so, создадим все возможные команды которые могут случиться в форме и в них пропишем обработчики а выводить или нет саму кнопку будем решать при создании на сервере
//точно так же будем придумыва
&НаКлиенте
Процедура КнопкаДействияФормыНажатие_Клиент(ИмяКоманды)
		
	ПараметрыПМ = Новый Структура("Сообщение, ТранспортныеУпаковки, Форма, ИмяКоманды", Сообщение, ТранспортныеУпаковки, ЭтаФорма, ИмяКоманды);
	
	СтандартнаяОбработкаEDI = Истина;
	ОсновнаяФорма().ОбработкаСобытияПодключаемогоМодуляКлиент("КнопкаДействияФормыНажатие_Клиент", СтандартнаяОбработкаEDI, ПараметрыПМ);
	
	Если СтандартнаяОбработкаEDI = Истина Тогда
		
		РезультатДействия = КнопкаДействияФормыНажатие(ИмяКоманды);
		
		Если НужноПромаркироватьУпаковкиSSCCКодом(ИмяКоманды, ОтправлятьДанныеОбУпаковках) = Истина Тогда
			РазвернутьВсеУровниТранспортныхУпаковок();
		КонецЕсли;
		
		//для печати паллетных листов
		Если ТипЗнч(РезультатДействия) = Тип("ТабличныйДокумент") Тогда
			
			РезультатДействия.Показать();
			
		ИначеЕсли РезультатДействия <> Неопределено 
			и РезультатДействия.ЗакрытьФорму
			и ЭтаФорма.Открыта() Тогда
			
			ЗакрытиеРазрешено = Истина;
			ЭтаФорма.Закрыть(Параметры.СообщениеСсылка);
			
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НужноПромаркироватьУпаковкиSSCCКодом(ИмяКоманды, ОтправлятьДанныеОбУпаковках)
	
	МассивКоманд = Новый Массив;
	МассивКоманд.Добавить("ОтправитьУведомлениеОбОтгрузке");
	МассивКоманд.Добавить("Сохранить");
	МассивКоманд.Добавить("ОтправитьСчетФактуру");
	
	НужноПромаркироватьУпаковкиSSCCКодом = (ОтправлятьДанныеОбУпаковках = Истина 
		И МассивКоманд.Найти(ИмяКоманды) <> Неопределено);
		
	Возврат НужноПромаркироватьУпаковкиSSCCКодом;
	
КонецФункции

&НаСервере
Функция КнопкаДействияФормыНажатие(ИмяКоманды)
	
	РезультатДействия = Новый Структура("ЗакрытьФорму", Ложь);
	
	СвойстваКнопки = ПолучитьСвойстваКнопки(ИмяКоманды); 
	
	ПроверкаПолей = (НЕ СвойстваКнопки = Неопределено);
	
	Если ПроверкаПолей И СвойстваКнопки.ПроверятьПоля Тогда
		
		Если НЕ ПроверитьЗаполнениеПолей() Тогда
			
			ОткрытьПанельОшибокСервер();  			
			ПроверкаПолей = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПроверкаПолей Тогда 		
		
		ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
		
		Попытка
		
			Если СвойстваКнопки.СохранятьСоответствия Тогда
				
				ПеренестиПоля1СвСообщение(Сообщение); 
				
			КонецЕсли; 		
			
			Если НужноПромаркироватьУпаковкиSSCCКодом(ИмяКоманды, ОтправлятьДанныеОбУпаковках) = Истина Тогда
				
				ДеревоТранспортныхУпаковок = РеквизитФормыВЗначение("ТранспортныеУпаковки");
				МодульОбъекта().ПромаркироватьУпаковкиКодомSSCC(ДеревоТранспортныхУпаковок, Сообщение.Продавец1С, Сообщение);
				Сообщение.ТранспортныеУпаковки = ДеревоТранспортныхУпаковок;
				ЗначениеВРеквизитФормы(ДеревоТранспортныхУпаковок, "ТранспортныеУпаковки");

			КонецЕсли;
					
			Действие = ОпределитьДействиеПоОсновнойКнопке(ИмяКоманды);    
			
			Если Действие = "ПерезаполнитьДокумент1С" Тогда
				
				Если ПерезаполнитьДокумент1С() Тогда 				
					РезультатДействия.ЗакрытьФорму = Истина;  								
				КонецЕсли;  
				
			ИначеЕсли Действие = "ВыбратьТекущуюВерсию" Тогда
				
				ПерепривязатьСообщенияИнтерактивно();
				
				Если ПерезаполнитьДокумент1С() Тогда
					РезультатДействия.ЗакрытьФорму = Истина;
				КонецЕсли;
				
			ИначеЕсли Действие = "ОсновноеДействие" Тогда 
				
				РезультатДействия = МодульОбъекта().КнопкаФормыСообщенияНажатие(ИмяКоманды,Сообщение, ПараметрыДействия); //КонвертироватьПарамтрыФормыВСтруктуруСервер());
				
				Если РезультатДействия.СозданДокумент = Истина Тогда
					
					Документ1С = РезультатДействия.СсылкаНаДокумент;
					
				КонецЕсли;  			
				
			КонецЕсли;
		
		Исключение
			
			УничтожитьТаблицыЗначенийПроизвольныхРеквизитов(); 
			ТекстОшибки = "Не удалось выполнить действие на форме - " + ИмяКоманды + " - " + ОписаниеОшибки();
			МодульОбъекта().ЗаписьЖурналаРегистрации_КонтурEDI(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		
		КонецПопытки;
		
		ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
		УничтожитьТаблицыЗначенийПроизвольныхРеквизитов(); 
		
	КонецЕсли;
	
	Возврат РезультатДействия;
	
КонецФункции

&НаСервере
Функция ОпределитьДействиеПоОсновнойКнопке(Знач ИмяКоманды)
	
	Действие = "ОсновноеДействие";
	
	Элемент = ОпределитьКнопкуЭлементФормыПоИмениКоманды(ИмяКоманды);
	
	Если ИмяКоманды = "СоздатьЗаказ" 
		И Элемент <> Неопределено
		И Элемент.Заголовок = "Перезаполнить заказ" Тогда
		
		Действие = "ПерезаполнитьДокумент1С";
		
	КонецЕсли;
	
	Если ИмяКоманды = "СоздатьЗаказ"
		И Элемент <> Неопределено
		И Элемент.Заголовок = "Обработать новую версию" Тогда
		
		Действие = "ВыбратьТекущуюВерсию";
		
	КонецЕсли;
	
	Если НЕ ТипЗнч(ПараметрыДействия) = Тип("Структура") Тогда
		ПараметрыДействия = Новый Структура();
	КонецЕсли;		
	
	ПараметрыДействия.Вставить("ОтправитьСообщениеИзФормы",	Истина);
	ПараметрыДействия.Вставить("Сообщение",					Сообщение);
	ПараметрыДействия.Вставить("Объект",					МодульОбъекта());
	ПараметрыДействия.Вставить("ОтправкаТолькоALCRPT",		ОтправкаТолькоALCRPT);
	ПараметрыДействия.Вставить("ИзмененныеРеквизиты",		ПодготовитьСтруктуруИзмененныхРеквизитов());
	
	ДобавитьПроизвольныеПараметрыФормы(ПараметрыДействия);
	
	Если ИмяКоманды = "ОтправитьОтветНаЗаказ" и ПараметрыДействия.Свойство("ВходящийЗаказ")Тогда  //костылек на отмену заказа через спец кнопку
		
		ПараметрыДействия.ВходящийЗаказ = МодульОбъекта().ПрочитатьСообщение(ПараметрыДействия.ВходящийЗаказ,,"ORDERS","Входящее");
		
	КонецЕсли;       			
	
	СтандартнаяОбработкаEDI = Истина;
	РезультатДействия = МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("КнопкаФормыСообщенияНажатие",СтандартнаяОбработкаEDI,Новый Структура("ИмяКоманды,Сообщение,Параметры,Форма,РезультатКлиента",ИмяКоманды,Сообщение,Параметры,ЭтаФорма,Неопределено));
	
	Если СтандартнаяОбработкаEDI = Ложь Тогда
		Действие = "НеСтандартнаяОбработкаДействия";
	КонецЕсли;
	
	Возврат Действие;

КонецФункции

&НаСервере
Функция ПолучитьСвойстваКнопки(ИмяКоманды)
	
	Перем КнопкиКоманднойПанели, СвойстваКнопки;
	
	СтруктураВременногоХранилища = ПолучитьИзВременногоХранилища(АдресВХПроизвольныеРеквизиты);
	КнопкиКоманднойПанели	= СтруктураВременногоХранилища.НастройкаФормы.КнопкиКоманднойПанели;
	
	СвойстваКнопки = КнопкиКоманднойПанели.Найти(ИмяКоманды,"Имя");
	Возврат СвойстваКнопки;

КонецФункции

&НаСервере
Функция КонвертироватьПарамтрыФормыВСтруктуруСервер()
    //только ключевые
	Сконвертированнаятруктура=Новый Структура;
	
	Сконвертированнаятруктура.Вставить("Документ1С",Параметры.Документ1С);
	Сконвертированнаятруктура.Вставить("КодДействия",Параметры.КодДействия);
	Сконвертированнаятруктура.Вставить("МодальностьЗапрещена",Объект.ПараметрыКлиентСервер.МодальностьЗапрещена);
	Сконвертированнаятруктура.Вставить("РежимРаботы",Параметры.РежимРаботы);
	Сконвертированнаятруктура.Вставить("СообщениеСсылка",Параметры.СообщениеСсылка);
	Сконвертированнаятруктура.Вставить("ТипСообщения",Параметры.ТипСообщения);
	Сконвертированнаятруктура.Вставить("ОтправкаТолькоALCRPT",ОтправкаТолькоALCRPT);    //добавим сервисный реквизит, костыльно смотрится - //метка рефакторинг
	//добавить произвольные параметры если там структура - опять же смотрится костыльно - //метка рефакторинг
	
	Если Параметры.ПроизвольныеПараметры<>Неопределено Тогда
		Если Параметры.ПроизвольныеПараметры.Свойство("Статус") Тогда 
			Сконвертированнаятруктура.Вставить("Статус",		Параметры.ПроизвольныеПараметры.Статус);
		КонецЕсли;
		Если Параметры.ПроизвольныеПараметры.Свойство("ВходящийЗаказ") Тогда
			
			СообщениеЗаказ = МодульОбъекта().ПрочитатьСообщение(Параметры.ПроизвольныеПараметры.ВходящийЗаказ,,"ORDERS","Входящее");
			МодульОбъекта().КонвертироватьСообщениеEDIв1С(СообщениеЗаказ);
			
			Сконвертированнаятруктура.Вставить("ВходящийЗаказ",	СообщениеЗаказ);
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат Сконвертированнаятруктура;
	
КонецФункции // КонвертироватьПарамтрыФормыВСтруктуру()

&НаКлиенте
Процедура КнопкаДополнительныеДействияФормыНажатие(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);   	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказ(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);  
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказПоставщику(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВозврат(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНовуюВерсиюВозврата(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если Сообщение.ТипСообщения = "RETANN" И Сообщение.Свойство("Статус") Тогда
		Если ВРег(Сообщение.Статус) = "CANCELED" ИЛИ ВРег(Сообщение.Статус) = "ОТМЕНА" ИЛИ ВРег(Сообщение.Статус) = "REPLACE" ИЛИ ВРег(Сообщение.Статус) = "ЗАМЕНА" Тогда
			СписокДействий = Новый СписокЗначений;
			Текст = "";
			
			Если ВРег(Сообщение.Статус) = "CANCELED" ИЛИ ВРег(Сообщение.Статус) = "ОТМЕНА" Тогда
				
				Текст = "Партнер отменил возврат. Что делать?";  				
				
				СписокДействий.Добавить("ПометитьНаУдаление",		"Пометить документ на удаление");								
				СписокДействий.Добавить("ОтметитьКакОбработанное",	"Отметить сообщение как обработанное");
				
			ИначеЕсли ВРег(Сообщение.Статус) = "REPLACE" ИЛИ ВРег(Сообщение.Статус) = "ЗАМЕНА" Тогда
				
				Текст = "Партнер отправил новую версию возврата. Что делать?";
														
				СписокДействий.Добавить("ЗагрузитьВозврат",			"Перезаполнить документ возврата"); 				
				СписокДействий.Добавить("ОтметитьКакОбработанное",	"Игнорировать новую версию");
				
			КонецЕсли;
			
			СписокДействий.Добавить("Отмена","Отмена");
			
			ПараметрыВопроса = Новый Структура("Вопрос","НоваяВерсияВозврата");
			
			Если Объект.ПараметрыКлиентСервер.МодальностьЗапрещена Тогда
				ЗадатьВопрос = "";
				ЗадатьВопрос = ЗадатьВопрос + Символы.ПС + "Оповещение = Новый ОписаниеОповещения(""ПослеЗакрытияВопроса"", ЭтаФорма,ПараметрыВопроса);"; 
				ЗадатьВопрос = ЗадатьВопрос + Символы.ПС + "ПоказатьВопрос(Оповещение, Текст, СписокДействий);"; 	 
				Выполнить(ЗадатьВопрос);
			Иначе 				
				Ответ = Вопрос(Текст, СписокДействий, 0);
				
				ПослеЗакрытияВопроса(Ответ,ПараметрыВопроса);  				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Ответ, ДопПараметры = Неопределено) Экспорт

	Если ДопПараметры <> Неопределено Тогда  		
		Если ДопПараметры.Свойство("Вопрос") Тогда
			Если ДопПараметры.Вопрос = "НоваяВерсияВозврата" Тогда
				Если  Ответ = "Отмена" Тогда
					//Ничего не делаем
				ИначеЕсли Ответ = "ОтклонитьВозвратПолностью" Тогда
					ВыполнитьОтклонитьВозвратПолностью();
				Иначе
					
					КнопкаДействияФормыНажатие_Клиент(Ответ);  
					
				КонецЕсли;
			КонецЕсли;   
		КонецЕсли; 				
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОтветНаЗаказ(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьУведомлениеОбОтгрузке(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьУведомлениеОбОтгрузкеВозврата(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если НЕ ЗначениеЗаполнено(Документ1С) Тогда
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить("Создать документ");
		СписокКнопок.Добавить("Привязать документ");
		СписокКнопок.Добавить("Отмена");
		
		ТекстВопроса = "Не найден документ возврата, создать новый или привязать существующий?" ;
		ИмяОбработчика = "ОбработчикВопросаСоздатьИлиПривязатьДокументПриЗагрузкиУведомленияОбОтгрузкеВозврата";
		ПараметрыОбработчика = Неопределено;
		
		МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика, ЭтаФорма, ПараметрыОбработчика, ТекстВопроса, СписокКнопок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВопросаСоздатьИлиПривязатьДокументПриЗагрузкиУведомленияОбОтгрузкеВозврата(РезультатВопроса, ДопПараметрДляПередачиВОбработчик = Неопределено) Экспорт
	
	Если РезультатВопроса = "Создать документ" Тогда
		
		КнопкаДействияФормыНажатие_Клиент("ЗагрузитьУведомлениеОбОтгрузкеВозврата");
		
	ИначеЕсли РезультатВопроса = "Привязать документ" Тогда
		
		ВыбратьДокументДляПривязкиСообщения();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРасхожденияЗаказаПокупателя(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	//собрать параметры и показать расхождения
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидРасхождения", 	"РасхожденияЗаказа");
	ПараметрыФормы.Вставить("Заказ",			Документ1С);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сервис_ПросмотрРасхожденийУправляемая", , ПараметрыФормы, ЭтаФорма, , , , РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ПропуститьИсходящееСообщение(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУведомлениеОбОтгрузке(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУведомлениеОПриемке(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтветНаУведомлениеОВозврате(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУведомлениеОВозврате(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУведомлениеОбОтгрузкеВозврата(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУведомлениеОПриемкеВозврата(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗаказ(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтветНаЗаказ(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСчетФактуру(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнструкциюСопоставленияТоваров(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	АдресИнструкции = Объект.ПараметрыКлиентСервер.URLАдреса["ОшибкиПриСопоставленииТоваров"];
	
	МодульОбъектаКлиент().ОткрытьИнструкциюКлиент(Команда, ЭтаФорма, АдресИнструкции);
	
КонецПроцедуры

&НаСервере
Функция ОпределитьКнопкуЭлементФормыПоИмениКоманды(ИмяКоманды)
	Если Этаформа.КоманднаяПанель.ПодчиненныеЭлементы.ОсновноеДействиеФормы1.ИмяКоманды = ИмяКоманды Тогда 
		Возврат Этаформа.КоманднаяПанель.ПодчиненныеЭлементы.ОсновноеДействиеФормы1;
	ИначеЕсли Этаформа.КоманднаяПанель.ПодчиненныеЭлементы.ОсновноеДействиеФормы2.ИмяКоманды = ИмяКоманды Тогда 
		Возврат Этаформа.КоманднаяПанель.ПодчиненныеЭлементы.ОсновноеДействиеФормы2; 
	ИначеЕсли Этаформа.КоманднаяПанель.ПодчиненныеЭлементы.ОсновноеДействиеФормы3.ИмяКоманды = ИмяКоманды Тогда 
		Возврат Этаформа.КоманднаяПанель.ПодчиненныеЭлементы.ОсновноеДействиеФормы3; 
	ИначеЕсли Этаформа.КоманднаяПанель.ПодчиненныеЭлементы.ОсновноеДействиеФормы4.ИмяКоманды = ИмяКоманды Тогда 
		Возврат Этаформа.КоманднаяПанель.ПодчиненныеЭлементы.ОсновноеДействиеФормы4; 
	иначе
		Возврат Неопределено;
	КонецЕсли;		
КонецФункции // ОпределитьКнопкуЭлементФормыПоИмениКоманды()


//прямые обработчики дополнтельных кнопок - расширить
&НаКлиенте
Процедура ОтклонитьЗаказПолностью(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ЗакрытиеРазрешено = Истина;
	
	ПараметрыФормы = Новый Структура("СообщениеСсылка",		Параметры.СообщениеСсылка); 
	ПараметрыФормы.Вставить("Документ1С",					Параметры.Документ1С);
	ПараметрыФормы.Вставить("ТипСообщения",					"ORDRSP");
	ПараметрыФормы.Вставить("Направление",					"Исходящее");
	ПараметрыФормы.Вставить("ТолькоПросмотр",				Ложь);
	ПараметрыФормы.Вставить("КодДействия",					"Отправить_ORDRSP");
	ПараметрыФормы.Вставить("РежимРаботы",					Параметры.РежимРаботы);
	ПараметрыФормы.Вставить("АдресХранилища",				Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект);
	ПараметрыФормы.Вставить("ПараметрыАвтотестирования",	Параметры.ПараметрыАвтотестирования);
	
	ДанныеДляОтклоненияЗаказаПолностью = Новый Структура;
	ДанныеДляОтклоненияЗаказаПолностью.Вставить("ВходящийЗаказСсылка", 				Неопределено);
	ДанныеДляОтклоненияЗаказаПолностью.Вставить("ПереотправляемоеСообщениеСсылка", 	Неопределено);
	
	Если ЗначениеЗаполнено(Параметры.Документ1С) Тогда
		ЗаполнитьДанныеДляОтклоненияЗаказаПолностью(ДанныеДляОтклоненияЗаказаПолностью, Параметры.Документ1С);
	КонецЕсли;	
	
	Если ДанныеДляОтклоненияЗаказаПолностью.ПереотправляемоеСообщениеСсылка <> Неопределено Тогда
		ПараметрыФормы.Вставить("ПереотправляемоеСообщениеСсылка",	
								ДанныеДляОтклоненияЗаказаПолностью.ПереотправляемоеСообщениеСсылка);
	КонецЕсли;	
	
	ПроизвольныеПараметры = Новый Структура();
	ПроизвольныеПараметры.Вставить("Статус", "Отклонить");
	
	Если Параметры.ТипСообщения = "ORDERS" Тогда
		ВходящийЗаказСсылка = Параметры.СообщениеСсылка;
	ИначеЕсли Параметры.ТипСообщения = "ORDRSP" Тогда
		ВходящийЗаказСсылка = ДанныеДляОтклоненияЗаказаПолностью.ВходящийЗаказСсылка;
	КонецЕсли;
	
	ПроизвольныеПараметры.Вставить("ВходящийЗаказ", 	ВходящийЗаказСсылка);
	ПараметрыФормы.Вставить("ПроизвольныеПараметры",	ПроизвольныеПараметры);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ФормаСообщенияУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослеЗакрытияКарточкиПереотправкиСообщения", ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьВозвратПолностью(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ВыполнитьОтклонитьВозвратПолностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтклонитьВозвратПолностью()
	
	ЗакрытиеРазрешено = Истина;
	
	ПараметрыФормы = Новый Структура("СообщениеСсылка",		Параметры.СообщениеСсылка); 
	ПараметрыФормы.Вставить("Документ1С",					Параметры.Документ1С);
	
	Если Параметры.ТипСообщения = "RETANN" ИЛИ Параметры.ТипСообщения = "RETINS"  Тогда
		ПараметрыФормы.Вставить("ТипСообщения",					"RETINS");
		ПараметрыФормы.Вставить("КодДействия",					"Отправить_RETINS"); 
	Иначе
		ПараметрыФормы.Вставить("ТипСообщения",					"RETREC");
		ПараметрыФормы.Вставить("КодДействия",					"Отправить_RETREC"); 
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Направление",					"Исходящее");
	ПараметрыФормы.Вставить("ТолькоПросмотр",				Ложь);
	ПараметрыФормы.Вставить("РежимРаботы",					Параметры.РежимРаботы);
	ПараметрыФормы.Вставить("АдресХранилища",				Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект);
	ПараметрыФормы.Вставить("ПараметрыАвтотестирования",	Параметры.ПараметрыАвтотестирования);
	
	ДанныеДляОтклоненияВозвратаПолностью = Новый Структура; 	
	ДанныеДляОтклоненияВозвратаПолностью.Вставить("ВходящийВозвратСсылка", 				Неопределено);
	ДанныеДляОтклоненияВозвратаПолностью.Вставить("ПереотправляемоеСообщениеСсылка", 	Неопределено);
	
	Если ЗначениеЗаполнено(Параметры.Документ1С) Тогда
		ЗаполнитьДанныеДляОтклоненияВозратаПолностью(ДанныеДляОтклоненияВозвратаПолностью, Параметры.Документ1С,Параметры.ТипСообщения);
	КонецЕсли;	
	
	Если ДанныеДляОтклоненияВозвратаПолностью.ПереотправляемоеСообщениеСсылка <> Неопределено Тогда
		ПараметрыФормы.Вставить("ПереотправляемоеСообщениеСсылка",	
								ДанныеДляОтклоненияВозвратаПолностью.ПереотправляемоеСообщениеСсылка);
	КонецЕсли;	
	
	ПроизвольныеПараметры = Новый Структура();
	ПроизвольныеПараметры.Вставить("Статус", "Отклонить");
	
	Если Параметры.ТипСообщения = "RETANN" ИЛИ Параметры.ТипСообщения = "RETDES" Тогда 		
		ВходящийВозвратСсылка = Параметры.СообщениеСсылка;  		
	ИначеЕсли Параметры.ТипСообщения = "RETINS" ИЛИ Параметры.ТипСообщения = "RETREC" Тогда 		
		ВходящийВозвратСсылка = ДанныеДляОтклоненияВозвратаПолностью.ВходящийВозвратСсылка;		
	КонецЕсли;
	
	ПроизвольныеПараметры.Вставить("ВходящийВозврат", 	ВходящийВозвратСсылка);

	ПараметрыФормы.Вставить("ПроизвольныеПараметры",	ПроизвольныеПараметры);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ФормаСообщенияУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослеЗакрытияКарточкиПереотправкиСообщения", ЭтаФорма);
	
КонецПроцедуры  

//Объединим в одну функцию, чтобы не ходить дважды на сервер
&НаСервере
Процедура ЗаполнитьДанныеДляОтклоненияЗаказаПолностью(СтруктураДанные, ДокументСсылка)
	
	Док_ORDERS = МодульОбъекта().НайтиСвязанныйДокументПоТипуСообщения(ДокументСсылка,"ORDERS");
	СтруктураДанные.ВходящийЗаказСсылка = МодульОбъекта().НайтиСообщениеДокумента(Док_ORDERS, "ORDERS", "Входящее");
	СтруктураДанные.ПереотправляемоеСообщениеСсылка = МодульОбъекта().НайтиСообщениеДокумента(ДокументСсылка, "ORDRSP", "Исходящее");
	
КонецПроцедуры //

&НаСервере
Процедура ЗаполнитьДанныеДляОтклоненияВозратаПолностью(СтруктураДанные, ДокументСсылка, ТипСообщения)
	
	Если Параметры.ТипСообщения = "RETANN" ИЛИ Параметры.ТипСообщения = "RETINS"  Тогда 
		СтруктураДанные.ВходящийВозвратСсылка = МодульОбъекта().НайтиСообщениеДокумента(ДокументСсылка, "RETANN", "Входящее"); 
		СтруктураДанные.ПереотправляемоеСообщениеСсылка = МодульОбъекта().НайтиСообщениеДокумента(ДокументСсылка, "RETINS", "Исходящее");
	Иначе
		СтруктураДанные.ВходящийВозвратСсылка = МодульОбъекта().НайтиСообщениеДокумента(ДокументСсылка, "RETDES", "Входящее");
		СтруктураДанные.ПереотправляемоеСообщениеСсылка = МодульОбъекта().НайтиСообщениеДокумента(ДокументСсылка, "RETREC", "Исходящее");
	КонецЕсли; 	 		
	
КонецПроцедуры // 

&НаКлиенте
Процедура ПерезаполнитьДокумент(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ПоказатьВопросПерезаполнитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросПерезаполнитьДокумент()
	
	ТекстВопроса = "Документ " + СокрЛП(Сообщение.Документ1С) + " будет перезаполнен. Продолжить?";
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить("Да, перезаполнить документ");
	КнопкиВопроса.Добавить("Отмена");
	ПараметрыОбработчика = Неопределено;
	ИмяОбработчика = "ОбработчикСогласияПерезаполненияДокумента";
	
	МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика, ЭтаФорма, ПараметрыОбработчика, ТекстВопроса, КнопкиВопроса);

КонецПроцедуры
 
&НаКлиенте
Процедура ОбработчикСогласияПерезаполненияДокумента(РезультатВопроса,ДопПараметрПереданныйВОбработчик=Неопределено) Экспорт
	
	Если РезультатВопроса =	"Да, перезаполнить документ" Тогда 
		ДокументПерезаполнен=ПерезаполнитьДокумент1С();
		Если ДокументПерезаполнен = Истина Тогда 
			ЗакрытиеРазрешено=Истина;
			ЭтаФорма.Закрыть(неопределено);
		Иначе
			Сообщить("Не удалось перезаполнить документ");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтвязатьДокумент(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если НЕ ЭтоПоследнееСообщениеВЦепочкеВызовСервера() Тогда
		
		ТекстПредупреждения = "Можно отвязывать только последнее сообщение в цепочке!";
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыАвтотестирования = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыАвтотестирования) Тогда
		
		ТекстВопроса = "Сообщение будет отвязано от документа "+СокрЛП(Сообщение.Документ1С)+". Продолжить?";
		КнопкиВопроса = Новый СписокЗначений;
		КнопкиВопроса.Добавить("Да, отвязать сообщение");
		КнопкиВопроса.Добавить("Отмена");
		ПараметрыОбработчика = Неопределено;
		ИмяОбработчика = "ОбработчикПодтвержденияОтвязкиДокумента";
		
		МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика, ЭтаФорма, ПараметрыОбработчика, ТекстВопроса, КнопкиВопроса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПодтвержденияОтвязкиДокумента(РезультатВопроса,ДопПараметрПереданныйВОбработчик=Неопределено) Экспорт
	
	//Действия, связанные с обработкой результата ответа на вопрос
	Если РезультатВопроса= "Да, отвязать сообщение" Тогда 
		
		ОтвязатьСообщениеОтДокументаВызовСервера();
		
		ТолькоПросмотрСообщения = Ложь;
		
		Сообщение.ДокументСсылка	= Неопределено;
		Сообщение.Документ1С		= Неопределено;
		
		Если Сообщение.ТипСообщения = "RECADV" Тогда
			Сообщение.Накладная1С = Неопределено;
		КонецЕсли;
		
		ВыполнитьСерверныедействияПослеОтвязыванияСообщения();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСерверныедействияПослеОтвязыванияСообщения()
	
    ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	ПроизвестиПервоначальноеЗаполнениеПолейНаФорме();
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура ОтвязатьСообщениеОтДокументаВызовСервера()
	
    ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	МодульОбъекта().ОтвязатьСообщениеОтДокумента(Сообщение, Сообщение.ДокументСсылка);	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры // ОтвязатьСообщениеОтДокументаВызовСервера()

&НаКлиенте
Процедура ОткрытьФайл(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	//РезультатКонвертации = ОткрытьФайлВызовСервера();
	//ЗапуститьПриложение(РезультатКонвертации.ПутьКФайлу);
	
	#Если Не ВебКлиент Тогда
		
	ТекстФайла = ОткрытьФайлВызовСервера();
	
	Если ТекстФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДок = Новый ТекстовыйДокумент;
	ТекДок.УстановитьТекст(ТекстФайла);
	ИмяВремФайла = ПолучитьИмяВременногоФайла("xml");
	
	ТекДок.Записать(ИмяВремФайла,КодировкаТекста.UTF8);
	
	ЗапуститьПриложение(ИмяВремФайла);
		
	#КонецЕсли
		
КонецПроцедуры

&НаСервере
Функция ОткрытьФайлВызовСервера()
	
	Если Параметры.ПроизвольныеПараметры=Неопределено Тогда
		Параметры.ПроизвольныеПараметры = Новый Структура;
	КонецЕсли;
	
	Параметры.ПроизвольныеПараметры.Вставить("ИзмененныеРеквизиты",		ПодготовитьСтруктуруИзмененныхРеквизитов());

	Если Сообщение.Направление = "Входящее" 
		ИЛИ Параметры.ТолькоПросмотр = истина 
		Тогда //на входящих сообщениях и открытых только на просмотр у нас уже есть сообщение
		
		времСообщение = МодульОбъекта().ПрочитатьСообщение(Параметры.СообщениеСсылка,Параметры.Документ1С);//,Параметры.ТипСообщения,Параметры.СообщениеСсылка.Направление); //уточнять тип и направление не следует т.к. мы могли просматривать сообщение из строки с треб действием по созданию документа 
	Иначе
		СохраненноесообщениеФормы = Сообщение;
		
		ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
		ПеренестиПоля1СвСообщение(Сообщение);
		
		МодульОбъекта().ПеренестиОсобенностиВСообщение(
		Сообщение, 
		РеквизитФормыВЗначение("Особенности"), 
		РеквизитФормыВЗначение("Товары"), 
		ЭтаФорма);
		
		времСообщение = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(Сообщение));
		Сообщение = СохраненноесообщениеФормы;
		
		//ранее готовили сообщение
		//времСообщение = МодульОбъекта().ПодготовитьИсходящееСообщение(Параметры.ТипСообщения, Параметры.Документ1С,Параметры.ПроизвольныеПараметры);

	КонецЕсли;
	
	Результат = МодульОбъекта().КонвертироватьИсходящееСообщениеПоНовому(времСообщение);
	
	//Возврат Результат;
	
	Если НЕ Результат.Успешно Тогда 
		Для каждого СтрокаОшибки из Результат.ТаблицаОшибок Цикл
			МодульОбъекта().Сообщить_КонтурEDI(СтрокаОшибки.ТекстОшибки);
		КонецЦикла;
		Возврат Неопределено;
	КонецЕсли;
	
	ТекДок = Новый ТекстовыйДокумент;
	ТекДок.Прочитать(Результат.ПутьКФайлу,КодировкаТекста.UTF8);
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	Возврат ТекДок.ПолучитьТекст();
	
КонецФункции

&НаКлиенте
Процедура ПерезаполнитьДокументКлиент(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	// Вставить содержимое обработчика.
КонецПроцедуры

//подготовка / поиск данных

&НаКлиенте
Функция НайтиРекурсивноНижнююСтроку(Строки)
	
	НижняяСтрока = Строки[Строки.Количество()-1];
	
	Если НижняяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
		НижняяСтрока = НайтиРекурсивноНижнююСтроку(НижняяСтрока.ПолучитьЭлементы());
	КонецЕсли;
	
	Возврат НижняяСтрока;
	
КонецФункции

&НаКлиенте
Функция НайтиРекурсивноВерхнююСтроку(СтрокаДерева)
	
	Если Не СтрокаДерева.ПолучитьРодителя() = Неопределено Тогда
		Возврат НайтиРекурсивноВерхнююСтроку(СтрокаДерева.ПолучитьРодителя());
	Иначе
		Возврат СтрокаДерева;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОбщееКоличествоТоварныхПозиций(Строка)
	
	Количество 		= 0;
	НайденнаяСтрока = Неопределено;
	
	МассивНайденныхСтрок = Товары.НайтиСтроки(Новый Структура("НомерСтроки", Строка.НомерСтроки));
	Если Не МассивНайденныхСтрок.Количество() = 0 Тогда
		НайденнаяСтрока = МассивНайденныхСтрок[0];
	КонецЕсли;
	
	Если Не НайденнаяСтрока = Неопределено Тогда
		Количество = НайденнаяСтрока.Количество;	
	КонецЕсли;
		
	Возврат Количество;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРазмещенноеКоличество(Строка)
	
	Количество = 0;

	//для вложений не более одного: верхний уровень - упаковки, нижний - товары
	Для Каждого Упаковка Из ТранспортныеУпаковки.ПолучитьЭлементы() Цикл
		Для Каждого Товар Из Упаковка.ПолучитьЭлементы() Цикл
			Если Товар.НомерСтроки = Строка.НомерСтроки Тогда
				Количество = Количество + Товар.Количество;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Количество;
	
КонецФункции

//учет упаковок по sscc

&НаКлиенте
Функция ПолучитьТипУпаковки(КодТипа)
	
	КодУпаковки = "Код" + КодТипа;
	
	СвойстваУпаковки = Неопределено;
		
	Если ТипыТранспортныхУпаковок.Свойство(КодУпаковки, СвойстваУпаковки) Тогда
		ТипУпаковки = СокрЛП(СтрЗаменить(СвойстваУпаковки.Наименование, "(" + КодТипа + ")", ""));
	ИначеЕсли КодТипа = "CS" Тогда
		ТипУпаковки = "Коробка";
	Иначе
		ТипУпаковки = "Упаковка";
	КонецЕсли;
	
	Возврат ТипУпаковки;
	
КонецФункции

&НаКлиенте
Функция ПолучитьУпаковкуВерхнегоУровня(Строка)
	
	РодительСтроки = Строка.ПолучитьРодителя();
	
	Если РодительСтроки = Неопределено Тогда 
		Возврат Строка;
	Иначе
		Возврат ПолучитьУпаковкуВерхнегоУровня(РодительСтроки);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРазвернутоеНаименованиеТовара(Строка)
	
	Наименование = "";
	
	Номенклатура = Строка(Строка.Номенклатура); 
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Наименование = Наименование + Номенклатура;
	КонецЕсли;
	
	ХарактеристикаНоменклатуры = Строка(Строка.ХарактеристикаНоменклатуры); 
		
	ЕдиницаИзменения = Строка(Строка.ЕдиницаИзмерения);
	
	Если ЗначениеЗаполнено(ХарактеристикаНоменклатуры) 
		 ИЛИ ЗначениеЗаполнено(ЕдиницаИзменения) Тогда
		 
		Если ЗначениеЗаполнено(ХарактеристикаНоменклатуры)
			 И ЗначениеЗаполнено(ЕдиницаИзменения) Тогда
			Наименование = Наименование + " " + "( " + ХарактеристикаНоменклатуры + "," + " " + ЕдиницаИзменения + " )";
		Иначе
			Если ЗначениеЗаполнено(ХарактеристикаНоменклатуры) Тогда
				Наименование = Наименование + " " + "( " + ХарактеристикаНоменклатуры + " )";
			ИначеЕсли ЗначениеЗаполнено(ЕдиницаИзменения) Тогда
				Наименование = Наименование + " " + "( " + ЕдиницаИзменения + " )";
			КонецЕсли;				 
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции

//интерфейсная обработка

&НаКлиенте
Процедура ВыбратьТипУпаковки(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КодУпаковки = СтрЗаменить(Команда.Имя, "ВыбратьУпаковку", "");
	
	СвойстваУпаковки = Неопределено;
		
	Если ТипыТранспортныхУпаковок.Свойство(КодУпаковки, СвойстваУпаковки) Тогда
		ТипУпаковкиПоУмолчанию = СтрЗаменить(КодУпаковки, "Код", "");
		ВыбраннаяУпаковкаЗаголовок = СвойстваУпаковки.Наименование;
	Иначе
		ТипУпаковкиПоУмолчанию = "201";
		ВыбраннаяУпаковкаЗаголовок = "Евро-палета (201)";
	КонецЕсли;
	
	УстановитьЗаголовокВыбраннойУпаковкиКлиент(ВыбраннаяУпаковкаЗаголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокВыбраннойВложеннойУпаковкиКлиент(ВыбраннаяУпаковкаЗаголовок)

	Элементы.ТранспортныеУпаковкиВыбратьТипВложеннойУпаковки.Заголовок = ВыбраннаяУпаковкаЗаголовок;	

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокВыбраннойВложеннойУпаковкиСервер(ВыбраннаяУпаковкаЗаголовок)

	Элементы.ТранспортныеУпаковкиВыбратьТипВложеннойУпаковки.Заголовок = ВыбраннаяУпаковкаЗаголовок;	

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокВыбраннойУпаковкиСервер(ВыбраннаяУпаковкаЗаголовок)

	Элементы.ТранспортныеУпаковкиВыбратьТипУпаковки.Заголовок = ВыбраннаяУпаковкаЗаголовок;	

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТипВложеннойУпаковки(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КодУпаковки = СтрЗаменить(Команда.Имя, "ВыбратьВложеннуюУпаковку", "");
	
	СвойстваУпаковки = Неопределено;
		
	Если ТипыТранспортныхУпаковок.Свойство(КодУпаковки, СвойстваУпаковки) Тогда
		ТипВложеннойУпаковки = СтрЗаменить(КодУпаковки, "Код", "");
		ВыбраннаяУпаковкаЗаголовок = СвойстваУпаковки.Наименование;
	Иначе
		ТипВложеннойУпаковки = "CT";
		ВыбраннаяУпаковкаЗаголовок = "Коробка (CT)";
	КонецЕсли;
	
	УстановитьЗаголовокВыбраннойВложеннойУпаковкиКлиент(ВыбраннаяУпаковкаЗаголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокВыбраннойУпаковкиКлиент(ВыбраннаяУпаковкаЗаголовок)

	Элементы.ТранспортныеУпаковкиВыбратьТипУпаковки.Заголовок = ВыбраннаяУпаковкаЗаголовок;	

КонецПроцедуры

&НаКлиенте
Процедура ВыделитьСтроку(Строка)
	
	Элементы.ТранспортныеУпаковки.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
	Элементы.ТранспортныеУпаковки.ТекущийЭлемент = Элементы.ТранспортныеУпаковки.ПодчиненныеЭлементы.ТранспортныеУпаковкиКоличество;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьЯчейку(Строка)
	
	Элементы.ТранспортныеУпаковки.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
	Элементы.ТранспортныеУпаковки.ТекущийЭлемент = Элементы.ТранспортныеУпаковки.ПодчиненныеЭлементы.ТранспортныеУпаковкиКоличество;
	Элементы.ТранспортныеУпаковки.ИзменитьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеРазмещения(Источник = "")

	//заполнили "Товарные позиции" заново
	ТоварныеПозиции.Очистить();
	Для Каждого Строка Из Товары Цикл
		НоваяСтрока = ТоварныеПозиции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Если Не ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
			НоваяСтрока.Номенклатура = Строка.Наименование;
		КонецЕсли;
	КонецЦикла;
	
	//уменьшаем товарные позиции на распределенные количества
	Для Каждого Упаковка Из ТранспортныеУпаковки.ПолучитьЭлементы() Цикл
		Для Каждого Товар Из Упаковка.ПолучитьЭлементы() Цикл
			
			Отбор = Новый Структура("НомерСтроки",Товар.НомерСтроки);
			МассивТоварныхПозиций = ТоварныеПозиции.НайтиСтроки(Отбор);
			
			Если МассивТоварныхПозиций.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТоварнойПозиции = МассивТоварныхПозиций.Получить(0);
			
			СтрокаТоварнойПозиции.Количество = СтрокаТоварнойПозиции.Количество - Товар.Количество;  				
			
			Если СтрокаТоварнойПозиции.Количество = 0 Тогда
				ТоварныеПозиции.Удалить(СтрокаТоварнойПозиции);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;	
	
		
	ВычислитьКоличествоВУпаковках(ТранспортныеУпаковки.ПолучитьЭлементы());
		
	СортироватьТоварныеПозиции();
		
	ПронумероватьУпаковкиСквознымПорядковымНомером();
	ПроименоватьУпаковки(ТранспортныеУпаковки.ПолучитьЭлементы());
	РазвернутьВсеУровниТранспортныхУпаковок();
	
	Если ОтправлятьКодыМаркировки Тогда
		ЗаполнитьПредставлениеКодовМаркировкиТранспортныхУпаковок(ТранспортныеУпаковки, ТолькоПросмотрСообщения);
	КонецЕсли;
	
	ПослеОбновленияДанныхРазмещения(Источник);
	
	Если ТаблицаОшибок.НайтиСтроки(Новый Структура("ИмяТабличнойЧасти", "ТранспортныеУпаковки")).Количество() > 0 Тогда
		ПодключитьОбработчикОжидания("ОбработчикПерепроверитьСообщение", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбновленияДанныхРазмещения(Источник)
	
	ОсновнаяФорма().ОбработкаСобытияПодключаемогоМодуляКлиент("ПослеОбновленияДанныхРазмещения", , Новый Структура("Сообщение, ТранспортныеУпаковки, Источник", Сообщение, ТранспортныеУпаковки, Источник));
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеУровниТранспортныхУпаковок()

	Для каждого Строка Из ТранспортныеУпаковки.ПолучитьЭлементы() Цикл
		ИдСтроки = Строка.ПолучитьИдентификатор();
		Элементы.ТранспортныеУпаковки.Развернуть(ИдСтроки, Истина);
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ВычислитьКоличествоВУпаковках(Упаковки)
	
	Для Каждого Упаковка Из Упаковки Цикл
		Количество = 0;
		Для Каждого Товар Из Упаковка.ПолучитьЭлементы() Цикл
			Количество = Количество + Товар.Количество;
		КонецЦикла;
		Упаковка.Количество = Количество;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьТоварныеПозиции()
	
	ТоварныеПозиции.Сортировать("НомерСтроки");	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНомераГТДПоСтроке(НомерСтроки)
	НомераГТД="";
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	СтрокаТоваров = Сообщение.Товары[НомерСтроки-1].НомерГТДEDI;
	Для каждого СтрокаГТД Из СтрокаТоваров Цикл
		НомераГТД = ?(НомераГТД="",НомераГТД,НомераГТД+Символы.ПС) + СтрокаГТД.НомерГТД;
	КонецЦикла;
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	Возврат НомераГТД;
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоКВозвратуИПричины1С(НомерСтроки)
	
	КоличествоКВозвратуИПричины1С = "";
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	КоличествоИПричина = Сообщение.Товары[НомерСтроки-1].КоличествоКВозвратуИПричина1С;
	Для каждого Строка Из КоличествоИПричина Цикл
		КоличествоКВозвратуИПричины1С = КоличествоКВозвратуИПричины1С + Строка.ПричинаВозврата + "-" + Строка.КоличествоКВозврату + Символы.ПС;
	КонецЦикла;
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	Возврат КоличествоКВозвратуИПричины1С;
	
КонецФункции

// нумерация упаковок и товаров

&НаКлиенте
Процедура ПронумероватьУпаковкиСквознымПорядковымНомером()
	
	// поскольку в формате имеется один или несколько корневых узлов, начинаем нумеровать упаковки с 2-ки 	
	НомерУпаковки = 2; 
	
	Для Каждого Строка Из ТранспортныеУпаковки.ПолучитьЭлементы() Цикл
		
		Если Не ЗначениеЗаполнено(Строка.ТипУпаковки) Тогда
			Продолжить;
		КонецЕсли;
		
		Строка.НомерУпаковки = НомерУпаковки; 
		ПронумероватьТоварыУпаковки(Строка);
		НомерУпаковки = НомерУпаковки + 1;
		
	КонецЦикла;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПронумероватьТоварыУпаковки(Упаковка)
	
	Для Каждого Товар Из Упаковка.ПолучитьЭлементы() Цикл
		
		Товар.НомерУпаковки = Упаковка.НомерУпаковки;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроименоватьУпаковки(ТранспортныеУпаковкиСтроки)
	
	Для Каждого Строка Из ТранспортныеУпаковкиСтроки Цикл
		
		ПроименоватьУпаковки(Строка.ПолучитьЭлементы());
		
		Если Не ЗначениеЗаполнено(Строка.ТипУпаковки) Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьСоставУпаковки(Строка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоставУпаковки(Упаковка)
	
	РасшифровкаТипУпаковки = ПолучитьТипУпаковки(Упаковка.ТипУпаковки);
	
	Если ЗначениеЗаполнено(Упаковка.SSCC) Тогда
		ТекстSSCC = " (" + Упаковка.SSCC + ")";
	Иначе
		ТекстSSCC = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Упаковка.НомерУпаковки) ИЛИ ЗначениеЗаполнено(ТекстSSCC) Тогда
		РасшифровкаТипУпаковки = РасшифровкаТипУпаковки + " " + "№" + Строка(Упаковка.НомерУпаковки-1) + ТекстSSCC; 
	КонецЕсли;
	
	Упаковка.СоставУпаковки = РасшифровкаТипУпаковки;  	
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокПриАктивизацииЯчейки(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаОшибок.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		СделатьАктивнымПоле(ТекущаяСтрока.ИмяПоля,ТекущаяСтрока.ИмяТабличнойЧасти,ТекущаяСтрока.НомерСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьАктивнымПоле(ИмяПоля,ИмяТабличнойЧасти,НомерСтроки)//
	
	Если ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		
		ТабличнаяЧасть = Элементы[ИмяТабличнойЧасти];
		
		ЭтаФорма.ТекущийЭлемент = ТабличнаяЧасть;
		
		Если НЕ НомерСтроки = 0 Тогда
			
			ТабличнаяЧасть.ТекущийЭлемент	= Элементы.Найти(ИмяТабличнойЧасти+ИмяПоля);
			Выполнить("ТабличнаяЧасть.ТекущаяСтрока	= "+ИмяТабличнойЧасти+"[НомерСтроки-1].ПолучитьИдентификатор()");
			
		КонецЕсли;
		
	Иначе	
		
		Если ЗначениеЗаполнено(ИмяПоля) Тогда
			
			Если Найти(ИмяПоля,"Грузоотправитель") > 0 Тогда
				
				ЭтаФорма.ТекущийЭлемент = Элементы.ДействиеГрузоотправитель;
				
			ИначеЕсли Найти(ИмяПоля,"Грузополучатель") > 0 Тогда
				
				ЭтаФорма.ТекущийЭлемент = Элементы.ДействиеГрузополучатель;
				
			ИначеЕсли Найти(ИмяПоля,"Продавец") > 0 Тогда
				
				Если КтоМы = "Поставщик" Тогда
					ЭтаФорма.ТекущийЭлемент = Элементы.ДействиеЮрФизЛицоСвое;
				Иначе
					ЭтаФорма.ТекущийЭлемент = Элементы.ДействиеЮрФизЛицоСтороннее;
				КонецЕсли;
				
			ИначеЕсли Найти(ИмяПоля,"Покупатель") > 0 Тогда
				
				Если КтоМы = "Поставщик" Тогда
					ЭтаФорма.ТекущийЭлемент = Элементы.ДействиеЮрФизЛицоСтороннее;
				Иначе
					ЭтаФорма.ТекущийЭлемент = Элементы.ДействиеЮрФизЛицоСвое;
				КонецЕсли;
				
			ИначеЕсли Найти(ИмяПоля,"ЗаказEDI") > 0 Тогда
				
				
			ИначеЕсли Найти(ИмяПоля,"СчетФактураEDI") > 0 Тогда
				
				ЭтаФорма.ТекущийЭлемент = Элементы.СчетФактура1С;
				
			ИначеЕсли Особенности.НайтиСтроки(Новый Структура("Идентификатор",ИмяПоля )).Количество() > 0 Тогда
				
				ТабличнаяЧасть = Элементы.Особенности;
				ЭтаФорма.ТекущийЭлемент = ТабличнаяЧасть;
				
				ТабличнаяЧасть.ТекущаяСтрока	= Особенности.НайтиСтроки(Новый Структура("Идентификатор",ИмяПоля ))[0].ПолучитьИдентификатор();				
				ТабличнаяЧасть.ТекущийЭлемент	= Элементы.ОсобенностиЗначение;
				
			Иначе
				
				НайденноеПоле = Элементы.Найти(ИмяПоля);
				Если НЕ НайденноеПоле = Неопределено Тогда
					ЭтаФорма.ТекущийЭлемент = НайденноеПоле;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаОшибокДействие" Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
			
			СделатьАктивнымПоле(ТекущиеДанные.ИмяПоля, ТекущиеДанные.ИмяТабличнойЧасти, ТекущиеДанные.НомерСтроки);
			
			НастройкаИсправленияОшибок = НайтиСтрокуНастройкиСсылокИсправленияОшибок(ТекущиеДанные.ИмяПоля);
			
			Если НастройкаИсправленияОшибок <> Неопределено Тогда
				
				НоваяМетрика().НажатаНадпись(Поле).Категория("ДействиеНаФормеОшибокСообщения").Метка(НастройкаИсправленияОшибок.ТипСсылки).НаФорме(ЭтаФорма).ПоместитьВОчередь();

				ОбработчикИсправленияОшибкиКлиент(НастройкаИсправленияОшибок, ТекущиеДанные.ИмяПоля, ТекущиеДанные.НомерСтроки, ТекущиеДанные.ТекстОшибки);
				
				Если НастройкаИсправленияОшибок.ВыполнятьПерезаполнениеСообщения = Истина Тогда
					ОбработчикПослеИсправленияОшибки(ТекущиеДанные.ИмяПоля);	
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиСтрокуНастройкиСсылокИсправленияОшибок(ИмяПоля)
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	НайденнаяСтрока = НастройкаСсылокИсправленияОшибок.Найти(ИмяПоля, "ИмяПоля");
	Если НайденнаяСтрока <> Неопределено Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ИмяПоля",НайденнаяСтрока.ИмяПоля);
		СтруктураВозврата.Вставить("ТекстСсылки",НайденнаяСтрока.ТекстСсылки);
		СтруктураВозврата.Вставить("ТипСсылки",НайденнаяСтрока.ТипСсылки);
		СтруктураВозврата.Вставить("ВыполнятьПерезаполнениеСообщения", НайденнаяСтрока.ВыполнятьПерезаполнениеСообщения);
	Иначе
		СтруктураВозврата = неопределено;
	КонецЕсли;
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();	
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикПослеИсправленияОшибки(ИмяПоля, ДопПараметр = Неопределено) Экспорт
	
	Если Сообщение.Направление = "Исходящее" Тогда
		ПерезаполнитьИсходящееСообщение();
	Иначе
		Если ИмяПоля = "Грузополучатель1С"
			Или ИмяПоля = "Покупатель1С"
			Тогда			
			ПроверитьЗаполнениеПолей();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработчикИсправленияОшибкиКлиент(НайденнаяСтрока,ИмяПоля,НомерСтроки,ТекстОшибки) Экспорт//
		//Сообщить("Функционал в разработке, исправьте вручную");
		//КопияСообщения = МодульИнтеграции_Новый.ПолучитьКопиюСообщения(Сообщение);
		КопияСообщения=Неопределено;
		ВыполнитьДействиеДляИсправлениеОшибкиСообщения(ИмяПоля,НайденнаяСтрока.ТипСсылки,НомерСтроки,ТекстОшибки);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикРедактированияТочкиДоставкиСторонней(Параметр1,ДопПараметр=Неопределено) Экспорт
	ПроверитьЗаполнениеПолей();	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействиеДляИсправлениеОшибкиСообщения_Сервер(СтандартнаяОбработкаEDI, ИмяПоля, ТипСсылки, НомерСтроки = Неопределено, ТекстОшибки = Неопределено) Экспорт 
	
	СтандартнаяОбработкаEDI = Истина;
	
	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ВыполнитьДействиеДляИсправлениеОшибки", СтандартнаяОбработкаEDI, Новый Структура("ИмяПоля, ТипСсылки, КопияСообщения, ОригиналСообщения, ФормаСообщения", ИмяПоля, ТипСсылки, Сообщение, Сообщение, ЭтаФорма));
	
	Если Не СтандартнаяОбработкаEDI Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПросмотраСоответствий(ДанныеСтроки)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Сообщение", Сообщение);
	
	Если Сообщение.Направление = "Входящее" Тогда
		ПараметрыФормы.Вставить("НаименованиеПартнера", ДанныеСтроки.Наименование);
		ИдентификаторыТовара = ПолучитьСтруктуруИдентификаторовТовара(ДанныеСтроки, Сообщение.ТипСообщения, КтоМы);
		ПараметрыФормы.Вставить("ИдентификаторыТовара", ИдентификаторыТовара);
	Иначе	
		ПараметрыФормы.Вставить("Документ1С", Документ1С);
		ПараметрыФормы.Вставить("Номенклатура", ДанныеСтроки.Номенклатура);
		ПараметрыФормы.Вставить("ХарактеристикаНоменклатуры", ДанныеСтроки.ХарактеристикаНоменклатуры);
		ПараметрыФормы.Вставить("ЕдиницаИзмерения", ДанныеСтроки.ЕдиницаИзмерения);
	КонецЕсли;
	
	Если Сообщение.Направление = "Исходящее" Тогда
		Обработчик = "ОбработчикПослеИсправленияОшибки"
	Иначе
		Обработчик = "ОбработчикПослеИнтерактивнойНастройкиСоответствий"
	КонецЕсли;
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("СопоставлениеНоменклатурыИзКарточкиСообщенияУправляемая",, ПараметрыФормы, ЭтаФорма, Обработчик, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте                                             
Функция ВыполнитьДействиеДляИсправлениеОшибкиСообщения(ИмяПоля, ТипСсылки, НомерСтроки = Неопределено, ТекстОшибки = Неопределено) Экспорт
	
	СтандартнаяОбработкаEDI = Истина;
	
	ВыполнитьДействиеДляИсправлениеОшибкиСообщения_Сервер(СтандартнаяОбработкаEDI, ИмяПоля, ТипСсылки ,НомерСтроки, ТекстОшибки);
	
	Если Не СтандартнаяОбработкаEDI Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//В УФ Неопределено //Для УФ эта клиентская функция определена в ФормаСообщенияУправляемая
	Если ТипСсылки = "КарточкаКонтрагента" Тогда
		
		Если ИмяПоля = "Грузополучатель1С" Тогда
			Если ЭтаФорма.Сообщение.ТипСообщения = "ORDERS" Тогда
				Если Найти(ТекстОшибки,"не указана связь с точкой доставк")>0 или Найти(ТекстОшибки,"не указана связь с юр.")>0 Тогда
					
					//Открыть форму ТД
					Состояние("Открываю точку доставки",75);
					
					ПараметрыФормы = Новый Структура;
					ПараметрыФормы.Вставить("СсылкаТочкиДоставки", ЭтаФорма.Сообщение.Грузополучатель1С);
					МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ТочкиДоставкиСторонние_ЭлементУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикРедактированияТочкиДоставкиСторонней", ЭтаФорма);
					
					Возврат Неопределено;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//выше - была ТД но без соотв.
		
		//ниже - не было самой ТД
		Если Прав(ИмяПоля,3) = "EDI" Тогда
			ИмяПоляКонтрагента = Лев(ИмяПоля,СтрДлина(ИмяПоля)-3);
		ИначеЕсли Прав(ИмяПоля,2) = "1С" Тогда
			ИмяПоляКонтрагента = Лев(ИмяПоля,СтрДлина(ИмяПоля)-2);
		Иначе 
			ИмяПоляКонтрагента = ИмяПоля;
		КонецЕсли;
		
		//открыть форму контрагента для интерактивных действий пользователя
		ОткрытьФормуКонтрагента(ИмяПоляКонтрагента);
		
	ИначеЕсли ТипСсылки = "Документ1С" Тогда
		
		//Сообщение.ДокументСсылка.ПолучитьФорму().ОткрытьМодально();
		
	ИначеЕсли ТипСсылки = "НоменклатураСсылка" Тогда
		
		ДанныеСтроки = Товары[НомерСтроки - 1];
		ОткрытьФормуПросмотраСоответствий(ДанныеСтроки);
		
	ИначеЕсли ТипСсылки = "СоответствиеНоменклатуры" Тогда
		
		ДанныеСтроки = Товары[НомерСтроки - 1];
			
		ИдентификаторыТовара = ПолучитьСтруктуруИдентификаторовТовара(ДанныеСтроки, Сообщение.ТипСообщения, КтоМы);
		
		СписокВыбора = СоставитьСписокВыбораПоСтрокеТоваровСервер(
		ИдентификаторыТовара.GTIN,
		ИдентификаторыТовара.КодТовараПартнера,
		ИдентификаторыТовара.КодЕдиницыИзмеренияEDI,
		Отправитель1С); 
		
		Если Сообщение.Направление = "Входящее"
			И (СписокВыбора.Количество() = 1 И СписокВыбора.НайтиПоЗначению("Настроить соответствие товаров") <> Неопределено) Тогда
			
			ОткрытьНоменклатура_ЭлементУправляемая();
			
		Иначе
			
			ОткрытьФормуПросмотраСоответствий(ДанныеСтроки);
			
		КонецЕсли;
		
	ИначеЕсли ТипСсылки = "ДокументДиадок" Тогда
		
		ОткрытьЭлектронныеДокументыВВебДиадок(Сообщение.СообщениеСсылка, Документ1С);
		 
	ИначеЕсли ТипСсылки = "КодыМаркировки" Тогда
		
		ОткрытьФормуКодовМаркировки(0);
		
	ИначеЕсли ТипСсылки = "КодыМаркировкиВУпаковках" Тогда
		
		ОткрытьФормуРаспределенияКодовМаркировки();
		
	ИначеЕсли ТипСсылки = "ДоверенностиДокумента" Тогда
		
		ОткрытьФормуПросмотраДоверенностей();
		
	ИначеЕсли ТипСсылки = "ДокументУчетаМаркировка" Тогда
		
		ОткрытьФормуДокументаУчетаМаркировка();
		
	ИначеЕсли ТипСсылки = "СообщениеСОшибкой" Тогда 
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(Сообщение.ОписаниеОшибки,,"Произошла ошибка чтения сообщения"); 
		
	КонецЕсли;
		
КонецФункции 

&НаКлиенте
Процедура ОткрытьСообщениеВМониторинге(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	СсылкаНаСообщениеВМониторинге = ПолучитьЗначениеДопРеквизитаСправочника_КонтурEDIНаСервере(Сообщение.СообщениеСсылка, "СсылкаНаСообщениеВМониторинге");

	Если ЗначениеЗаполнено(СсылкаНаСообщениеВМониторинге) Тогда
		
		ЗапуститьПриложение(СсылкаНаСообщениеВМониторинге);	
	
	Иначе
		
		ТекстПредупреждения = 	"Не удалось найти ссылку на данное сообщение в мониторинге.
								|Попробуйте зайти в мониторинг через ваш веб-браузер.";
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеДопРеквизитаСправочника_КонтурEDIНаСервере(СообщениеСсылка, ИмяРеквизита)
	Возврат МодульОбъекта().ПолучитьЗначениеДопРеквизитаСправочника_КонтурEDI(СообщениеСсылка, ИмяРеквизита);
КонецФункции

&НаКлиенте
Процедура ОткрытьЭлДокументыВДиадоке(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
		
	ОткрытьЭлектронныеДокументыВВебДиадок(Сообщение.СообщениеСсылка, Документ1С);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЭлектронныеДокументыВВебДиадок(СообщениеСсылка, ДокументСсылка)
	
	СписокСсылок = ПолучитьСписокСсылокНаДокументыВВебДиадокСервер(СообщениеСсылка, ДокументСсылка);
	
	Если СписокСсылок.Количество() = 1 Тогда
		
		ОсновнаяФорма().ОбработчикВыбораДокументаДД(СписокСсылок[0], Неопределено);
		
	ИначеЕсли СписокСсылок.Количество() > 1 Тогда
		
		ТекстОбращенияПриВыборе = "Выберите документ для его просмотра в Диадоке";
		
		МодульОбъектаКлиент().ПоказатьВыборЭлемента_КонтурEDI("ОбработчикВыбораДокументаДД", ОсновнаяФорма(), , СписокСсылок, , ТекстОбращенияПриВыборе);
		
	Иначе
		
		ТекстПредупреждения = 	"Не удалось найти ссылки на созданные документы в Диадок.
								|Попробуйте зайти в Диадок через ваш веб-браузер.";
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокСсылокНаДокументыВВебДиадокСервер(СообщениеСсылка, ДокументСсылка)
	Возврат МодульОбъекта().ПолучитьСписокСсылокНаДокументыВВебДиадок(СообщениеСсылка, ДокументСсылка);
КонецФункции

&НаКлиенте
Процедура ЗадатьВопросОткрытьОнлайнСправку(ТекстВопроса = "Открыть справку по работе в модуле Контур.EDI?", ИмяРазделаСправки = "Главная")
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("Открыть онлайн справку");
	СписокКнопок.Добавить("Я знаю, что делать дальше");
	
	Если Параметры.МодальностьЗапрещена Тогда 
		Выполнить("ПоказатьВопрос(Новый ОписаниеОповещения(""ОбработчикВопросаОткрытьОнлайнСправку"", ЭтаФорма, ИмяРазделаСправки), ТекстВопроса, СписокКнопок,,,""Контур.EDI"")");
	Иначе
		РезультатВопроса = Вопрос(ТекстВопроса, СписокКнопок,,,"Контур.EDI");
		Выполнить("ОбработчикВопросаОткрытьОнлайнСправку(РезультатВопроса,ИмяРазделаСправки)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВопросаОткрытьОнлайнСправку(РезультатВопроса, ИмяРазделаСправки = Неопределено) Экспорт
	
	Если РезультатВопроса = "Открыть онлайн справку" 
		И ЗначениеЗаполнено(ИмяРазделаСправки) Тогда
		
		СписокРазделовСправки = ПолучитьСписокРазделовСправкиСервер();
		ЭлементСписка = СписокРазделовСправки.НайтиПоЗначению(ИмяРазделаСправки);
		Если НЕ ЭлементСписка = Неопределено Тогда
			ЗапуститьПриложение(ЭлементСписка.Представление);	
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокРазделовСправкиСервер()

	Возврат МодульОбъекта().ЗагрузитьКлассификаторИзМакета("ОнлайнСправка");	

КонецФункции // ()

&НаСервере
Процедура ОбработчикИсправленияОшибкиСервер()//
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтруктуруИдентификаторовТовара(ВыбраннаяСтрока, ТипСообщения, КтоМы)
	
	Структура = Новый Структура;
	
	Структура.Вставить("GTIN", ВыбраннаяСтрока.GTIN);
	Структура.Вставить("КодЕдиницыИзмеренияEDI", ВыбраннаяСтрока.КодЕдиницыИзмеренияEDI);
	
	// supplier code & buyer code поменяны местами EDI_An-354
	Если ТипСообщения = "RETDES" 
		ИЛИ КтоМы = "Покупатель" Тогда
		
		Структура.Вставить("КодТовараПартнера", ВыбраннаяСтрока.КодТовараПоставщика);
		Структура.Вставить("КодТовараВнутренний", ВыбраннаяСтрока.КодТовараПокупателя);
		
	Иначе
		
		Структура.Вставить("КодТовараПартнера", ВыбраннаяСтрока.КодТовараПокупателя);
		Структура.Вставить("КодТовараВнутренний", ВыбраннаяСтрока.КодТовараПоставщика);
		
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ОпределитьРежимНаСервере()
	
	Возврат МодульОбъекта().ОпределитьКемМыЯвляемся(Сообщение);
	
КонецФункции

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)//!!
	
	ИмяКолонки = Поле.Имя;
	
	Если Сообщение.Направление = "Входящее" Тогда
		Если ИмяКолонки = "ТоварыНоменклатура" 
			ИЛИ ИмяКолонки = "ТоварыЕдиницаИзмерения" 
			ИЛИ ИмяКолонки = "ТоварыХарактеристикаНоменклатуры" Тогда
			
			ДанныеСтроки = Элемент.ТекущиеДанные;
						
			ИдентификаторыТовара = ПолучитьСтруктуруИдентификаторовТовара(ДанныеСтроки, Сообщение.ТипСообщения, КтоМы);
			
			СписокВыбора = СоставитьСписокВыбораПоСтрокеТоваровСервер(
			ИдентификаторыТовара.GTIN,
			ИдентификаторыТовара.КодТовараПартнера,
			ИдентификаторыТовара.КодЕдиницыИзмеренияEDI,
			Отправитель1С); 
			
			Если (СписокВыбора.Количество() = 1 И СписокВыбора.НайтиПоЗначению("Настроить соответствие товаров") <> Неопределено) Тогда
				
				ОткрытьНоменклатура_ЭлементУправляемая();
				
			ИначеЕсли ЗначениеЗаполнено(ДанныеСтроки.Номенклатура) ИЛИ КтоМы = "Покупатель" Тогда
								
				ПараметрыОбработчика = Неопределено;
				МодульОбъектаКлиент().ВыбратьИзМеню_КонтурEDI("ОбработчикВыбораСоответствияИзМеню", ЭтаФорма, ПараметрыОбработчика, СписокВыбора, Элемент);
				
			Иначе
				
				ОткрытьФормуПросмотраСоответствий(ДанныеСтроки);
				
			КонецЕсли;
			
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяКолонки = "ТоварыНомерГТДEDI" Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.НомерГТДEDI) Тогда 
			Попытка
				ТекстГТД = ПолучитьНомераГТДПоСтроке(Элемент.ТекущиеДанные.НомерСтроки);
				Если Параметры.МодальностьЗапрещена Тогда 
					Выполнить("ПоказатьПредупреждение(,ТекстГТД,,""Номера ГТД"")");
				Иначе
					Предупреждение(ТекстГТД,,"Номера ГТД");
				КонецЕсли;
			Исключение
			УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

	Если ИмяКолонки = "ТоварыКоличествоКВозвратуИПричина1С" Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.КоличествоКВозвратуИПричина1С) Тогда 
			Попытка
				ТекстКоличествоКВозвратуИПричины1С = ПолучитьКоличествоКВозвратуИПричины1С(Элемент.ТекущиеДанные.НомерСтроки);
				Если Параметры.МодальностьЗапрещена Тогда 
					Выполнить("ПоказатьПредупреждение(,ТекстКоличествоКВозвратуИПричины1С,,""Количество к возврату"")");
				Иначе
					Предупреждение(ТекстКоличествоКВозвратуИПричины1С,,"Количество к возврату");
				КонецЕсли;
			Исключение
				УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

	Если ИмяКолонки = "ТоварыНеЗагружать" Тогда
		Элемент.ТекущиеДанные.НеЗагружать = НЕ Элемент.ТекущиеДанные.НеЗагружать;
		ПроверитьЗаполнениеПолей();
	КонецЕсли;
	
	Если ИмяКолонки = "ТоварыКодыМаркировкиПредставление"
		ИЛИ ИмяКолонки = "ТоварыКодыМаркировкиДоПредставление" 
		ИЛИ ИмяКолонки = "ТоварыКодыМаркировкиПослеПредставление" Тогда
		
		ИмяКолонкиКодов = СтрЗаменить(ИмяКолонки, "Товары", "");
		ИмяКолонкиКодов = СтрЗаменить(ИмяКолонкиКодов, "Представление", "");
		
		ОткрытьФормуКодовМаркировки(Элементы.Товары.ТекущиеДанные.НомерСтроки, ИмяКолонкиКодов)
				
	КонецЕсли;
	
	Если НЕ ТолькоПросмотрСообщения Тогда
		// покажем меню выбора для списка значений	
		
		ПутьКДаннымКолонки = Сред(ИмяКолонки, 7);
		
		Если ИмяКолонки = "ТоварыЗапрашиваемоеДействие" Тогда 
			
			СтандартнаяОбработка = Ложь;
			МодульОбъектаКлиент().ВыбратьИзМеню_КонтурEDI("ОбработчикВыбораЗапрашиваемоеДействие", ЭтаФорма, , Поле.СписокВыбора, Поле);
			
		ИначеЕсли ИмяКолонки = "ТоварыПричинаВозврата" Тогда 
			
			СтандартнаяОбработка = Ложь;
			МодульОбъектаКлиент().ВыбратьИзМеню_КонтурEDI("ОбработчикВыбораПричинаВозврата", ЭтаФорма, , Поле.СписокВыбора, Поле);
			
		ИначеЕсли ИмяКолонки = "ТоварыРешениеПоВозврату" Тогда
			
			СтандартнаяОбработка = Ложь;
			МодульОбъектаКлиент().ВыбратьИзМеню_КонтурEDI("ОбработчикВыбораРешенияПоВозврату", ЭтаФорма, , Поле.СписокВыбора, Поле);
			
		ИначеЕсли ДоступенВыборИзМенюОсобенностиТоваров(Поле, ПутьКДаннымКолонки) Тогда // здесь должны быть только особенности, но проверим на всякий случай
			
			СтандартнаяОбработка = Ложь;
			
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ИмяКолонки", ИмяКолонки);
			МодульОбъектаКлиент().ВыбратьИзМеню_КонтурEDI("ОбработчикВыбораОсобенностиТоваров", ЭтаФорма, ДопПараметры, Поле.СписокВыбора, Поле);
			
		ИначеЕсли Элемент.ТекущиеДанные <> Неопределено
			И ТипЗнч(Элемент.ТекущиеДанные[ПутьКДаннымКолонки]) = Тип("СписокЗначений")
			И ЗначениеЗаполнено(Поле.ОграничениеТипа) Тогда
			
			Элемент.ТекущиеДанные[ПутьКДаннымКолонки].ТипЗначения = Поле.ОграничениеТипа;

		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДоступенВыборИзМенюОсобенностиТоваров(Поле, ПутьКДаннымКолонки)
	
	Результат = МодульОбъектаКлиент().ПеременнаяСодержитСвойство(Поле, "СписокВыбора",, Истина)
										И ИдентификаторыОсобенностейСообщения.НайтиПоЗначению(ПутьКДаннымКолонки) <> Неопределено 
										И Поле.РедактированиеТекста = Ложь;
										
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуКодовМаркировки(НомерСтроки, ИмяКолонки = "КодыМаркировки") Экспорт
	
	ПараметрыФормы = ПолучитьПараметрыФормыКодовМаркировки(ИмяКолонки);
	ПараметрыФормы.СтрокаПозиционирования = НомерСтроки;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИмяКолонкиКодовМаркировки", ИмяКолонки);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сервис_КодыМаркировкиУправляемая",
												 ,
												 ПараметрыФормы,
												 ЭтаФорма,
												 "ОбработчикЗакрытияФормыКодовМаркировки",
												 ЭтаФорма,
												 ПараметрыОповещения);

	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормыКодовМаркировки(ИмяКолонки = "КодыМаркировки")
	
	ПараметрыФормы = МодульОбъекта().СтруктураПараметровФормыПросмотраКодовМаркировки();
	ПараметрыФормы.КодыМаркировкиОтредактированыВручную = Ложь;
	ПараметрыФормы.ИмяКолонкиКодовВСообщении = ИмяКолонки;
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	ДеревоУпаковок = РеквизитФормыВЗначение("ТранспортныеУпаковки");

	ПараметрыФормы.АдресКодовМаркировкиТоваров = ПоместитьТаблицуКодовМаркировкиВсехТоваровНаСервере(Истина, ИмяКолонки);
	ПараметрыФормы.АдресДереваУпаковок = ПоместитьВоВременноеХранилище(ДеревоУпаковок, ЭтаФорма.УникальныйИдентификатор);
	ПараметрыФормы.АдресСообщения = ПоместитьКопиюСообщенияВВХ();
	
	Если МодульОбъекта().ПеременнаяСодержитСвойство(Сообщение, "КодыМаркировкиОтредактированыВручную") Тогда
		ПараметрыФормы.КодыМаркировкиОтредактированыВручную = Сообщение.КодыМаркировкиОтредактированыВручную;
	КонецЕсли;
	
	ТолькоПросмотрКодов = Истина;
		
	Если Не ТолькоПросмотрСообщения 
		И Не Сообщение.Направление = "Входящее" Тогда
			
		ТолькоПросмотрКодов = Ложь;
			
	КонецЕсли;
	
	ПараметрыФормы.ТолькоПросмотр = ТолькоПросмотрКодов;
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикЗакрытияФормыКодовМаркировки(РезультатЗакрытия, ДопПараметры = Неопределено) Экспорт
	
	Если Не РезультатЗакрытия = Неопределено Тогда
		
		ИмяКолонкиКодовМаркировки = "КодыМаркировки";
		
		Если ЗначениеЗаполнено(ДопПараметры) И ДопПараметры.Свойство("ИмяКолонкиКодовМаркировки") Тогда
			ИмяКолонкиКодовМаркировки = ДопПараметры.ИмяКолонкиКодовМаркировки;
		КонецЕсли;
		
		ОбработатьРезультатРедактированияКодовМаркировки(РезультатЗакрытия, ИмяКолонкиКодовМаркировки);
		ЗаполнитьПредставлениеКодовМаркировкиТранспортныхУпаковок(ТранспортныеУпаковки, ТолькоПросмотрСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатРедактированияКодовМаркировки(РезультатРедактирования, КолонкаКодовМаркировки = "КодыМаркировки")
	
	ТаблицаТоваров = РеквизитФормыВЗначение("Товары");
	ТаблицаТранспортныхУпаковок = РеквизитФормыВЗначение("ТранспортныеУпаковки");
	
	Если ТипЗнч(РезультатРедактирования) = Тип("Структура") Тогда
		Сообщение.Вставить("КодыМаркировкиОтредактированыВручную", РезультатРедактирования.КодыМаркировкиОтредактированыВручную);
		РазвернутаяТаблицаКодов = РезультатРедактирования.РазвернутаяТаблицаКодовМаркировки;
	Иначе
		РазвернутаяТаблицаКодов = РезультатРедактирования;
	КонецЕсли;
	
	Для каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		СтрокаТоваров[КолонкаКодовМаркировки].Очистить();
	КонецЦикла;
	
	Для каждого СтрокаУпаковки Из ТаблицаТранспортныхУпаковок.Строки Цикл
		Для каждого СтрокаТовара Из СтрокаУпаковки.Строки Цикл
			СтрокаТовара[КолонкаКодовМаркировки].Очистить();
		КонецЦикла;
	КонецЦикла;
	
	Для каждого ЗаписьРезультата Из РазвернутаяТаблицаКодов Цикл
		
		СтрокаТоваров = ТаблицаТоваров.Найти(ЗаписьРезультата.НомерСтроки, "НомерСтроки");
		Если Не СтрокаТоваров = Неопределено Тогда
			СтрокаТоваров[КолонкаКодовМаркировки].Добавить(ЗаписьРезультата.КодМаркировки, ЗаписьРезультата.ВидКодаМаркировки);
		КонецЕсли;
		
		ОтборСтрокТранспортныхУпаковок = Новый Структура;
		ОтборСтрокТранспортныхУпаковок.Вставить("НомерУпаковки", ЗаписьРезультата.НомерУпаковки);
		ОтборСтрокТранспортныхУпаковок.Вставить("НомерСтроки",ЗаписьРезультата.НомерСтроки);
		
		СтрокиТоваровУпаковок = ТаблицаТранспортныхУпаковок.Строки.НайтиСтроки(ОтборСтрокТранспортныхУпаковок,Истина);
		
		Для каждого СтрокаТовара Из СтрокиТоваровУпаковок Цикл
			СтрокаТовара.КодыМаркировки.Добавить(ЗаписьРезультата.КодМаркировки, ЗаписьРезультата.ВидКодаМаркировки);
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		СтрокаТовара[КолонкаКодовМаркировки + "Представление"]= МодульОбъекта().ПредставлениеКодовМаркировки(СтрокаТовара[КолонкаКодовМаркировки]);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаТоваров, "Товары");
	ЗначениеВРеквизитФормы(ТаблицаТранспортныхУпаковок, "ТранспортныеУпаковки");
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	ПеренестиПоля1СвСообщение(Сообщение);
	
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов(); 
	
	Сообщение.СодержитОшибки = НЕ ПроверитьЗаполнениеПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораОсобенностиТоваров(ВыбранноеЗначение, ДопПараметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = Неопределено
		ИЛИ ДопПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ИмяКолонки = Сред(ДопПараметры.ИмяКолонки, 7);
	ТекДанные[ИмяКолонки] =  ВыбранноеЗначение.Значение;
	ПеренестиОсобенностиИПерепроверитьСообщение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораПричинаВозврата(ВыбранноеЗначение, Параметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.ПричинаВозврата = ВыбранноеЗначение.Представление;
	ОбработчикВыбораПричинаВозвратаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораРешенияПоВозврату(ВыбранноеЗначение, Параметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.РешениеПоВозврату = ВыбранноеЗначение.Значение;
	ТекДанные.Количество 		= ?(ТекДанные.РешениеПоВозврату = "В возврате отказано", 0, ТекДанные.КоличествоПредложеноКВозврату);
	ОбработчикВыбораРешенияПоВозвратуСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбработчикВыбораПричинаВозвратаСервер()
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	ВремТовары = РеквизитФормыВЗначение("Товары");
	Сообщение.Товары.ЗагрузитьКолонку(ВремТовары.ВыгрузитьКолонку("ПричинаВозврата"), "ПричинаВозврата");
	
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	Сообщение.СодержитОшибки = НЕ ПроверитьЗаполнениеПолей();
	
КонецПроцедуры

&НаСервере
Процедура ОбработчикВыбораРешенияПоВозвратуСервер()
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	ВремТовары = РеквизитФормыВЗначение("Товары");
	Сообщение.Товары.ЗагрузитьКолонку(ВремТовары.ВыгрузитьКолонку("РешениеПоВозврату"), "РешениеПоВозврату");
	Сообщение.Товары.ЗагрузитьКолонку(ВремТовары.ВыгрузитьКолонку("Количество"), 		"Количество");
	
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	Сообщение.СодержитОшибки = НЕ ПроверитьЗаполнениеПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораЗапрашиваемоеДействие(ВыбранноеЗначение, Параметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.ЗапрашиваемоеДействие = ВыбранноеЗначение.Представление;
	ОбработчикВыбораЗапрашиваемоеДействиеСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбработчикВыбораЗапрашиваемоеДействиеСервер()
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	ВремТовары = РеквизитФормыВЗначение("Товары");
	Сообщение.Товары.ЗагрузитьКолонку(ВремТовары.ВыгрузитьКолонку("ЗапрашиваемоеДействие"), "ЗапрашиваемоеДействие");
	
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	Сообщение.СодержитОшибки = НЕ ПроверитьЗаполнениеПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеИнтерактивнойНастройкиСоответствий(ВыбранноеЗначение, Параметры) Экспорт
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ИдентификаторТекСтроки = ТекСтрока.ПолучитьИдентификатор();
	
	ОбработчикПослеИнтерактивнойНастройкиСоответствийСервер(ИдентификаторТекСтроки);
	
	ЗаполнитьТоварнуюГруппуТаблицыТоваровВызовСервера();
		
КонецПроцедуры

&НаСервере
Процедура ОбработчикПослеИнтерактивнойНастройкиСоответствийСервер(ИдентификаторТекСтроки)
	
	ВыбраннаяСтрока = Товары.НайтиПоИдентификатору(ИдентификаторТекСтроки);
	ИдентификаторыТовара = ПолучитьСтруктуруИдентификаторовТовара(ВыбраннаяСтрока, Сообщение.ТипСообщения, КтоМы);
	
	РезультатПолученияСоответствий = 
	МодульОбъекта().НайтиВозможныеСоответствияТовара_ВходящееСообщение(
	ИдентификаторыТовара.GTIN, 
	ИдентификаторыТовара.КодТовараПартнера, 
	ИдентификаторыТовара.КодЕдиницыИзмеренияEDI,
	Сообщение.Партнер);
	
	СоответствиеТоваров = РезультатПолученияСоответствий.ТаблицаСоответствий;
	
	Если НЕ ЗначениеЗаполнено(ВыбраннаяСтрока.Номенклатура) Тогда
				
		УстановитьОсновноеСоответствиеВСтрокуТоваров(ВыбраннаяСтрока, СоответствиеТоваров); 
		
	Иначе
		
		ПоискУстановленногоСоответствия = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,КоэффициентEDIВ1С");
		ЗаполнитьЗначенияСвойств(ПоискУстановленногоСоответствия, ВыбраннаяСтрока);
		
		НайденныеСоответствия = СоответствиеТоваров.НайтиСтроки(ПоискУстановленногоСоответствия);
		
		Если НайденныеСоответствия.Количество() = 0 Тогда
			
			ВыбраннаяСтрока.Номенклатура = Неопределено;
			ВыбраннаяСтрока.ХарактеристикаНоменклатуры = Неопределено;
			ВыбраннаяСтрока.ЕдиницаИзмерения = Неопределено;
			ВыбраннаяСтрока.КоэффициентEDIВ1С = 0;      			
			
			УстановитьОсновноеСоответствиеВСтрокуТоваров(ВыбраннаяСтрока, СоответствиеТоваров);
			
		КонецЕсли;
		
	КонецЕсли;
		
	ПроверитьЗаполнениеПолей();
	
	//дозаполним код, артикул, ПолноеНаименование
	ДозаполнитьАртикулКодПолноеНаименованиеТЧТовары();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОсновноеСоответствиеВСтрокуТоваров(Знач ВыбраннаяСтрока, Знач СоответствиеТоваров)
	
	Перем ЗаполняемыеСвойства, СтрокаСоответствий, ТекстПересчета;
	
	Для Каждого СтрокаСоответствий Из СоответствиеТоваров Цикл
		
		Если СтрокаСоответствий.ПолеНесоответствия = Неопределено Тогда
			
			ЗаполняемыеСвойства = "Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, КоэффициентEDIВ1С, ТипЕдиницы";
			ЗаполнитьЗначенияСвойств(ВыбраннаяСтрока, СтрокаСоответствий, ЗаполняемыеСвойства);
			
			ТекстПересчета = МодульОбъекта().ТекстПересчета_КонтурEDI(СтрокаСоответствий.ЕдиницаИзмерения, СтрокаСоответствий.ЕдиницаEDI, СтрокаСоответствий.КоэффициентEDIВ1С);
			
			ВыбраннаяСтрока.ТекстПересчета = ТекстПересчета;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСоответствияИзМеню(ВыбранноеЗначение, ДопПараметры) Экспорт//!
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		Если ВыбранноеЗначение.Значение = "Настроить соответствие товаров" Тогда
			
			ОткрытьНоменклатура_ЭлементУправляемая(); 
						
		Иначе
			
			СтруктураТовара = ВыбранноеЗначение.Значение;
			
			ЗаполнитьЗначенияСвойств(Элементы.Товары.ТекущиеДанные,СтруктураТовара,"Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,КоэффициентEDIВ1С,ТипЕдиницы,ТекстПересчета");
			
			ОчиститьСообщения();//на рефакторинг - перетащить к пометкам
			ПроверитьЗаполнениеПолей();
			
			//дозаполним код, артикул, ПолноеНаименование
			ДозаполнитьАртикулКодПолноеНаименованиеТЧТовары();
			
			ЗаполнитьТоварнуюГруппуТаблицыТоваровВызовСервера();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНоменклатура_ЭлементУправляемая()
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ИдентификаторыТовара = ПолучитьСтруктуруИдентификаторовТовара(ТекСтрока, Сообщение.ТипСообщения, КтоМы);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Партнер", Отправитель1С);
	ПараметрыФормы.Вставить("Наименование", ТекСтрока.Наименование);
	ПараметрыФормы.Вставить("GTIN", ИдентификаторыТовара.GTIN);
	ПараметрыФормы.Вставить("КодТовараПартнера", ИдентификаторыТовара.КодТовараПартнера);
	ПараметрыФормы.Вставить("КодТовараВнутренний", ИдентификаторыТовара.КодТовараВнутренний);
	ПараметрыФормы.Вставить("КодЕдиницыИзмеренияEDI", ТекСтрока.КодЕдиницыИзмеренияEDI);
	
	Если ЗначениеЗаполнено(ТекСтрока.ТипЕдиницы) Тогда
		ПараметрыФормы.Вставить("ТипЕдиницы", ТекСтрока.ТипЕдиницы);
	КонецЕсли;
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Номенклатура_ЭлементУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослеИнтерактивнойНастройкиСоответствий", ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварнуюГруппуТаблицыТоваровВызовСервера()

	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ЗаполнитьТоварнуюГруппуТаблицыТоваров",,Новый Структура("Сообщение,Товары",Сообщение,Товары));

КонецПроцедуры // ЗаполнитьТоварнуюГруппуТаблицыТоваровВызовСервера()


&НаКлиенте
Процедура ОбработчикПослеВводаДаты(ВыбраннаяДата, ПараметрыЗакрытия) Экспорт
	Если НЕ ВыбраннаяДата = Неопределено Тогда
		
		//+для АТАК
		Если Сообщение.Свойство("ДатаПоставкиФактическая") Тогда
			ДатаПоставкиФактическая = ВыбраннаяДата;
			Сообщение.ДатаПоставкиФактическая = ВыбраннаяДата;
			Элементы.ПредставлениеДатыПоставки.Заголовок = МодульОбъектаКлиент().ПолучитьПредставлениеДатыПоставки_КонтурEDI(Сообщение.ДатаПоставкиФактическая);
		КонецЕсли;
		//-
			
		Если Сообщение.ТипСообщения = "ORDRSP" 
			И Не ВыбраннаяДата = Сообщение.ДатаПоставки
			И ЗначениеЗаполнено(Сообщение.ДокументСсылка) Тогда
			ДополнитьТаблицуИзмененныхРеквизитов("ДатаПоставки", ВыбраннаяДата);
			ПерезаполнитьИсходящееСообщение();
		Иначе	
			ДатаПоставки = ВыбраннаяДата;
			Сообщение.ДатаПоставки = ВыбраннаяДата;
			Элементы.ПредставлениеДатыПоставки.Заголовок = МодульОбъектаКлиент().ПолучитьПредставлениеДатыПоставки_КонтурEDI(Сообщение.ДатаПоставки);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоставитьСписокВыбораПоСтрокеТоваровСервер(GTIN, КодТовараПартнера, КодЕдиницыИзмеренияEDI, Партнер)
	
	СписокВыбора = МодульОбъекта().СоставитьСписокВыбораСоответствийПоТовару(GTIN, КодТовараПартнера, КодЕдиницыИзмеренияEDI, Партнер);
	Возврат СписокВыбора;
	
КонецФункции

&НаКлиенте
Процедура ТоварыНеЗагружатьПриИзменении(Элемент)
		ПроверитьЗаполнениеПолей();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДействиеДатаПоставкиНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ВыбраннаяДата = ДокументДата;
	Если ЗначениеЗаполнено(НакладнаяДата) Тогда
		ВыбраннаяДата = НакладнаяДата;
	ИначеЕсли ЗначениеЗаполнено(ПриемкаДата) Тогда
		ВыбраннаяДата = ПриемкаДата;
	КонецЕсли;
	
	Подсказка = "Укажите дату поставки";
	ЧастьДаты = ЧастиДаты.ДатаВремя;
	
	Если Параметры.МодальностьЗапрещена Тогда
		Оповещение = Неопределено;
		Выполнить("Оповещение = Новый ОписаниеОповещения(""ОбработчикПослеВводаДаты"",ЭтаФорма, Параметры)");
		Выполнить("ПоказатьВводДаты(Оповещение, ВыбраннаяДата, Подсказка, ЧастьДаты)");
	Иначе
		Если ВвестиДату(ВыбраннаяДата,Подсказка,ЧастьДаты) Тогда 			
			ОбработчикПослеВводаДаты(ВыбраннаяДата, Неопределено);

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьТаблицуИзмененныхРеквизитов(Наименование, Значение)

	//проверим наличие добавляемого реквизита в таблице
	ОтборСтрок = Новый Структура("Наименование",Наименование);
	
	НайденныеСтроки = ТаблицаИзмененныхРеквизитов.НайтиСтроки(ОтборСтрок);
	//НайденнаяСтрока = ТаблицаИзмененныхРеквизитов.Найти(Наименование, "Наименование");
	Если НайденныеСтроки.Количество() = 0 Тогда
		НовыйРеквизит = ТаблицаИзмененныхРеквизитов.Добавить();
		НовыйРеквизит.Наименование  = Наименование;
		НовыйРеквизит.Значение		= Значение;		
	Иначе
		Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
			НайденнаяСтрока.Значение	= Значение;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьСтатусДляФормированияДействий(Сообщение)

	СтатусДляФормированияДействий = "";
	Если Сообщение.Свойство("Статус") Тогда
		Если НЕ (ВРег(Сообщение.Статус) = "REPLACE" И Не ЗначениеЗаполнено(Сообщение.ДокументСсылка)) Тогда
			 СтатусДляФормированияДействий = Сообщение.Статус;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтатусДляФормированияДействий;

КонецФункции // ОпределитьСтатусДляФормированияДействий() 

&НаСервере
Процедура ПерезаполнитьИсходящееСообщение()
	
	ПараметрыПерезаполнения = Новый Структура("ИзмененныеРеквизиты", ПодготовитьСтруктуруИзмененныхРеквизитов());
	
	ПереотправляемоеСообщениеСсылка = Неопределено;
	Сообщение.Свойство("ПереотправляемоеСообщениеСсылка",ПереотправляемоеСообщениеСсылка);
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	Если ПереотправляемоеСообщениеСсылка <> Неопределено Тогда
		ПараметрыПерезаполнения.Вставить("ПереотправляемоеСообщениеСсылка", ПереотправляемоеСообщениеСсылка);
	КонецЕсли;
	
	МодульОбъекта().АктуализироватьСообщение(Сообщение, ПараметрыПерезаполнения);
	
	Если ПереотправляемоеСообщениеСсылка<>Неопределено Тогда
		Сообщение.Вставить("ПереотправляемоеСообщениеСсылка",ПереотправляемоеСообщениеСсылка);
	КонецЕсли;
	                                                                                        
	ПолучитьПрикрепленныеСообщения();
	
	ЗаполнитьПоляНаФорме();
	
	МодульОбъекта().ЗаполнитьОсобенностиСтруктурТоваровСообщения(Товары, Сообщение);
	
	СтатусДляФормированияДействий = ОпределитьСтатусДляФормированияДействий(Сообщение);   
	
	НастройкаФормы						= МодульОбъекта().ПолучитьНастройкиФормыСообщения(Сообщение.ТипСообщения,Сообщение.Направление,СтатусДляФормированияДействий);
	НастройкаСсылокИсправленияОшибок	= МодульОбъекта().ПолучитьНастройкуВыводаСсылокНаОбъектыСообщения();
	
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();		
	НетОшибок = ПроверитьЗаполнениеПолей();	
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов(); 	
	ДозаполнитьАртикулКодПолноеНаименованиеТЧТовары();    	
		
	Если НетОшибок И ТаблицаОшибок.Количество() = 0 Тогда
		
		ЗакрытьПанельОшибокСервер();
		
		Если КтоМы = "Поставщик" Тогда
			ВывестиПанельИнформации("В этой форме вы можете проверить данные, которые будут отправлены в торговую сеть.");
		Иначе
			ВывестиПанельИнформации("В этой форме вы можете проверить данные, которые будут отправлены поставщику.");
		КонецЕсли;
		
	Иначе

		ОткрытьПанельОшибокСервер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьДокументДляПоискаСвязанныхСообщений(Знач Сообщение)
	
	ДокументСсылка = Неопределено;
	
	Если ЗначениеЗаполнено(Сообщение.Документ1С) Тогда
		ДокументСсылка = Сообщение.Документ1С;
	ИначеЕсли ЗначениеЗаполнено(Сообщение.Заказ1С) Тогда
		ДокументСсылка = Сообщение.Заказ1С;
	ИначеЕсли ЗначениеЗаполнено(Сообщение.Накладная1С) Тогда
		ДокументСсылка = Сообщение.Накладная1С;
	ИначеЕсли ЗначениеЗаполнено(Сообщение.Приемка1С) Тогда
		ДокументСсылка = Сообщение.Приемка1С;
	ИначеЕсли ЗначениеЗаполнено(Сообщение.СчетФактура1С) Тогда
		ДокументСсылка = Сообщение.СчетФактура1С;
	КонецЕсли;
	
	Возврат ДокументСсылка;
	
КонецФункции

&НаКлиенте
Процедура НайтиСвязанныеСообщения(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ДокументСсылка = ОпределитьДокументДляПоискаСвязанныхСообщений(Сообщение);
	
	Если ДокументСсылка = Неопределено Тогда
		ТекстПредупреждения = "Не найден документ 1С для поиска связанных сообщений";
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументСсылка",		ДокументСсылка);
	ПараметрыФормы.Вставить("СообщениеСсылка",		Сообщение.СообщениеСсылка);
	ПараметрыФормы.Вставить("МодальностьЗапрещена",	Параметры.МодальностьЗапрещена);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сервис_СвязанныеСообщенияУправляемая", , ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Документ1СНажатие(Элемент, СтандартнаяОбработка)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	ОткрытьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура НадписьОткрытьДокументНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	ОткрытьДокумент();
КонецПроцедуры   

&НаКлиенте
Процедура ОткрытьДокумент()
	Если ЗначениеЗаполнено(Документ1С) Тогда
		МодульОбъектаКлиент().ОткрытьФормуЗначения_КонтурEDI(Документ1С, "ОбработкаЗакрытияДокумента1С_КонтурEDI", ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияДокумента1С_КонтурEDI(ОсновныеПараметры, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Сообщение.Направление = "Исходящее" И НЕ ЗначениеЗаполнено(Сообщение.СообщениеСсылка) Тогда
		ПерезаполнитьИсходящееСообщение();  
	КонецЕсли;

КонецПроцедуры    

&НаКлиенте
Процедура ДействиеЮрФизЛицоСтороннееНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если КтоМы = "Поставщик" Тогда
		ОткрытьФормуКонтрагента("Покупатель");
	Иначе
		ОткрытьФормуКонтрагента("Продавец");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДействиеЮрФизЛицоСвоеНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если КтоМы = "Поставщик" Тогда
		ОткрытьФормуКонтрагента("Продавец");
	Иначе
		ОткрытьФормуКонтрагента("Покупатель");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтрагента(ИмяПоляСообщения)
	
	АдресСообщенияВВХ = ПоместитьКопиюСообщенияВВХ(); //сервер
	
	//открыть форму
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("АдресСообщенияВВХ",	АдресСообщенияВВХ);
	ПараметрыФормы.Вставить("ИмяПоляСообщения",		ИмяПоляСообщения);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ФормаКонтрагентаУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослеЗакрытияКарточкиКонтрагента", ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьКопиюСообщенияВВХ()

	АдресВВХ = Неопределено;
	
	КопияСообщения = МодульОбъекта().ПолучитьКопиюСообщения(Сообщение);
	АдресВВХ = ПоместитьВоВременноеХранилище(КопияСообщения, ЭтаФорма.УникальныйИдентификатор);
	
	Возврат АдресВВХ;	

КонецФункции // ПоместитьКопиюСообщенияВВХ()

&НаКлиенте
Процедура ОбработчикПослеЗакрытияКарточкиКонтрагента(Результат=Неопределено,ДопПараметр=Неопределено) Экспорт

	Если Результат<>Неопределено и Результат.Свойство("Успешно") и Результат.Успешно = Истина Тогда
		
		Сообщение = ПолучитьИзВременногоХранилища(Результат.АдресВВХСообщения);	
		
		ЭтаФорма[Результат.ИмяПоля+"1С"] = Результат.ЮрФизЛицо1С;
		
		Если Сообщение.Направление = "Исходящее" Тогда
			
			Сообщение[Результат.ИмяПоля+"EDI"] = Результат.ЮрФизЛицо;
			
		Иначе
			Сообщение[Результат.ИмяПоля+"1С"] = Результат.ЮрФизЛицо1С;
			
			Если КтоМы = "Поставщик" Тогда
				Если Результат.ИмяПоля = "Грузоотправитель"
					И (Сообщение.ТипСообщения = "RETDES" 
					ИЛИ Сообщение.ТипСообщения = "RETREC"
					ИЛИ Сообщение.ТипСообщения = "RETANN") Тогда
					
					Сообщение.ТочкаДоставки = Результат.ЮрФизЛицо1С;
					
				ИначеЕсли Результат.ИмяПоля = "Грузополучатель" Тогда
					Сообщение.ТочкаДоставки = Результат.ЮрФизЛицо1С;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		ПроверитьЗаполнениеПолей();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеГрузополучательНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ОткрытьФормуКонтрагента("Грузополучатель");
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеГрузоотправительНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	ОткрытьФормуКонтрагента("Грузоотправитель");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОбратныйЗаказ(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеКонтактыНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ПредставлениеКонтакты = Элементы.ПредставлениеКонтакты.Заголовок;
	
	СтруктураПараметров	= Новый Структура;
	СтруктураПараметров.Вставить("Заголовок"			, "Контакты по заказу");
	СтруктураПараметров.Вставить("ПодробнаяИнформация"	, ПредставлениеКонтакты);
		
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сервис_ПодробнаяИнформация_Управляемая", , СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеКонтактногоЛицаПоЗаказу()
	Возврат МодульОбъекта().ПолучитьПредставлениеКонтактногоЛицаПоЗаказу(Сообщение);
КонецФункции

//sscc -------------------------------------------------------------------------------

//обработчики таблицы "Товарные позиции"

&НаКлиенте
Процедура ТоварныеПозицииВыбор(Элемент, ВыбраннаяСтрокаИдентификатор, Поле, СтандартнаяОбработка)
	
	Если ТолькоПросмотрСообщения ИЛИ Сообщение.Направление = "Входящее" Тогда
		Возврат;
	КонецЕсли;
	
	Значение = Новый Массив;
	
	ТипВыбраннаяСтрокаИдентификатор = ТипЗнч(ВыбраннаяСтрокаИдентификатор);
	
	Если ТипВыбраннаяСтрокаИдентификатор = Тип("Массив") Тогда
		
		Для Каждого СтрокаВыбранная Из ВыбраннаяСтрокаИдентификатор Цикл
			
			Значение.Добавить(ТоварныеПозиции.НайтиПоИдентификатору(СтрокаВыбранная));
			
		КонецЦикла;
		
	ИначеЕсли ТипВыбраннаяСтрокаИдентификатор = Тип("Число") Тогда
		
		Значение.Добавить(ТоварныеПозиции.НайтиПоИдентификатору(ВыбраннаяСтрокаИдентификатор));
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
		
	ПараметрыПеретаскивания = Новый Структура;
	ПараметрыПеретаскивания.Вставить("Действие",			ДействиеПеретаскивания.Перемещение);
	ПараметрыПеретаскивания.Вставить("ДопустимыеДействия",	ДопустимыеДействияПеретаскивания.КопированиеИПеремещение);
	ПараметрыПеретаскивания.Вставить("Значение",			Значение);
	
	СтрокаТранспортнойУпаковки = Неопределено;
	Если Не Элементы.ТранспортныеУпаковки.ТекущаяСтрока = Неопределено Тогда
		СтрокаТранспортнойУпаковки 	= ТранспортныеУпаковки.НайтиПоИдентификатору(Элементы.ТранспортныеУпаковки.ТекущаяСтрока);
	КонецЕсли;
	КолонкаТранспортнойУпаковки	= Элементы.ТранспортныеУпаковки.ПодчиненныеЭлементы.ТранспортныеУпаковкиСоставУпаковки;
	
	ТранспортныеУпаковкиПеретаскивание(Элементы.ТоварныеПозиции, ПараметрыПеретаскивания, Истина, СтрокаТранспортнойУпаковки, КолонкаТранспортнойУпаковки)	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныеПозицииПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		Возврат;	
	КонецЕсли;
	
	ПеретаскиваемаяСтрока = ПараметрыПеретаскивания.Значение[0];
	Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("Число") Тогда
		ПеретаскиваемаяСтрока = ТоварныеПозиции.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение[0]);
	КонецЕсли; 
	
	ВнутреннееПеретаскивание = ПеретаскиваемаяСтрока.Свойство("Номенклатура");
	
	Если ВнутреннееПеретаскивание Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли;
	
	Если СообщениеСодержитДанныеОбУпаковках Тогда
		СтандартнаяОбработка = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварныеПозицииПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если НЕ ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		Возврат;	
	КонецЕсли;
	
	Для Каждого Строка Из ПараметрыПеретаскивания.Значение Цикл
		УдалитьСтрокуТранспортнойУпаковки(Строка);
	КонецЦикла;
	
	ОбновитьДанныеРазмещения("ТоварныеПозицииПеретаскивание");
		
КонецПроцедуры

//обработчики таблицы "Транспортные упаковки"

&НаКлиенте
Процедура ТранспортныеУпаковкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	ЭтоТранспортнаяУпаковка = ТипыТранспортныхУпаковок.Свойство("Код" + ТекДанные.ТипУпаковки);
	
	Если ТолькоПросмотрСообщения ИЛИ Сообщение.Направление = "Входящее" Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ТранспортныеУпаковкиСоставУпаковки" И Поле.Доступность Тогда
		
		Строка = ТранспортныеУпаковки.НайтиПоИдентификатору(Элементы.ТранспортныеУпаковки.ТекущаяСтрока);
		
		Если ЗначениеЗаполнено(Строка.ТипУпаковки) Тогда
			
			ИзменитьSSCCКодТранспортнойУпаковки(Строка);
			
		Иначе
			
			УдалитьСтрокуТранспортнойУпаковки(Строка);
			ОбновитьДанныеРазмещения("ТранспортныеУпаковкиВыбор");
			
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ТранспортныеУпаковкиКоличество" 
		И ЭтоТранспортнаяУпаковка Тогда
		
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли НЕ ЭтоТранспортнаяУпаковка 
		И НЕ (Поле.Имя = "ТранспортныеУпаковкиКоличество" 
		ИЛИ Поле.Имя = "ТранспортныеУпаковкиДопИдентификатор") Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция КоличествоТоваровРазмещенныхВУпаковке(КоллекцияТоваровУпаковки)
	
	ОбщееКоличество = 0;
	
	Для каждого Товар Из КоллекцияТоваровУпаковки Цикл
		ОбщееКоличество = ОбщееКоличество + Товар.Количество;
	КонецЦикла;
		
	Возврат ОбщееКоличество;
	
КонецФункции

&НаКлиенте
Функция ПодготовитьМассивКодовМаркировкиТоваровУпаковки(ИдентификаторСтрокиУпаковки)

	Результат = Новый Массив;
		
	ВыбраннаяУпаковка = ТранспортныеУпаковки.НайтиПоИдентификатору(ИдентификаторСтрокиУпаковки);
	ПодчиненныеСтроки = ВыбраннаяУпаковка.ПолучитьЭлементы();
	
	Для каждого Элемент Из ПодчиненныеСтроки Цикл
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("НомерСтрокиТовара", Элемент.НомерСтроки);	
		СтруктураСтроки.Вставить("КодыМаркировки"	, Элемент.КодыМаркировки);	
		
		Результат.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораКодовМаркировкиТранспортныхУпаковок(РезультатВыбора, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(РезультатВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	ПослеВыбораКодовМаркировкиТранспортныхУпаковокСервер(РезультатВыбора, ДопПараметры.НомерУпаковки);
	ЗаполнитьПредставлениеКодовМаркировкиТранспортныхУпаковок(ТранспортныеУпаковки, ТолькоПросмотрСообщения);
	РазвернутьВсеУровниТранспортныхУпаковок();
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораКодовМаркировкиТранспортныхУпаковокСервер(РезультатВыбора, НомерУпаковки)
	
	ДеревоТранспортныхУпаковок = РеквизитФормыВЗначение("ТранспортныеУпаковки");
	
	ВыбранныеКодыМаркировки = РезультатВыбора.ВыбранныеКодыМаркировки;
	ПеренесенныеКодыМаркировки = РезультатВыбора.ПеренесенныеКодыМаркировки;
	
	ТекущаяУпаковка = ДеревоТранспортныхУпаковок.Строки.Найти(НомерУпаковки, "НомерУпаковки");
	
	Для каждого ЭлементВыбора Из ВыбранныеКодыМаркировки Цикл
		
		ТоварУпаковки = ТекущаяУпаковка.Строки.Найти(ЭлементВыбора.НомерСтрокиТовара, "НомерСтроки");
		ТоварУпаковки.КодыМаркировки = ЭлементВыбора.КодыМаркировки;
	
	КонецЦикла;
	
	Для каждого ЭлементПереноса Из ПеренесенныеКодыМаркировки Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("НомерУпаковки", ЭлементПереноса.НомерУпаковки);
		СтруктураПоиска.Вставить("НомерСтроки", ЭлементПереноса.НомерСтрокиТовара);
		
		ВключатьПодчиненные = Истина;
		НайденныеСтроки = ДеревоТранспортныхУпаковок.Строки.НайтиСтроки(СтруктураПоиска, ВключатьПодчиненные);
		
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			
			НайденноеЗначение = НайденныеСтроки[0].КодыМаркировки.НайтиПоЗначению(ЭлементПереноса.КодМаркировки);
			Если НайденноеЗначение <> Неопределено Тогда
				НайденныеСтроки[0].КодыМаркировки.Удалить(НайденноеЗначение);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;

	ЗначениеВРеквизитФормы(ДеревоТранспортныхУпаковок, "ТранспортныеУпаковки");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьSSCCКодТранспортнойУпаковки(Строка)
	
	Если Не ЗначениеЗаполнено(Строка.SSCC) Тогда
		
		ТекстПредупреждения = "Выбранной упаковке еще не был назначен SSCC-код.
							  |Редактирование невозможно.";
	
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
		Возврат;
		
	КонецЕсли;
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("Да");
	СписокКнопок.Добавить("Отмена");
	
	ТекстВопроса = "Редактировать SSCC-код упаковки """ + Строка.СоставУпаковки + """?";
	ИмяОбработчика = "ПослеВопросаРедактированияSSCС";
	ПараметрыОбработчика = Новый Структура("Строка", Строка);	
	МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика, ЭтаФорма, ПараметрыОбработчика, ТекстВопроса, СписокКнопок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаРедактированияSSCС(РезультатВопроса, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВопроса = "Да" Тогда
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить("Да");
		СписокКнопок.Добавить("Отмена");
		
		ТекстВопроса = "Самостоятельное изменение SSCC-кода может привести к проблемам в учёте и работе с сетью.
						|
						|Продолжить редактирование?
						|Изменение фиксируется в журнале регистрации.";
		ИмяОбработчика = "ПослеУточненияРедактированияSSCС";
		ПараметрыОбработчика = Новый Структура("Строка", ДополнительныеПараметры.Строка);	
		МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика, ЭтаФорма, ПараметрыОбработчика, ТекстВопроса, СписокКнопок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУточненияРедактированияSSCС(РезультатВопроса, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВопроса = "Да" Тогда
		
		ЗапросНаВводНовогоSSCC(ДополнительныеПараметры.Строка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросНаВводНовогоSSCC(Строка)
	
	ПараметрыОбработчика = Новый Структура("Строка", Строка);
	ТекстПодсказки = "Введите SSCC-код...";
	ДлинаСтроки = 18;
	
	СтарыйSSCC = Строка(Строка.SSCC);
	
	МодульОбъектаКлиент().ПоказатьВводСтроки_КонтурEDI("ОбработчикВводаИзмененияSSCC", ЭтаФорма, ПараметрыОбработчика, СтарыйSSCC, ТекстПодсказки, ДлинаСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВводаИзмененияSSCC(НовыйSSCC, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если ЗначениеЗаполнено(НовыйSSCC) И НовыйSSCC <> ДополнительныеПараметры.Строка.SSCC Тогда
		
		РезультатВалидации = ВалидироватьSSCCКодСервер(НовыйSSCC);
		
		Если РезультатВалидации.Успешно = Ложь Тогда
			
			ТекстПредупреждения = РезультатВалидации.ОписаниеОшибки;
			МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
			ЗапросНаВводНовогоSSCC(ДополнительныеПараметры.Строка);
			
		Иначе
			
			СтарыйSSCC = ДополнительныеПараметры.Строка.SSCC;
			ДополнительныеПараметры.Строка.SSCC = НовыйSSCC;
			УстановитьСоставУпаковки(ДополнительныеПараметры.Строка);
			ЗаписатьИзмененияSSCКодаВЖурналРегистрации(СтарыйSSCC, НовыйSSCC)
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияSSCКодаВЖурналРегистрации(СтарыйSSCC, НовыйSSCC) 
	
	ТекстЗаписи = "" + Сообщение.ТипСообщения + " " + Сообщение.ДокументEDI.Номер + " от " + Строка(Сообщение.ДокументEDI.Дата) + 
		". Исходное значение: " + СтарыйSSCC + " изменено на значение: " + НовыйSSCC + ".";
	МодульОбъектаКлиент().ЗаписьЖурналаРегистрацииНаКлиенте_КонтурEDI("Информация", ТекстЗаписи)
	
КонецПроцедуры

&НаСервере
Функция ВалидироватьSSCCКодСервер(SSCC)
	
	ЦифраРасширения = Лев(SSCC, 1);
	
	ПараметрыКодаSSCC = МодульОбъекта().ПолучитьПараметрыКодаSSCC();
	ПараметрыКодаSSCC.ЦифраРасширения = Число(ЦифраРасширения);
	
	ДеревоТранспортныхУпаковок = РеквизитФормыВЗначение("ТранспортныеУпаковки");
	
	РезультатВалидации = МодульОбъекта().ВалидироватьКодSSCC(SSCC, ДеревоТранспортныхУпаковок, ПараметрыКодаSSCC);

	Возврат РезультатВалидации;
	
КонецФункции

&НаКлиенте
Процедура ТранспортныеУпаковкиТемпературныйРежимПриИзменении(Элемент)
	
	Элементы.ТранспортныеУпаковки.ТекущиеДанные.ТребуетсяТемпературныйРежим = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиТребуетсяТемпературныйРежимПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТранспортныеУпаковки.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекДанные.ТипУпаковки) Тогда
		ТекДанные.ТребуетсяТемпературныйРежим = Ложь;	
	КонецЕсли;
	
	Если НЕ ТекДанные.ТребуетсяТемпературныйРежим Тогда
		ТекДанные.ТемпературныйРежим = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиПередУдалением(Элемент, Отказ)
	
	//отказываемся от стандартного удаления из-за падения платформы в некоторых случаях
	Отказ = Истина;
	
	//вместо стандартного удаления рекурсивно удаляем с нижнего уровня наверх
	ВыделенныеСтрокиТранспортныеУпаковки = МодульОбъектаКлиент().ВыделенныеСтрокиТаблицыФормы_КонтурEDI(Элементы.ТранспортныеУпаковки);
	
	Количество = ВыделенныеСтрокиТранспортныеУпаковки.Количество();
	Для К = 1 По Количество Цикл
		УдалитьСтрокуТранспортнойУпаковки(ТранспортныеУпаковки.НайтиПоИдентификатору(ВыделенныеСтрокиТранспортныеУпаковки[К-1]));
	КонецЦикла;

	ОбновитьДанныеРазмещения("ТранспортныеУпаковкиПередУдалением");
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ОбновитьДанныеРазмещения("ТранспортныеУпаковкиПередОкончаниемРедактирования");
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущаяСтрока = ТранспортныеУпаковки.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
	
	НовоеКоличество = ТекущаяСтрока.Количество;
	
	//проверим не ввел ли пользователь 0
	Если НовоеКоличество = 0 И ТекущаяСтрока.ТипУпаковки = "" Тогда
		УдалитьСтрокуТранспортнойУпаковки(ТекущаяСтрока);
		ОбновитьДанныеРазмещения("ТранспортныеУпаковкиПриОкончанииРедактирования");
		Возврат;
	КонецЕсли;
	
	ОбщееКоличество 		= ПолучитьОбщееКоличествоТоварныхПозиций(ТекущаяСтрока);
	РазмещенноеКоличество   = ПолучитьРазмещенноеКоличество(ТекущаяСтрока) - НовоеКоличество;
	ДоступноеКоличество		= ОбщееКоличество - РазмещенноеКоличество;
	
	Если НовоеКоличество > ДоступноеКоличество Тогда
		ТекущаяСтрока.Количество = ДоступноеКоличество;
	Иначе
		ТекущаяСтрока.Количество = НовоеКоличество;
	КонецЕсли;
	
	ОбновитьДанныеРазмещения("ТранспортныеУпаковкиПриОкончанииРедактирования");
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если НЕ ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		Возврат;	
	КонецЕсли;
	
	пСтрока = ?(ТипЗнч(Строка)=Тип("Число"),ТранспортныеУпаковки.НайтиПоИдентификатору(Строка),Строка);
	
	СтрокаПриемник = пСтрока;
	
	//еще не добавлена ни одна упаковка
	Если ТранспортныеУпаковки.ПолучитьЭлементы().Количество() = 0 Тогда
		СтрокаПриемник = ДобавитьНовуюУпаковку();
	КонецЕсли;
	
	//пользователь разместил товарную позицию в пустое место (не попал ни в одну строку)
	Если СтрокаПриемник = Неопределено Тогда
		СтрокаПриемник = НайтиРекурсивноНижнююСтроку(ТранспортныеУпаковки.ПолучитьЭлементы());		
	КонецЕсли;
	
	СтрокаУпаковки = НайтиРекурсивноВерхнююСтроку(СтрокаПриемник);
	
	МассовоеДействие = (ПараметрыПеретаскивания.Значение.Количество() > 1);
	Для Каждого Значение Из ПараметрыПеретаскивания.Значение Цикл
		пЗначение = ?(ТипЗнч(Значение)=Тип("Число"),ТранспортныеУпаковки.НайтиПоИдентификатору(Значение),Значение);
		ПеремещениеМеждуУпаковками = пЗначение.Свойство("ТипУпаковки");
		Если ПеремещениеМеждуУпаковками Тогда
			ПереместитьТоварнуюПозицию(пЗначение, СтрокаУпаковки, МассовоеДействие);	
		Иначе
		    РазместитьТоварнуюПозицию(пЗначение, СтрокаУпаковки, МассовоеДействие);
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьДанныеРазмещения("ТранспортныеУпаковкиПеретаскивание");
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиПослеУдаления(Элемент)
	
	ОбновитьДанныеРазмещения("ТранспортныеУпаковкиПослеУдаления");
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	//заменяем переменную "Строка" на "пСтрока" = ?(ТипЗнч(Строка)=Тип("Число"),ТранспортныеУпаковки.НайтиПоИдентификатору(Строка),Строка)
	//поскольку при перетаскивании из Товарных позиций = это ДанныеФормыЭлементДерева, а в рамках Транспортных упаковок - идентификатор
		
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		Возврат;	
	КонецЕсли;
	
	пСтрока = ?(ТипЗнч(Строка)=Тип("Число"),ТранспортныеУпаковки.НайтиПоИдентификатору(Строка),Строка);
	
	ПеретаскиваемаяСтрока = ПараметрыПеретаскивания.Значение[0];
	Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("Число") Тогда
		ПеретаскиваемаяСтрока = ТранспортныеУпаковки.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение[0]);
	КонецЕсли;	
	
	ВнутреннееПеретаскивание = ПеретаскиваемаяСтрока.Свойство("ТипУпаковки");
	
	//запрещаем перетаскивание групп
	Если ВнутреннееПеретаскивание И ЗначениеЗаполнено(ПеретаскиваемаяСтрока.ТипУпаковки) Тогда                                                                                                         
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли;
	
	//запрещаем перетаскивание в свою же группу
	Если ВнутреннееПеретаскивание И Не пСтрока = Неопределено И ЗначениеЗаполнено(пСтрока.ТипУпаковки) Тогда
		Если ПеретаскиваемаяСтрока.ПолучитьРодителя() = пСтрока Тогда
			ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		КонецЕсли;                                                                                                                                
    КонецЕсли;
		
	//запрещаем перетаскивание в товар своей же группы
	Если ВнутреннееПеретаскивание И Не пСтрока = Неопределено И Не ЗначениеЗаполнено(пСтрока.ТипУпаковки) Тогда
		Если ПеретаскиваемаяСтрока.ПолучитьРодителя() = пСтрока.ПолучитьРодителя() Тогда
			ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
 
//команды страницы "Данные по упаковкам"                                                                                                                     

&НаКлиенте
Процедура ДобавитьУпаковку(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ДобавитьНовуюУпаковку();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложеннуюУпаковку(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ТекСтрока = Элементы.ТранспортныеУпаковки.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрока.ТипУпаковки) Тогда
		СтрокаПалеты = ПолучитьУпаковкуВерхнегоУровня(ТекСтрока);
		Если СтрокаПалеты.ПолучитьЭлементы().Количество() = 1 Тогда
			ТекСтрока = СтрокаПалеты.ПолучитьЭлементы()[0];
		Иначе
			ТекстПредупреждения = "Выберите строку товара для создания вложенной упаковки";
			Если Параметры.МодальностьЗапрещена = Истина Тогда
				Выполнить("ПоказатьПредупреждение(,ТекстПредупреждения)");
			Иначе
				Предупреждение(ТекстПредупреждения);
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	НоваяСтрока = ДобавитьНовуюУпаковку(ТекСтрока, ТипВложеннойУпаковки);
	ВыделитьЯчейку(НоваяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоВУпаковке(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ТекСтрока = Элементы.ТранспортныеУпаковки.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекСтрока.ТипУпаковки) Тогда
		Возврат
	КонецЕсли;
	
	ВыделитьЯчейку(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьУпаковку(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ТекСтрока = Элементы.ТранспортныеУпаковки.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено ИЛИ ТоварныеПозиции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТекСтрока.ТипУпаковки) Тогда
		КопируемаяУпаковка = ТекСтрока.ПолучитьРодителя();
	Иначе
		КопируемаяУпаковка = ТекСтрока;
	КонецЕсли;
	
	НоваяУпаковка = ДобавитьНовуюУпаковку(, , КопируемаяУпаковка);
	
	КопируемыеСтроки = КопируемаяУпаковка.ПолучитьЭлементы();
	
	// найти строки с таким товаром в ТоварныеПозиции
	Для каждого Стр Из КопируемыеСтроки Цикл
		
		НайденныеСтроки = ТоварныеПозиции.НайтиСтроки(Новый Структура("НомерСтроки", Стр.НомерСтроки));
		
		Если НЕ НайденныеСтроки.Количество() = 0 Тогда
			
			СтрокаТовар = Неопределено;
			
			Если НайденныеСтроки[0].Количество > Стр.Количество Тогда
				РазместитьТоварнуюПозицию(НайденныеСтроки[0], НоваяУпаковка, ,Стр.Количество, СтрокаТовар);
			Иначе
				РазместитьТоварнуюПозицию(НайденныеСтроки[0], НоваяУпаковка, ,НайденныеСтроки[0].Количество, СтрокаТовар);
			КонецЕсли;
			
			КопируемыеВложенныеУпаковки = Стр.ПолучитьЭлементы();
			
			Для Каждого СтрВложенная Из КопируемыеВложенныеУпаковки Цикл
				
				НоваяСтрока = ДобавитьНовуюУпаковку(СтрокаТовар, СтрВложенная.ТипУпаковки);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрВложенная);      
				
			КонецЦикла;
			
		КонецЕсли;  						
		
	КонецЦикла;
	
	ОбновитьДанныеРазмещения("СкопироватьУпаковку");
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьУпаковку(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ВыделенныеСтрокиТранспортныеУпаковки = МодульОбъектаКлиент().ВыделенныеСтрокиТаблицыФормы_КонтурEDI(Элементы.ТранспортныеУпаковки);
	
	Количество = ВыделенныеСтрокиТранспортныеУпаковки.Количество();
	Для К = 1 По Количество Цикл
		УдаляемаяСтрока = ТранспортныеУпаковки.НайтиПоИдентификатору(ВыделенныеСтрокиТранспортныеУпаковки[К-1]);
		УдалитьСтрокуТранспортнойУпаковки(УдаляемаяСтрока);
	КонецЦикла;
	
	ОбновитьДанныеРазмещения("УдалитьУпаковку");
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьПалетныйЛист(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Справка = "Палетные листы можно напечатать после сохранения или отправки уведомления об отгрузке. 
			  |
			  |Для групповой печати необходимо:
			  |		1. Закрыть карточку сообщения - перейти в основной список модуля.
			  |		2. Выделить строки с сообщениями, по которым необходимо распечатать палетные листы.
			  |		3. В верхней панели кнопок модуля нажать ""Еще"" -> ""Распечатать палетные листы"".
			  |
			  |Для печати палетных листов из карточки сообщения необходимо установить расширение 
			  |""Печать палетных листов из карточки DESADV"".
			  |Подробнее: Торговая сеть -> Настройки -> Данные об упаковках (SSCC).";
			  
 	Если Параметры.МодальностьЗапрещена = Истина Тогда
		Выполнить("ПоказатьПредупреждение(,Справка)");
	Иначе
		Предупреждение(Справка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаПеренестиВправо(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ВыделенныеСтрокиТоварныеПозиции = МодульОбъектаКлиент().ВыделенныеСтрокиТаблицыФормы_КонтурEDI(Элементы.ТоварныеПозиции);
	КоличествоВыделенныхСтрок = ВыделенныеСтрокиТоварныеПозиции.Количество();
	
	ИдентификаторыСтрок = Новый Массив;
	
	Для К = 1 По КоличествоВыделенныхСтрок Цикл
		ИдентификаторыСтрок.Добавить(ВыделенныеСтрокиТоварныеПозиции[К-1]);	
	КонецЦикла;
	
	ТоварныеПозицииВыбор(Элементы.ТоварныеПозиции, ИдентификаторыСтрок, Элементы.ТоварныеПозиции.ПодчиненныеЭлементы.ТоварныеПозицииНомерСтроки, Истина);
	
	// уберем фокус с поля количество, чтобы не предлагать редактировать количество
	Если КоличествоВыделенныхСтрок > 1 Тогда
		
		КолонкаФокуса = Элементы.ТранспортныеУпаковки.ПодчиненныеЭлементы.ТранспортныеУпаковкиСоставУпаковки;
		Элементы.ТранспортныеУпаковки.ТекущийЭлемент = КолонкаФокуса;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаПеренестиВсеВправо(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КоличествоТоварныхПозиций = ТоварныеПозиции.Количество();
	
	Пока Не ТоварныеПозиции.Количество() = 0 Цикл
		ТоварныеПозицииВыбор(Элементы.ТоварныеПозиции, ТоварныеПозиции[0].ПолучитьИдентификатор(), Элементы.ТоварныеПозиции.ПодчиненныеЭлементы.ТоварныеПозицииНомерСтроки, Истина);	
	КонецЦикла;
	
	// уберем фокус с поля количество, чтобы не предлагать редактировать количество
	Если КоличествоТоварныхПозиций > 1 Тогда
		КолонкаФокуса = Элементы.ТранспортныеУпаковки.ПодчиненныеЭлементы.ТранспортныеУпаковкиСоставУпаковки;
		Элементы.ТранспортныеУпаковки.ТекущийЭлемент = КолонкаФокуса;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КнопкаПеренестиВлево(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ВыделенныеСтрокиТранспортныеУпаковки = МодульОбъектаКлиент().ВыделенныеСтрокиТаблицыФормы_КонтурEDI(Элементы.ТранспортныеУпаковки);
	
	Количество = ВыделенныеСтрокиТранспортныеУпаковки.Количество();
	Для К = 1 По Количество Цикл
		УдаляемаяСтрока = ТранспортныеУпаковки.НайтиПоИдентификатору(ВыделенныеСтрокиТранспортныеУпаковки[К-1]);
		УдалитьСтрокуТранспортнойУпаковки(УдаляемаяСтрока);
	КонецЦикла;
	
	ОбновитьДанныеРазмещения("КнопкаПеренестиВлево");
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаПеренестиВсеВлево(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Количество = ТранспортныеУпаковки.ПолучитьЭлементы().Количество();
	Для К = 1 По Количество Цикл
		УдалитьСтрокуТранспортнойУпаковки(ТранспортныеУпаковки.ПолучитьЭлементы()[0]);	
	КонецЦикла;	
	
	ОбновитьДанныеРазмещения("КнопкаПеренестиВсеВлево");
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаРазделитьПоПалетам(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ТекДанные = Элементы.ТоварныеПозиции.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомерСтроки = ТекДанные.НомерСтроки;
	КоличествоРаспределить = ТекДанные.Количество;
	КоличествоНаПалете = 0;
	
	ТекстПодсказка = "Сколько на палете?";
	ДопПараметрДляПередачиВОбработчик = Новый Структура("НомерСтроки,КоличествоРаспределить", НомерСтроки, КоличествоРаспределить);
	
	МодульОбъектаКлиент().ПоказатьВводЧисла_КонтурEDI("ОбработчикВводаКоличествоНаПалете", ЭтаФорма, ДопПараметрДляПередачиВОбработчик, КоличествоНаПалете, ТекстПодсказка, 12, 2);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВводаКоличествоНаПалете(КоличествоНаПалете, ДопПараметрОбработчика = Неопределено) Экспорт
	
	Если КоличествоНаПалете = Неопределено 
		ИЛИ КоличествоНаПалете <= 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	НомерСтроки = ДопПараметрОбработчика.НомерСтроки;
	КоличествоРаспределить = ДопПараметрОбработчика.КоличествоРаспределить;	
	
	Пока КоличествоРаспределить > 0 Цикл
		
		НайденныеСтроки = ТоварныеПозиции.НайтиСтроки(Новый Структура("НомерСтроки", НомерСтроки));
		
		Если НЕ НайденныеСтроки.Количество() = 0 Тогда
			
			НоваяУпаковка 	= ДобавитьНовуюУпаковку();
			
			Если КоличествоРаспределить > КоличествоНаПалете Тогда
				РазместитьТоварнуюПозицию(НайденныеСтроки[0], НоваяУпаковка, ,КоличествоНаПалете);
			Иначе
				РазместитьТоварнуюПозицию(НайденныеСтроки[0], НоваяУпаковка, ,КоличествоРаспределить);
			КонецЕсли;
			
			КоличествоРаспределить = КоличествоРаспределить - КоличествоНаПалете;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьДанныеРазмещения("КнопкаРазделитьПоПалетам"); 
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьНовуюУпаковку(Родитель = Неопределено, ТипУпаковки = Неопределено, КопируемаяУпаковка = Неопределено, МассовоеДействие = Ложь)
	
	Если Родитель = Неопределено Тогда
		НоваяСтрока = ТранспортныеУпаковки.ПолучитьЭлементы().Добавить();
		НоваяСтрока.КодыМаркировкиПредставление = "Коды не выбраны";
	Иначе
		НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
	КонецЕсли;
	
	Если КопируемаяУпаковка = Неопределено Тогда
		
		Если ТипУпаковки = Неопределено Тогда
			НоваяСтрока.ТипУпаковки	= ТипУпаковкиПоУмолчанию;	
		Иначе
			НоваяСтрока.ТипУпаковки = ТипУпаковки;
		КонецЕсли;
		
		УстановитьРазмерыУпаковки(НоваяСтрока);
		
	Иначе
		
		СвойстваДляКопирования = 
		"ВесБрутто," + 
		"ВесНетто," + 
		"Высота," + 
		"Длина," + 
		"КодЕдиницыИзмеренияВесаБрутто," + 
		"КодЕдиницыИзмеренияВесаНетто," + 
		"КодЕдиницыИзмеренияВысоты," +
		"КодЕдиницыИзмеренияДлины," +
		"КодЕдиницыИзмеренияШирины," +
		"ТемпературныйРежим," +
		"ТипУпаковки," +
		"ТребуетсяТемпературныйРежим," +
		"Ширина";
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, КопируемаяУпаковка, СвойстваДляКопирования);
				
	КонецЕсли;
	
	Если Не МассовоеДействие Тогда
		ПронумероватьУпаковкиСквознымПорядковымНомером();
		ПроименоватьУпаковки(ТранспортныеУпаковки.ПолучитьЭлементы());
	
		ВыделитьСтроку(НоваяСтрока);
	КонецЕсли;
		
	Возврат НоваяСтрока;
		
КонецФункции

&НаКлиенте
Процедура УстановитьРазмерыУпаковки(Строка)
	
	Если НЕ ИспользоватьДопПараметрыУпаковки Тогда
		Возврат;
	КонецЕсли;
	
	КодУпаковки = "Код" + Строка.ТипУпаковки;
	
	СвойстваУпаковки = Неопределено;
		
	Если ТипыТранспортныхУпаковок.Свойство(КодУпаковки, СвойстваУпаковки) Тогда
		ЗаполнитьЗначенияСвойств(Строка, СвойстваУпаковки);
	Иначе
		Строка.Длина = 1.2;
		Строка.КодЕдиницыИзмеренияДлины = "MTR";
		Строка.Ширина = 0.8;
		Строка.КодЕдиницыИзмеренияШирины = "MTR";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазместитьТоварнуюПозицию(Позиция, Упаковка, МассовоеДействие = Истина, РазмещаемоеКоличество = 0, СтрокаТовар = Неопределено)
	
	НоваяСтрока = Неопределено;
	Для Каждого Строка Из Упаковка.ПолучитьЭлементы() Цикл
		Если Строка.НомерСтроки = Позиция.НомерСтроки Тогда
			НоваяСтрока = Строка;
			СтрокаТовар = НоваяСтрока;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	РазмещаемоеКоличество = ?(РазмещаемоеКоличество = 0, Позиция.Количество, РазмещаемоеКоличество);
		
	Если НоваяСтрока = Неопределено Тогда
		
		НоваяСтрока = Упаковка.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Позиция);
		
		Если НоваяСтрока.Свойство("КодыМаркировки") Тогда
			НоваяСтрока.КодыМаркировки.Очистить();
		КонецЕсли;
		
		НоваяСтрока.СоставУпаковки = ПолучитьРазвернутоеНаименованиеТовара(Позиция);
		НоваяСтрока.Количество = РазмещаемоеКоличество;
		
	Иначе
		НоваяСтрока.Количество = НоваяСтрока.Количество + РазмещаемоеКоличество; 
	КонецЕсли;
	
	ПодобратьКодыМаркировкиПриРазмещенииТоварнойПозиции(Позиция, НоваяСтрока, РазмещаемоеКоличество);
	
	СтрокаТовар = НоваяСтрока;
	
	Если МассовоеДействие Тогда
		ВыделитьСтроку(НоваяСтрока);
	Иначе
		ВыделитьЯчейку(НоваяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьКодыМаркировкиПриРазмещенииТоварнойПозиции(ТоварнаяПозиция, ПозицияВУпаковках, Знач РазмещаемоеКоличество)
	
	ОтборРазмещенныхСтрок = Новый Структура("НомерСтроки", ТоварнаяПозиция.НомерСтроки);
	СтрокиТоваров = Товары.НайтиСтроки(ОтборРазмещенныхСтрок);
	
	КодыМаркировкиТоварнойПозиции = Новый СписокЗначений;
	
	Для каждого СтрокаТоваров Из СтрокиТоваров Цикл
		
		Если Не СтрокаТоваров.Свойство("КодыМаркировки") Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого КодМаркировки Из СтрокаТоваров.КодыМаркировки Цикл
			КодыМаркировкиТоварнойПозиции.Добавить(КодМаркировки.Значение, КодМаркировки.Представление);			
		КонецЦикла;
		
	КонецЦикла;
	                                                                                  
	Если КодыМаркировкиТоварнойПозиции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиРазмещенияТоварнойПозиции = МодульОбъектаКлиент().НайтиСтрокиВДеревеФормы(ТранспортныеУпаковки.ПолучитьЭлементы(),ОтборРазмещенныхСтрок,Истина);
	Для каждого СтрокаРазмещения Из СтрокиРазмещенияТоварнойПозиции Цикл
		Для каждого КодМаркировки Из СтрокаРазмещения.КодыМаркировки Цикл
			РазмещенныйРанееКодМаркировки = КодыМаркировкиТоварнойПозиции.НайтиПоЗначению(КодМаркировки.Значение);
			КодыМаркировкиТоварнойПозиции.Удалить(РазмещенныйРанееКодМаркировки);
		КонецЦикла;
	КонецЦикла;
	
	Для каждого НеРазмещенныйКодМаркировки Из КодыМаркировкиТоварнойПозиции Цикл
		
		Если РазмещаемоеКоличество <= 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПозицияВУпаковках.КодыМаркировки.Добавить(НеРазмещенныйКодМаркировки.Значение, НеРазмещенныйКодМаркировки.Представление);
		
		РазмещаемоеКоличество = РазмещаемоеКоличество - 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьТоварнуюПозицию(Позиция, Упаковка, МассовоеДействие = Истина)
	
	Для Каждого Товар Из Упаковка.ПолучитьЭлементы() Цикл
		Если Товар.НомерСтроки = Позиция.НомерСтроки Тогда
			НоваяСтрока = Товар;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НоваяСтрока = Неопределено Тогда
		НоваяСтрока = Упаковка.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Позиция);
	Иначе
		НоваяСтрока.Количество = НоваяСтрока.Количество + Позиция.Количество;
		
		Если НоваяСтрока.Свойство("КодыМаркировки") Тогда
			НоваяСтрока.КодыМаркировки = МодульОбъектаКлиент().ОбъединитьСпискиЗначений(НоваяСтрока.КодыМаркировки, Позиция.КодыМаркировки);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Позиция.ПолучитьРодителя() = Неопределено Тогда
		ТранспортныеУпаковки.ПолучитьЭлементы().Удалить(Позиция);
	Иначе
		Позиция.ПолучитьРодителя().ПолучитьЭлементы().Удалить(Позиция);
	КонецЕсли;
		
	ВыделитьСтроку(НоваяСтрока);
			
КонецПроцедуры

&НаКлиенте
Функция ДобавитьНераспределеннуюТоварнуюПозицию(Строка)
	
	НоваяСтрока = ТоварныеПозиции.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Функция УдалитьСтрокуТранспортнойУпаковки(УдаляемаяСтрока = Неопределено, ЗапроситьПодтверждение = Ложь)
	
	МожноУдалятьСтроку = Истина;
	
	Если УдаляемаяСтрока = Неопределено Тогда
		СП = Новый СообщениеПользователю;
		СП.Текст = "Не выбрана удаляемая строка.";
		СП.Поле = "ТранспортныеУпаковки";
		СП.Сообщить();
		МожноУдалятьСтроку = Ложь;
		Возврат МожноУдалятьСтроку;
	КонецЕсли;
	
	//проверим, существует ли строка, не удалена ли она уже
	ЭтоУпаковка 	 = Истина;
	
	Попытка
		ЭтоУпаковка = ЗначениеЗаполнено(УдаляемаяСтрока.ТипУпаковки);
		СтрокаСуществует = Истина;
	Исключение
		СтрокаСуществует = Ложь;	
	КонецПопытки;
	
	Если Не СтрокаСуществует Тогда
		Возврат Истина;		
	КонецЕсли;
	
	Если ЗапроситьПодтверждение Тогда
		Ответ = Вопрос("Удалить выбранную " + ?(ЭтоУпаковка, "упаковку", "товарную позицию") + "?",РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Контур.EDI");
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			МожноУдалятьСтроку = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если МожноУдалятьСтроку Тогда
		УдалитьСтрокуРекурсивно(УдаляемаяСтрока);
	КонецЕсли;
		
	Возврат МожноУдалятьСтроку;
			
КонецФункции

&НаКлиенте
Процедура УдалитьСтрокуРекурсивно(ТекущаяСтрока)
	
	//проваливаемся вложенные строки
	Количество  = ТекущаяСтрока.ПолучитьЭлементы().Количество() - 1;
	Для К = 0 По Количество Цикл
		Строка = ТекущаяСтрока.ПолучитьЭлементы()[0];
		Если Не Строка.ПолучитьЭлементы().Количество() = 0 Тогда
			УдалитьСтрокуРекурсивно(Строка);
		Иначе
			//удаляем текущую строку
			Если Не Строка.ПолучитьРодителя() = Неопределено Тогда
				ВеткаСтроки = Строка.ПолучитьРодителя().ПолучитьЭлементы();
			Иначе
				ВеткаСтроки = ТранспортныеУпаковки.ПолучитьЭлементы();
			КонецЕсли;
			ВеткаСтроки.Удалить(Строка);
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	//удаляем родительскую строку
	Если Не ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
		ВеткаСтроки = ТекущаяСтрока.ПолучитьРодителя().ПолучитьЭлементы();
	Иначе
		ВеткаСтроки = ТранспортныеУпаковки.ПолучитьЭлементы();
	КонецЕсли;
	ВеткаСтроки.Удалить(ТекущаяСтрока);
	
КонецПроцедуры

//Удаление сообщения
&НаКлиенте
Процедура УдалитьСообщение(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если НЕ ЭтоПоследнееСообщениеВЦепочкеВызовСервера() Тогда
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Можно удалять только последнее сообщение в цепочке!"); 
				
	Иначе
		
		МодульОбъектаКлиент().ОткрытьФормуПроверкиПароляУчетнойЗаписи(Неопределено, Истина, "ОбработчикПроверкиПароляДляУдаленияСообщения", ЭтаФорма); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПроверкиПароляДляУдаленияСообщения(РезультатПроверкиПароля,ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатПроверкиПароля = Истина Тогда
		
		ТекстВопроса = "Текущее сообщение будет навсегда удалено из 1С. Продолжить?";
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить("Да, удалить сообщение");
		СписокКнопок.Добавить("Нет, не удалять");
		
		ИмяОбработчика = "ОбработчикСогласияУдаленияСообщения";
		
		МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика, ЭтаФорма, Неопределено, ТекстВопроса, СписокКнопок);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСогласияУдаленияСообщения(РезультатВопроса,ДополнительныеПараметры = Неопределено) Экспорт

	Если РезультатВопроса = "Да, удалить сообщение" Тогда
		
		УдалитьСообщениеВызовСервера();
		ЗакрытиеРазрешено = Истина;
		Закрыть(Неопределено);
		
	КонецЕсли;

КонецПроцедуры // ОбработчикСогласияУдаленияСообщения()

&НаСервере
Процедура УдалитьСообщениеВызовСервера()
	
	Если НЕ ЗначениеЗаполнено(Сообщение.ДокументСсылка) Тогда
		Сообщение.ДокументСсылка = Сообщение.Документ1С;
	КонецЕсли;
	
	МодульОбъекта().УдалитьСообщение(Сообщение);

КонецПроцедуры // УдалитьСообщениеВызовСервера()

&НаСервере
Функция ЭтоПоследнееСообщениеВЦепочкеВызовСервера()

	Возврат МодульОбъекта().ЭтоПоследнееСообщениеВЦепочке(Сообщение.СообщениеСсылка, Сообщение.ДокументСсылка) = Истина;	

КонецФункции // ЭтоПоследнееСообщениеВЦепечкеВызовСервера()

//конец Удаление сообщения

&НаКлиенте
Процедура Накладная1СПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Накладная1С) Тогда
		
		РезультатПроверкиНакладной = ПриПопыткеИзмененияНакладнойВСообщенииВызовСервера();
		
		Если НЕ РезультатПроверкиНакладной.Успешно Тогда
			
			ТекстПредупреждения=РезультатПроверкиНакладной.ТекстОшибки;
			ДопПараметрДляПередачиВОбработчик=Неопределено;
			Если Параметры.МодальностьЗапрещена Тогда 
				Выполнить("ПоказатьПредупреждение(,ТекстПредупреждения,,""Контур.EDI"")");
			Иначе
				Предупреждение(ТекстПредупреждения,,"Контур.EDI");
			КонецЕсли;
			
			Накладная1С = Неопределено;
			Сообщение.Накладная1С = Неопределено;

			УстановитьТипПоля1С("Накладная");
			Возврат;	
		КонецЕсли;
		
	КонецЕсли;
	
	Сообщение.Накладная1С = Накладная1С;
	
	Если ТипСообщения = "RETANN" ИЛИ ТипСообщения = "RETDES" Тогда
		ОбновитьКнопкиКоманднойПанели();
	КонецЕсли;
	
	//сбросить цвет
	Элемент.ЦветФона = новый Цвет();
	ПроверитьЗаполнениеПолей();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКнопкиКоманднойПанели()
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	СоздатьКнопки(НастройкаФормы.КнопкиКоманднойПанели);
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры

&НаСервере
Функция ПриПопыткеИзмененияНакладнойВСообщенииВызовСервера()

Результат=МодульОбъекта().ПриПопыткеИзмененияНакладнойВСообщении(Сообщение,Накладная1С);

Возврат Результат;

КонецФункции // ПриПопыткеИзмененияНакладнойВСообщенииВызовСервера()

&НаКлиенте
Процедура Накладная1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если МыЯвляемсяПродавцомНаСервере(Сообщение) Тогда
		Организация = Сообщение.Продавец1С;
		Контрагент  = Сообщение.Покупатель1С;
	Иначе
		Организация = Сообщение.Покупатель1С;
		Контрагент  = Сообщение.Продавец1С;
	КонецЕсли;
	
	ФиксированныйОтбор = Новый ФиксированнаяСтруктура("Организация,Контрагент", Организация, Контрагент);
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("Отбор"			, Новый Структура(ФиксированныйОтбор));
	ПараметрыОбработчика.Вставить("Сообщение"		, Сообщение);
	ПараметрыОбработчика.Вставить("ЭлементФормы"	, Элемент);
	ПараметрыОбработчика.Вставить("Форма"			, ЭтаФорма);
	
	СтандартнаяОбработкаEDI = Истина;
		
	ОсновнаяФорма().ОбработкаСобытияПодключаемогоМодуляКлиент("НачалоВыбораПоляФормыСообщения", 
															  СтандартнаяОбработкаEDI, 
															  ПараметрыОбработчика);	
															  
  	Если Не СтандартнаяОбработкаEDI = Истина Тогда
		ПараметрыОтбора = ПараметрыОбработчика.Отбор;
  	Иначе
		ПараметрыОтбора = Новый Структура(ФиксированныйОтбор);
  	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
		
	СтруктураПараметров	= Новый Структура;
	СтруктураПараметров.Вставить("Отбор",              ПараметрыОтбора);
	СтруктураПараметров.Вставить("РежимВыбора",        Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);
	
	ТипДокумента = ПолучитьТипЗначенияОбъектаКлиент("ИсходящееУведомлениеОбОтгрузке",Истина);
		
	Если ЗначениеЗаполнено(ТипДокумента) Тогда
		ОткрытьФорму("Документ." + ТипДокумента + ".ФормаВыбора", СтруктураПараметров, Элемент);
	Иначе
		Сообщить("Не удалось определить тип документа для выбора накладной");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция МыЯвляемсяПродавцомНаСервере(Сообщение)
	
	Возврат МодульОбъекта().МыЯвляемсяПродавцом(Сообщение);
	
КонецФункции


&НаКлиенте
Процедура Заказ1СПриИзменении(Элемент)
	ПроверитьЗаполнениеПолей();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьУведомлениеОПриемке(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьСообщение(Команда)                    
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ВыбратьДокументДляПривязкиСообщения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокументДляПривязкиСообщения() 
			
	СтруктураПараметров	= Новый Структура;
	СтруктураПараметров.Вставить("Отбор",              СтруктураОтбораДокумента);
	СтруктураПараметров.Вставить("РежимВыбора",        Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);
	
	ТипДокумента = ОпределитьИмяТипаПривязываемогоДокументаСервер(Документ1С, Сообщение);	
	
	ИмяФормыВыбора = "Документ." + ТипДокумента + ".ФормаВыбора";
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI(ИмяФормыВыбора, "", СтруктураПараметров, ЭтаФорма, "Документ1СПриИзменении", ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Документ1СПриИзменении(ВыбранноеЗначение, ДопПараметр = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПривязки = СвязатьСообщениеСДокументомВызовСервера(ВыбранноеЗначение); 
	
	Если РезультатПривязки.Успешно = Ложь Тогда
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(РезультатПривязки.ОписаниеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СвязатьСообщениеСДокументомВызовСервера(ВыбранноеЗначение)
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Успешно",Ложь);
	СтруктураРезультата.Вставить("ОписаниеОшибки","");
	
	Если НЕ МодульОбъекта().НайтиСообщениеДокумента(ВыбранноеЗначение,Сообщение.ТипСообщения) = Неопределено Тогда
		
		СтруктураРезультата.ОписаниеОшибки = "К данному документу уже привязано другое сообщение " + Сообщение.ТипСообщения;
		СтруктураРезультата.Успешно = Ложь;
		
		Возврат СтруктураРезультата;
		
	КонецЕсли;
		
	РезультатПроверки = МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ПередСвязываниемСообщенияСДокументомЧерезФорму", ,
																			Новый Структура("Документ, Сообщение, Форма", 
																							ВыбранноеЗначение, Сообщение, ЭтаФорма));
							
	Если РезультатПроверки <> Неопределено
		И НЕ РезультатПроверки.Успешно Тогда
		
		СтруктураРезультата.ОписаниеОшибки = РезультатПроверки.ОписаниеОшибки;
		
		Возврат СтруктураРезультата;
		
	КонецЕсли;
							
	Документ1С = ВыбранноеЗначение;
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	МодульОбъекта().СвязатьСообщениеСДокументом(Сообщение,Документ1С);
	ТолькоПросмотрСообщения = Истина;
	Сообщение.ДокументСсылка	= Документ1С;
	Сообщение.Документ1С		= Документ1С;
	
	ПроизвестиПервоначальноеЗаполнениеПолейНаФорме();

	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	СтруктураРезультата.Успешно = Истина;
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаСервере
Функция ОпределитьИмяТипаПривязываемогоДокументаСервер(Ссылка, Сообщение)
	
	ТипДокумента = МодульОбъекта().ОпределитьИмяТипаДокумента(Ссылка, Сообщение);

	Возврат ТипДокумента;	

КонецФункции

&НаКлиенте
Функция ПолучитьТипЗначенияОбъектаКлиент(Тип1С, ВернутьИмяВМетаданных = Ложь)
	
	Если ВернутьИмяВМетаданных Тогда
		Тип1С = Тип1С + "ВМетаданных";
	КонецЕсли;
	
	ТипЗначенияОбъекта = Неопределено;
	ТипыЗначенийОбъектовEDI.Свойство(Тип1С, ТипЗначенияОбъекта);
	
	Если ТипЗначенияОбъекта = "" Тогда
		ТипЗначенияОбъекта = Неопределено;
	КонецЕсли;
	
	Возврат ТипЗначенияОбъекта;
	
КонецФункции

&НаКлиенте
Процедура ПереотправитьСообщение(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ПараметрыФормы = Новый Структура("СообщениеСсылка",			Сообщение.СообщениеСсылка); 
	ПараметрыФормы.Вставить("Документ1С",						Сообщение.Документ1С);
	ПараметрыФормы.Вставить("ТипСообщения",						Сообщение.ТипСообщения);
	ПараметрыФормы.Вставить("Направление",						Сообщение.Направление);
	ПараметрыФормы.Вставить("ТолькоПросмотр",					Ложь);
	ПараметрыФормы.Вставить("КодДействия",						"Отправить_");
	ПараметрыФормы.Вставить("РежимРаботы",						Параметры.РежимРаботы);
	ПараметрыФормы.Вставить("АдресХранилища",					Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект);
	ПараметрыФормы.Вставить("ПараметрыАвтотестирования",		Параметры.ПараметрыАвтотестирования);
	ПараметрыФормы.Вставить("ПереотправляемоеСообщениеСсылка",	Сообщение.СообщениеСсылка);
	
	Если НЕ Параметры.ПроизвольныеПараметры = Неопределено Тогда 
		ПараметрыФормы.Вставить("ПроизвольныеПараметры",	Параметры.ПроизвольныеПараметры);
	КонецЕсли;
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ФормаСообщенияУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослеЗакрытияКарточкиПереотправкиСообщения", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеЗакрытияКарточкиПереотправкиСообщения(Параметр = Неопределено, ДопПараметр = Неопределено)Экспорт

	ЭтаФорма.Закрыть(неопределено);

КонецПроцедуры // ОбработчикПослеЗакрытияКарточкиПереотправкиСообщения()

&НаКлиенте
Процедура ПрекратитьОбработкуВходящегоСообщения(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ТекстВопроса = "Обработка сообщения будет прекращена. Продолжить?";
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить("Да, прекратить обработку");
	КнопкиВопроса.Добавить("Отмена");
	ДопПараметрДляПередачиВОбработчик = Неопределено;
	РезультатВопроса = Неопределено;
	
	Если Параметры.МодальностьЗапрещена Тогда
		Выполнить("ПоказатьВопрос(Новый ОписаниеОповещения(""ОбработчикСогласияОстановкиОбработки"", ЭтаФорма, ДопПараметрДляПередачиВОбработчик), ТекстВопроса, КнопкиВопроса,,,""Контур.EDI"")");
	Иначе
		РезультатВопроса = Вопрос(ТекстВопроса, КнопкиВопроса,,,"Контур.EDI");
		ОбработчикСогласияОстановкиОбработки(РезультатВопроса,ДопПараметрДляПередачиВОбработчик);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСогласияОстановкиОбработки(РезультатВопроса,ДопПараметрПереданныйВОбработчик = Неопределено) Экспорт
	
    Если РезультатВопроса = "Да, прекратить обработку" Тогда 
		ПрекратитьОбработкуВходящегоСообщенияВызовСервера();
		ЗакрытиеРазрешено = Истина;
    	ЭтаФорма.Закрыть(неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрекратитьОбработкуВходящегоСообщенияВызовСервера()

	МодульОбъекта().ПрекратитьОбработкуВходящегоСообщения(Сообщение.СообщениеСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьОбработкуНулевойСФ(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ТекстВопроса ="Обработка счет-фактуры будет прекращена. Продолжить?";
	КнопкиВопроса=новый СписокЗначений;
	КнопкиВопроса.Добавить("Да, прекратить обработку");
	КнопкиВопроса.Добавить("Отмена");
	ДопПараметрДляПередачиВОбработчик=Неопределено;
	РезультатВопроса = Неопределено;
	
	Если Параметры.МодальностьЗапрещена Тогда
		Выполнить("ПоказатьВопрос(Новый ОписаниеОповещения(""ОбработчикСогласияОстановкиОбработкиНулевойСФ"", ЭтаФорма, ДопПараметрДляПередачиВОбработчик), ТекстВопроса, КнопкиВопроса,,,""Контур.EDI"")");
	Иначе
		РезультатВопроса = Вопрос(ТекстВопроса, КнопкиВопроса,,,"Контур.EDI");
		ОбработчикСогласияОстановкиОбработкиНулевойСФ(РезультатВопроса,ДопПараметрДляПередачиВОбработчик);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСогласияОстановкиОбработкиНулевойСФ(РезультатВопроса,ДопПараметрПереданныйВОбработчик=Неопределено) Экспорт
	
	Если РезультатВопроса = "Да, прекратить обработку" Тогда 
		ПрекратитьОбработкуНулевойСФВызовСервера();
		ЗакрытиеРазрешено = Истина;
    	ЭтаФорма.Закрыть(неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрекратитьОбработкуНулевойСФВызовСервера()

	МодульОбъекта().ПрекратитьОбработкуНулевойСФ(Сообщение);
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры // ПрекратитьОбработкуСообщенияВызовСервера()

&НаКлиенте
Процедура ЗакрытьФормуБезПримененияДействия(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	ЗакрытиеРазрешено=Истина;
	ЭтаФорма.Закрыть(Параметры.СообщениеСсылка);//возвращаем ту же самую ссылку что и пришла на входе - обработчик не будет вычеркивать строку
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если ЗакрытиеРазрешено=Неопределено Тогда
		СтандартнаяОбработка=Ложь;
		Отказ=Истина;
		ЗакрытиеРазрешено=Истина;
		ЭтаФорма.Закрыть(Параметры.СообщениеСсылка);//возвращаем ту же самую ссылку что и пришла на входе - обработчик не будет вычеркивать строку
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "ФормаСообщенияУправляемая");
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСчетФактуру(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортировкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ=истина;
КонецПроцедуры

&НаКлиенте
Процедура ТранспортировкаПередУдалением(Элемент, Отказ)
	Отказ=истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВрата(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ВыбраннаяДата=Сообщение.ДатаПоставки;
	ПоказатьВводВрат(ВыбраннаяДата);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВрата(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	//ТекущиеВрата= определить!!!
	
	
	ТекущиеВрата= Сообщение.ДатаПоставки;
	
	ДопПараметры = новый Структура;
	ДопПараметры.Вставить("СтрокаСпискаВрат",Элементы.Транспортировка.ТекущаяСтрока);

	ПоказатьВводВрат(ТекущиеВрата,ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВводВрат(ИсходнаяДата,ДопПараметры=неопределено)
	
	ВыбраннаяДата=ИсходнаяДата;
	Подсказка = "Укажите новые врата времени";
	ЧастьДаты = ЧастиДаты.ДатаВремя;
	//ДопПараметры = новый Структура;
	//ДопПараметры.Вставить("СтрокаСпискаВрат",неопределено);
	Если Параметры.МодальностьЗапрещена Тогда
		Оповещение = Неопределено;
		Выполнить("Оповещение = Новый ОписаниеОповещения(""ОбработчикПослеВводаВрат"",ЭтаФорма, ДопПараметры)");
		Выполнить("ПоказатьВводДаты(Оповещение, ВыбраннаяДата, Подсказка, ЧастьДаты)");
	Иначе
		Если ВвестиДату(ВыбраннаяДата,Подсказка,ЧастьДаты) Тогда 			
			ОбработчикПослеВводаВрат(ВыбраннаяДата, ДопПараметры);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПоказатьВводВрат()

&НаКлиенте
Процедура ОбработчикПослеВводаВрат(ВыбраннаяДата, ДопПараметры=Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ВыбраннаяДата) Тогда
		Если ДопПараметры=Неопределено или ДопПараметры.СтрокаСпискаВрат=Неопределено Тогда 
			Транспортировка.Добавить(ВызовСервера_Дата1С_в_ДатаВремяXML(ВыбраннаяДата),ВыбраннаяДата,истина);
		Иначе
			Транспортировка[ДопПараметры.СтрокаСпискаВрат].Пометка=Истина;
			Транспортировка[ДопПараметры.СтрокаСпискаВрат].Значение=ВызовСервера_Дата1С_в_ДатаВремяXML(ВыбраннаяДата);
			Транспортировка[ДопПараметры.СтрокаСпискаВрат].Представление=ВыбраннаяДата;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВысотуСпискаВрат()

КонецПроцедуры // ОбработчикПослеВводаВрат()

&НаСервере
Функция ВызовСервера_Дата1С_в_ДатаВремяXML(Дата)

Возврат МодульОбъекта().Дата1С_в_ДатаВремяXML(Дата);	

КонецФункции // ВызовСервера_Дата1С_в_ДатаВремяXML()

&НаКлиенте
Процедура УдалитьВрата(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ВыделенныеСтрокиТранспортировка = МодульОбъектаКлиент().ВыделенныеСтрокиТаблицыФормы_КонтурEDI(Элементы.Транспортировка);
		
	Количество = ВыделенныеСтрокиТранспортировка.Количество();
	
	Если Количество=0 Тогда 
		Сообщить("Не выделены строки врат времени для удаления");	
	КонецЕсли;
	
	Для К = 1 По Количество Цикл
		УдаляемаяСтрока = Транспортировка.НайтиПоИдентификатору(ВыделенныеСтрокиТранспортировка[К-1]);
		Транспортировка.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	УстановитьВысотуСпискаВрат();
	
	Если Транспортировка.Количество() = 0 Тогда 
		ТекстПредупреждения="Внимание, для этого заказа необходимо указать хотя бы 1 врата времени."+Символы.ПС+"В противном случае торговая сеть не получит сведения о времени прибытия машины.";
		ДопПараметрДляПередачиВОбработчик=Неопределено;
		Если Параметры.МодальностьЗапрещена Тогда 
			Выполнить("ПоказатьПредупреждение(,ТекстПредупреждения,,""Контур.EDI"")");
		Иначе
			Предупреждение(ТекстПредупреждения,,"Контур.EDI");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВысотуСпискаВрат()

	//Пересчитать высоту
	Элементы.Транспортировка.Высота=Транспортировка.Количество()+1;
	Если  Элементы.Транспортировка.Высота<=1 Тогда 
		Элементы.Транспортировка.Высота = 2;
	КонецЕсли;

КонецПроцедуры // УстановитьВысотуСпискаВрат()

&НаКлиенте
Процедура ОтправитьКорректировочныйСчетФактуру(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	КнопкаДействияФормыНажатие_Клиент(Команда.Имя);   
	
КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьОбработкуИсходящегоСообщения(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             

	ТекстВопроса = "Сообщение будет помечено как успешно доставленное. Продолжить?";
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить("Да, пометить сообщение как доставленное");
	КнопкиВопроса.Добавить("Отмена");
	ДопПараметрДляПередачиВОбработчик = Неопределено;
	РезультатВопроса = Неопределено;
	
	Если Параметры.МодальностьЗапрещена Тогда
		Выполнить("ПоказатьВопрос(Новый ОписаниеОповещения(""ОбработчикСогласияПометитьСообщениеКакДоставленное"", ЭтаФорма, ДопПараметрДляПередачиВОбработчик), ТекстВопроса, КнопкиВопроса,,,""Контур.EDI"")");
	Иначе
		РезультатВопроса = Вопрос(ТекстВопроса, КнопкиВопроса,,,"Контур.EDI");
		ОбработчикСогласияПометитьСообщениеКакДоставленное(РезультатВопроса,ДопПараметрДляПередачиВОбработчик);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСогласияПометитьСообщениеКакДоставленное(РезультатВопроса,ДопПараметрПереданныйВОбработчик=Неопределено) Экспорт
	
    Если РезультатВопроса = "Да, пометить сообщение как доставленное" Тогда 
		ПометитьСообщениеКакДоставленноеВызовСервера();
		ЗакрытиеРазрешено = Истина;
    	ЭтаФорма.Закрыть(неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПометитьСообщениеКакДоставленноеВызовСервера()
	
	Если(Сообщение.Свойство("ПереотправляемоеСообщениеСсылка") 
		ИЛИ Сообщение.Свойство("СообщениеСсылка")) Тогда 
			Если Сообщение.Свойство("СообщениеСсылка") И ЗначениеЗаполнено(Сообщение.СообщениеСсылка) Тогда
				ТекСсылкаНаСообщение=Сообщение.СообщениеСсылка;
			ИначеЕсли Сообщение.Свойство("ПереотправляемоеСообщениеСсылка") И ЗначениеЗаполнено(Сообщение.ПереотправляемоеСообщениеСсылка) Тогда 
				ТекСсылкаНаСообщение=Сообщение.ПереотправляемоеСообщениеСсылка;
			КонецЕсли;
		
		МодульОбъекта().УстановитьСтатусСообщения(ТекСсылкаНаСообщение, , , "ИсходящийДоставлен"); // условие на наличие этого свойства есть в процедуре СоздатьКнопки()
	Иначе
		Сообщить("Не удалось прекратить обработку сообщения, возможно запись была изменена или удалена");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныеПозицииНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если Параметры.ТолькоПросмотр ИЛИ Сообщение.Направление = "Входящее" Тогда
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;
	
	ПараметрыПеретаскивания.Действие 			= ДействиеПеретаскивания.Перемещение;
	ПараметрыПеретаскивания.ДопустимыеДействия 	= ДопустимыеДействияПеретаскивания.КопированиеИПеремещение;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеУпаковкиНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если Параметры.ТолькоПросмотр ИЛИ Сообщение.Направление = "Входящее" Тогда
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;
	 
	ПараметрыПеретаскивания.Действие 			= ДействиеПеретаскивания.Перемещение;
	ПараметрыПеретаскивания.ДопустимыеДействия 	= ДопустимыеДействияПеретаскивания.КопированиеИПеремещение;
	
КонецПроцедуры

//точки самовывоза ТС Магнит
&НаКлиенте
Процедура ОбработчикОтказОтСамовывоза(РезультатВопроса,ДопПараметрПереданныйВОбработчик=Неопределено) Экспорт

	ОтказОтСамовывозаСервер(РезультатВопроса);
	
КонецПроцедуры

&НаСервере
Процедура ОтказОтСамовывозаСервер(РезультатВопроса)
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища(); //потребуется для ПроверитьПоляСообщения
	
	Если РезультатВопроса="Самостоятельно" Тогда 
		Сообщение.ОтветственныйЗаДоставку = "TransportBySupplier";
	ИначеЕсли РезультатВопроса="Силами стороннего перевозчика" Тогда 
		Сообщение.ОтветственныйЗаДоставку = "TransportByLogisticProvider";
	Иначе
		Сообщение.ОтветственныйЗаДоставку = "TransportByCustomer";
	КонецЕсли;
	
	РезультатПроверки = МодульОбъекта().ПроверитьПоляСообщения(Сообщение);
	Сообщение.СодержитОшибки =  НЕ РезультатПроверки.Успешно;
	
	ПроверитьЗаполнениеПолей();
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры // ОтказОтСамовывозаСервер()

&НаКлиенте
Процедура ВыбратьТочкуСамовывоза()
	
	Если ЗначениеЗаполнено(Параметры.СообщениеСсылка) Тогда 
		АдресТаблицыТочекСамовывоза=ПоместитьТочкиСамовывозаВВХ();
		Если АдресТаблицыТочекСамовывоза=Неопределено Тогда 
			Сообщить("Не указаны точки самовывоза"); 
		иначе
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("АдресТаблицыВХранилище",АдресТаблицыТочекСамовывоза);
			МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("УниверсальнаяФормаВыбораУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослеВыбораТочкиСамовывоза", ЭтаФорма, ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеВыбораТочкиСамовывоза(Параметр=Неопределено,ДопПараметрПереданныйВОбработчик=Неопределено) Экспорт
	Если Параметр=Неопределено Тогда
		//так и не выбрали
	Иначе
		ОбработчикПослеВыбораТочкиСамовывозаСервер(Параметр);	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ОбработчикПослеВыбораТочкиСамовывозаСервер(АдресВХ)

	//поместить выбранное в сообщение
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	ТаблицаВыбранныхТочекСамовывоза=ПолучитьИзВременногоХранилища(АдресВХ);
	НоваяТЗТочкиСамовывоза=ТаблицаВыбранныхТочекСамовывоза;	
	ВсегоТочекСамовывоза=НоваяТЗТочкиСамовывоза.Количество();
	
	Для й=1 По ВсегоТочекСамовывоза Цикл
		Если НоваяТЗТочкиСамовывоза[ВсегоТочекСамовывоза-й].Выбор=Ложь Тогда
			НоваяТЗТочкиСамовывоза.Удалить(ВсегоТочекСамовывоза-й);
		КонецЕсли;
	КонецЦикла;
	
	Сообщение.ОтветственныйЗаДоставку = "TransportByCustomer";
	Сообщение.ТочкиСамовывоза=НоваяТЗТочкиСамовывоза;
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	
	//перепроверить сообщение
	РезультатПроверки = МодульОбъекта().ПроверитьПоляСообщения(Сообщение);
	Сообщение.СодержитОшибки =  НЕ РезультатПроверки.Успешно;
	
	ПроверитьЗаполнениеПолей();
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры // ОбработчикПослеВыбораТочкиСамовывозаСервер()

&НаКлиенте
Процедура ОтказОтСамовывоза()
	
	Если ЗначениеЗаполнено(Параметры.СообщениеСсылка) Тогда 
		ТекстВопроса ="Доставка будет осуществляться:";
		КнопкиВопроса=новый СписокЗначений;
		КнопкиВопроса.Добавить("Самостоятельно");
		КнопкиВопроса.Добавить("Силами стороннего перевозчика");
		КнопкиВопроса.Добавить("ОТМЕНА операции");
		ДопПараметрДляПередачиВОбработчик=Неопределено;
		РезультатВопроса = Неопределено;
		
		Если Параметры.МодальностьЗапрещена Тогда
			Выполнить("ПоказатьВопрос(Новый ОписаниеОповещения(""ОбработчикОтказОтСамовывоза"", ЭтаФорма, ДопПараметрДляПередачиВОбработчик), ТекстВопроса, КнопкиВопроса,,,""Контур.EDI"")");
		Иначе
			РезультатВопроса = Вопрос(ТекстВопроса, КнопкиВопроса,,,"Контур.EDI");
			ОбработчикОтказОтСамовывоза(РезультатВопроса,ДопПараметрДляПередачиВОбработчик);
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТочкиСамовывозаВВХ()

	СообщениеССамовывозом = МодульОбъекта().ПрочитатьСообщение(Параметры.СообщениеСсылка,,Параметры.ТипСообщения,Параметры.СообщениеСсылка.Направление);
	
	Если СообщениеССамовывозом.Свойство("ТочкиСамовывоза") И ЗначениеЗаполнено(СообщениеССамовывозом.ТочкиСамовывоза) И СообщениеССамовывозом.ТочкиСамовывоза.Количество()>0 Тогда 
		АдресвВХ=ПоместитьВоВременноеХранилище(СообщениеССамовывозом.ТочкиСамовывоза);
		Возврат АдресвВХ;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикПерепроверитьСообщение() Экспорт
	
	ПерепроверитьСообщениеСервер();
	
КонецПроцедуры 

&НаСервере
Процедура ПерепроверитьСообщениеСервер() Экспорт
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	РезультатПроверки = МодульОбъекта().ПроверитьПоляСообщения(Сообщение);
	
	Сообщение.СодержитОшибки =  НЕ РезультатПроверки.Успешно;
	
	ПроверитьЗаполнениеПолей();
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры

//Универсальный Акцептор Нажатия Доавбленной Кнопки
&НаКлиенте
Процедура АкцепторДобавленнойКнопки(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	//действия, которые нужно выполнить на клиенте, например что-то спросить
	КлиентскийКодОбработчика=ПолучитьКлиентскийКодОбработчикаНажатияКнопки(Команда.Имя);
	
	Если КлиентскийКодОбработчика<>неопределено Тогда 
		//в этот моент мы знаем Команда.Имя и можем выполнить нужный код внутри КлиентскийКодОбработчика смотри описание функции ПолучитьКлиентскийКодОбработчикаНажатияКнопки
		//для дальнейшей передачи на сервер для обработки Использовать  ОбработчикИнтерактивногоДействияДобавленнойкнопки(РезультатДействия,ИмяКоманды)
		Выполнить(КлиентскийКодОбработчика); 	
	КонецЕсли;
	
	//Вне зависимости от наличия клиентского обработчика выполняем серверную процедуру	
	АкцепторДобавленнойКнопкиСервер(Команда.Имя);
	
КонецПроцедуры

//////Пример кода события "ПолучениеКодаКлиентскогоОбработчика"
//Если Команда.Имя = "ПроверитьАдекватность" Тогда
//	
//	ТекстВопроса ="Сколько будет 3 + 1000000 ?";
//	КнопкиВопроса=новый СписокЗначений;
//	КнопкиВопроса.Добавить("не знаю");
//	КнопкиВопроса.Добавить("1000003");
//	ДопПараметрДляПередачиВОбработчик=Команда.Имя;
//	РезультатВопроса = Неопределено;
//	Если Параметры.МодальностьЗапрещена Тогда                     
//		Выполнить("ПоказатьВопрос(Новый ОписаниеОповещения(""ОбработчикИнтерактивногоДействияДобавленнойкнопки"", ЭтаФорма, ДопПараметрДляПередачиВОбработчик), ТекстВопроса, КнопкиВопроса,,,""Контур.EDI"")");
//	Иначе
//		РезультатВопроса = Вопрос(ТекстВопроса, КнопкиВопроса,,,"Контур.EDI");
//		ОбработчикИнтерактивногоДействияДобавленнойкнопки(РезультатВопроса,ДопПараметрДляПередачиВОбработчик); 
//	КонецЕсли;
//КонецЕсли;
&НаСервере
Функция ПолучитьКлиентскийКодОбработчикаНажатияКнопки(ИмяКоманды)
	
	СтандартнаяОбработкаEDI=Истина;	
	КлиентскийКодОбработчика = МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ПолучениеКодаКлиентскогоОбработчика",СтандартнаяОбработкаEDI,Новый Структура("ИмяКоманды,Сообщение,Параметры,Форма",ИмяКоманды,Сообщение,Параметры,ЭтаФорма));
	
	Если ЗначениеЗаполнено(СокрЛП(КлиентскийКодОбработчика)) Тогда 
		Возврат КлиентскийКодОбработчика;
	Иначе
		Возврат неопределено;
	КонецЕсли;
	
КонецФункции // ПолучитьКлиентскийКодОбработчикаНажатияКнопки()

//если мы хотим в режиме запрета модальности спросить что-то у пользователя, то его ответ требуется положить в обработчик
&НаКлиенте
Процедура ОбработчикИнтерактивногоДействияДобавленнойкнопки(РезультатКлиента,ИмяКоманды) Экспорт
	
	АкцепторДобавленнойКнопкиСервер(ИмяКоманды,РезультатКлиента);	
	
КонецПроцедуры // ОбработчикИнтерактивногоДействияДобавленнойкнопки()

&НаСервере
Процедура АкцепторДобавленнойКнопкиСервер(ИмяКоманды, РезультатКлиента = Неопределено)
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();   //нужны, например для перепроверки таб части
	СтандартнаяОбработкаEDI=истина;

	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("КнопкаФормыСообщенияНажатие",СтандартнаяОбработкаEDI,Новый Структура("ИмяКоманды,Сообщение,Параметры,Форма,РезультатКлиента",ИмяКоманды,Сообщение,Параметры,ЭтаФорма,РезультатКлиента));
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры

&НаКлиенте                                
Процедура ОбработкаОповещения(ИмяСобытияОповещения, Параметр, Источник)
	                                      //ждем  Параметр.ИмяКоманды, Параметр.Результат
	Если ИмяСобытияОповещения = "ОповещениеИзПодключаемогоМодуля" Тогда 
		АкцепторДобавленнойКнопкиСервер(Параметр.ИмяКоманды,Параметр.Результат)
	КонецЕсли;
	
КонецПроцедуры


//типы ТС Магнит
&НаКлиенте
Процедура ВыбратьТипТС()
	
	Если ЗначениеЗаполнено(Параметры.СообщениеСсылка) Тогда 
		//список типов тс
		ОригинальныйСписок=ПолучитьСписокТиповТССообщения(Сообщение);
		
		Если ОригинальныйСписок=Неопределено или ОригинальныйСписок.Количество() = 0 Тогда 
			Сообщить("Не указаны типы ТС"); 
		иначе
			Если Параметры.МодальностьЗапрещена Тогда
				Выполнить("ОригинальныйСписок.ПоказатьОтметкуЭлементов(Новый ОписаниеОповещения(""ОбработчикПослеВыбораТипаТС"", ЭтаФорма),""Выберите тип транспортного средства"")");
			Иначе
				Если ОригинальныйСписок.ОтметитьЭлементы("Выберите тип транспортного средства") Тогда 			
					ОбработчикПослеВыбораТипаТС(ОригинальныйСписок, Неопределено)
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокТиповТССообщения(Сообщение)
	
	ВходящийЗаказДокумент1С = МодульОбъекта().НайтиСвязанныйДокументПоТипуСообщения(Сообщение.Документ1С,"ORDERS");
	СообщениеORDERS = МодульОбъекта().ПрочитатьСообщение(,ВходящийЗаказДокумент1С,"ORDERS","Входящее",,);
	//открытие формы для выбора и добавления даты, времени прибытия.
	ОригинальныйСписок=СообщениеORDERS.Транспортировка.ТипТранспортногоСредства.Скопировать();
	ТекущийСписок=Сообщение.Транспортировка.ТипТранспортногоСредства.Скопировать();
	Если ТекущийСписок.Количество()>0 Тогда 
		ОригинальныйСписок=ТекущийСписок;
	КонецЕсли;
	
	Возврат ОригинальныйСписок;
	
КонецФункции // ПолучитьСписокТиповТССообщения()

&НаКлиенте
Процедура ОбработчикПослеВыбораТипаТС(Параметр=Неопределено,ДопПараметрПереданныйВОбработчик=Неопределено) Экспорт
	Если Параметр=Неопределено Тогда
		//так и не выбрали
	Иначе
		Сообщение.Транспортировка.ТипТранспортногоСредства=Параметр;
	КонецЕсли;
	
	ОбработчикПослеВыбораТипаТССервер();
	
КонецПроцедуры 

&НаСервере
Процедура ОбработчикПослеВыбораТипаТССервер()

	ПерепроверитьСообщениеСервер();

КонецПроцедуры // ОбработчикПослеВыбораТочкиСамовывозаСервер()

//Блок Особенности
&НаКлиенте
Процедура ОсобенностиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОсобенностиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсобенностиСообщенияНаФорме_ОсновнойМодуль()

	 МодульОбъекта().ЗаполнитьОсобенностиСообщенияНаФорме_УФ(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОсобенностиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПеренестиОсобенностиИПерепроверитьСообщение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобенностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	МодульОбъектаКлиент().ОсобенностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеЗакрытияУниверсальнойФормыРедактирования2(РезультатРедактирования = Неопределено, ДопПараметрыОбработчика = Неопределено) Экспорт
	
	Если РезультатРедактирования = Неопределено 
		ИЛИ ДопПараметрыОбработчика = Неопределено
		ИЛИ ДопПараметрыОбработчика.НеСохранятьВСообщение = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Состояние("Переносим особенности в сообщение", 10);
	ОбработчикПослеЗакрытияУниверсальнойФормыРедактирования2Сервер(РезультатРедактирования, ДопПараметрыОбработчика);
	
	Состояние("Проверяем сообщение", 80);
	Если НетОшибок И ТаблицаОшибок.Количество() = 0 Тогда
		ЗакрытьПанельОшибокКлиент();
		
		Если КтоМы = "Поставщик" Тогда
			ВывестиПанельИнформации("В этой форме вы можете проверить данные, которые будут отправлены в торговую сеть.");
		Иначе
			ВывестиПанельИнформации("В этой форме вы можете проверить данные, которые будут отправлены поставщику.");
		КонецЕсли;
		
	Иначе
		ОткрытьПанельОшибокКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработчикПослеЗакрытияУниверсальнойФормыРедактирования2Сервер(РезультатРедактирования, ДопПараметрыОбработчика)
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();	
	ЗначениеОсобенности = ПолучитьИзВременногоХранилища(РезультатРедактирования);
	
	МодульОбъекта().ОбработкаСобытияПодключаемогоМодуля("ПеренестиОсобенностиВСообщение",,
														Новый Структура("Сообщение, Особенности, Форма, ЗначениеОсобенности, ИдентификаторОсобенности", 
																		Сообщение, Особенности, ЭтаФорма, ЗначениеОсобенности, ДопПараметрыОбработчика.Идентификатор));
														
																		
	ПолныйПутьОсобенности = МодульОбъекта().ПолучитьПолныйПутьОсобенностиСообщения(ДопПараметрыОбработчика);
	МодульОбъекта().ПеренестиЗначениеВПолеСтруктуры(Сообщение, ПолныйПутьОсобенности, ЗначениеОсобенности);
	
	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	ПроизвестиПервоначальноеЗаполнениеПолейНаФорме();
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийОсобенностиВыборЗавершение(ВыбранноеЗначение = Неопределено, ДопПараметр = Неопределено) Экспорт

	ОсобенностьВыбранаИзСпискаВыбора = Ложь;
	
	Если Не ВыбранноеЗначение = Неопределено Тогда
		
		ОсобенностьВыбранаИзСпискаВыбора = Истина;

		Если ТипЗнч(Элементы.Особенности.ТекущиеДанные.Значение) = Тип("СписокЗначений") Тогда
			Элементы.Особенности.ТекущиеДанные.Значение.Добавить(ВыбранноеЗначение.Значение, ВыбранноеЗначение.Представление);
		Иначе
			Элементы.Особенности.ТекущиеДанные.Значение = ВыбранноеЗначение.Значение;
		КонецЕсли;
	
		ПеренестиОсобенностиИПерепроверитьСообщение();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиОсобенностиИПерепроверитьСообщение(Заглушка = Неопределено) Экспорт
	
	ПеренестиОсобенностиИПерепроверитьСообщениеВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиОсобенностиИПерепроверитьСообщениеВызовСервера()

	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();	

	МодульОбъекта().ПеренестиОсобенностиВСообщение(
	Сообщение, 
	РеквизитФормыВЗначение("Особенности"), 
	РеквизитФормыВЗначение("Товары"), 
	ЭтаФорма);

	Если НужноКонвертироватьОсобенностиВСообщении Тогда
		МодульОбъекта().КонвертироватьОсобенностиСообщения(Сообщение);
		МодульОбъекта().ЗаполнитьОсобенностиСообщенияНаФорме_УФ(ЭтаФорма);
	КонецЕсли;

	ПоместитьТаблицыЗначенийПроизвольныхРеквизитовВХранилище();
	
	ОшибокБольшеНет = ПроверитьЗаполнениеПолей();	
	Если ОшибокБольшеНет = Истина Тогда
		Сообщение.СодержитОшибки = Ложь;
	КонецЕсли;
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();

КонецПроцедуры 

&НаКлиенте
Процедура ОсобенностиПередНачаломИзменения(Элемент, Отказ)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.СписокВыбора) Тогда
		Если ТипЗнч(Элемент.ТекущиеДанные.Значение) = Тип("СписокЗначений") И ЗначениеЗаполнено(Элемент.ТекущиеДанные.СписокВыбора) Тогда
			Отказ = ОсобенностьВыбранаИзСпискаВыбора = Истина; // открыть стандартный диалог редактирования списка значений если не выбрали из списка выбора
		Иначе	
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобенностиЗначениеПриИзменении(Элемент)
	
	ПеренестиОсобенностиИПерепроверитьСообщение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобенностиЗначениеОчистка(Элемент, СтандартнаяОбработка)
	Если ТипЗнч(Элементы.Особенности.ТекущиеДанные.Значение) = Тип("СписокЗначений") Тогда
		СтандартнаяОбработка = Ложь;
		Элементы.Особенности.ТекущиеДанные.Значение.Очистить();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Возврат1СПриИзменении(Элемент)
	ПроверитьЗаполнениеПолей();
КонецПроцедуры

&НаКлиенте
Процедура Возврат1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	ВозвратЕсть = ВернутьНаличиеВозврата();
	Если ВозвратЕсть Тогда 
		СписокТипов = Новый СписокЗначений;
		СписокТипов.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
		СписокТипов.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтКлиента")); 
		МодульОбъектаКлиент().ПоказатьВыборЭлемента_КонтурEDI("ОбработкаВыбораТипаДанных", ЭтаФорма, , СписокТипов, , "Выбор типа документа");
	Иначе 
		 ВыбратьДокументДляПривязкиСообщения();
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Функция ВернутьНаличиеВозврата()
	Возврат МодульОбъекта().ЕстьНеобходимыеМетаданные("Документы.ВозвратТоваровОтКлиента",Истина);
КонецФункции	

&НаКлиенте
Процедура ОбработкаВыбораТипаДанных(ВыбранныйЭлемент, СписокПараметров) Экспорт  
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		СтруктураПараметров	= Новый Структура;
		СтруктураПараметров.Вставить("Отбор",              СтруктураОтбораДокумента);
		СтруктураПараметров.Вставить("РежимВыбора",        Истина);
		СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);
		
		ИмяОткрываемойФормы = "";
		
		Если ВыбранныйЭлемент.Значение = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			ИмяОткрываемойФормы = "Документ.КорректировкаРеализации.ФормаВыбора";
		ИначеЕсли ВыбранныйЭлемент.Значение = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
			ИмяОткрываемойФормы = "Документ.ВозвратТоваровОтКлиента.ФормаВыбора";
		КонецЕсли;
		
		МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI(ИмяОткрываемойФормы, "", СтруктураПараметров, ЭтаФорма, "Документ1СПриИзменении", ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьКакОбработанное(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ИмяКоманды = "ОтметитьКакОбработанное"; 
	
	КнопкаДействияФормыНажатие_Клиент(ИмяКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ИмяКоманды = "ПометитьНаУдаление"; 
	
	КнопкаДействияФормыНажатие_Клиент(ИмяКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереотправитьALCRPT(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	ПереотправитьALCRPT_Сервер();
	Сообщить("Теперь выполните обмен"); 
КонецПроцедуры

&НаСервере
Процедура ПереотправитьALCRPT_Сервер()

	МодульОбъекта().ЗарегистрироватьСообщениеALCRPT_К_Отправке(Сообщение);
     
КонецПроцедуры //

// Универсальная форма редактирования реквизитов
&НаСервере
Функция ПолучитьНастройкиДляФормыРедактированияДопРеквизитов(Настройка)
	
	СтрокаНастройки = Настройка[0];
		
	//Подготовим значения настроек
	НедоступныеПоляИКолонки = Новый Массив;
	НедоступныеПоляИКолонки.Добавить("ИмяРеквизита");
	
	ОтборПоДопСправочнику = МодульОбъекта().ПолучитьСтруктуру_ИзТекстаНастройкиРеквизитов(СтрокаНастройки, "ОтборПоДопСправочнику");
		
	/////
	ВключитьОбработчикиСобытий = Новый Соответствие;
	
	УниверсальнаяПроцедураПриИзменении			= КодПроцедурыПриИзмененииВыбранногоЭлементаСправочникаВДереве(СтрокаНастройки.ИмяРеквизита); 
	
	МассивСобытий = Новый Массив;
	МассивСобытий.Добавить(Новый Структура("Имя, Текст", "НачалоВыбора",		КодПроцедурыПолучитьСписокЭлементовСправочникаДляВыбора(СтрокаНастройки.ПутьЗаписиВДопСправочник, ОтборПоДопСправочнику, СтрокаНастройки)));
	МассивСобытий.Добавить(Новый Структура("Имя, Текст", "ПриИзменении",		УниверсальнаяПроцедураПриИзменении));
	МассивСобытий.Добавить(Новый Структура("Имя, Текст", "ОбработкаВыбора",		УниверсальнаяПроцедураПриИзменении));
	
	ВключитьОбработчикиСобытий.Вставить("Значение", МассивСобытий);		
			
	/////
	ВключитьОбработчикиСобытийСеврвер = Новый Соответствие;
	
	МассивСобытий = Новый Массив;
	МассивСобытий.Добавить(Новый Структура("Имя, Текст", "ПриИзменении_Сервер", КодПроцедурыПриИзмененииВыбранногоЭлементаСправочникаВДереве_Сервер()));
	
    ВключитьОбработчикиСобытийСеврвер.Вставить("Значение", МассивСобытий);
	
	/////
	ВключитьОбработчикиСобытийПосле = Новый Соответствие;
	
	МассивСобытий = Новый Массив;
	МассивСобытий.Добавить(Новый Структура("Имя, Текст", "НачалоВыбора",	КодПроцедурыОбработатьВыбранныйЭлемент()));
	
	ВключитьОбработчикиСобытийПосле.Вставить("Значение", МассивСобытий);
	
	//Запишем настройки в структуру
	НастройкиФормыРедактированияДопРеквизитов = Новый Структура;
	
	НастройкиФормыРедактированияДопРеквизитов.Вставить("ИзменятьСоставСтрок",					Ложь);
	НастройкиФормыРедактированияДопРеквизитов.Вставить("НадписьИнформация",						СтрокаНастройки.ПредставлениеРеквизита); 	
	НастройкиФормыРедактированияДопРеквизитов.Вставить("НедоступныеПоляИКолонки",				НедоступныеПоляИКолонки);
	НастройкиФормыРедактированияДопРеквизитов.Вставить("ВключитьОбработчикиСобытий",			ВключитьОбработчикиСобытий);	
	НастройкиФормыРедактированияДопРеквизитов.Вставить("ВключитьОбработчикиСобытийСеврвер",		ВключитьОбработчикиСобытийСеврвер);
	НастройкиФормыРедактированияДопРеквизитов.Вставить("ВключитьОбработчикиСобытийПосле",		ВключитьОбработчикиСобытийПосле);	
	НастройкиФормыРедактированияДопРеквизитов.Вставить("РежимВыделенияТаблицы",	РежимВыделенияТаблицы.Одиночный);
	
	Возврат НастройкиФормыРедактированияДопРеквизитов;
	
КонецФункции

&НаСервере  
Функция КодПроцедурыПолучитьСписокЭлементовСправочникаДляВыбора(ИмяСправочника, СтруктураОтбора, СтрокаНастройки)
    	
	Алгоритм = 						   		"ПоискПоСправочнику = Новый Структура;";
	Для каждого ЭлементОтбора Из СтруктураОтбора Цикл
		Алгоритм = Алгоритм + Символы.ПС + 	"ПоискПоСправочнику.Вставить(""" + ЭлементОтбора.Ключ + """," + """"+ЭлементОтбора.Значение + """);";
	КонецЦикла;
	Алгоритм = Алгоритм + Символы.ПС + 		"ВыбратьЭлементДопСправочникаИЗаполнитьПодчиненныеРеквизиты(Элемент, ""Дерево"", """ + ИмяСправочника + """, ПоискПоСправочнику, """ + СтрокаНастройки.ИмяРеквизита + """, СтандартнаяОбработка);"; 	

	Возврат Алгоритм;

КонецФункции // ()

&НаСервере  
Функция КодПроцедурыОбработатьВыбранныйЭлемент()

	Алгоритм = "ОбработатьВыбранныйЭлементДопСправочника_КонтурEDI(Параметр, ДопПараметры);";

	Возврат Алгоритм; 
	
КонецФункции

&НаСервере 
Функция КодПроцедурыПриИзмененииВыбранногоЭлементаСправочникаВДереве(ИмяРеквизита)
	
	Алгоритм =							"ЕщеПараметры = Новый Структура(""Дерево_ИмяЭлемента"", ""Дерево"");";
	Алгоритм = Алгоритм + Символы.ПС + 	"УниверсальныйОбработчикСобытияПриИзменении_Сервер(Элемент.Имя, ЕщеПараметры);";  

	Возврат Алгоритм;

КонецФункции // ()

&НаСервере 
Функция КодПроцедурыПриИзмененииВыбранногоЭлементаСправочникаВДереве_Сервер()

	Алгоритм = "ПриИзмененииВыбранногоЭлементаСправочникаВДереве_Сервер(ЕщеПараметры);";
	
	Возврат Алгоритм;

КонецФункции // ()

&НаКлиенте  
Процедура ЕщеДополнительныеРеквизиты_Нажатие(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	АдресВХ_СтруктураРеквизитов = ПолучитьСтруктуруРеквизитов_И_ВернутьАдресВХ(Сообщение, Команда.Имя);
		
	Если ЗначениеЗаполнено(АдресВХ_СтруктураРеквизитов) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресВХ_СтруктураРеквизитов",	АдресВХ_СтруктураРеквизитов);
				
		МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("УниверсальнаяФормаРедактированияУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослеЗакрытияУниверсальнойФормыРедактирования", ЭтаФорма, ПараметрыФормы);

	КонецЕсли;
		
КонецПроцедуры 

&НаСервере
Процедура ОбработчикПослеЗакрытияУниверсальнойФормыРедактирования(СтруктураРезультата = Неопределено,ДопПараметрПереданныйВОбработчик = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(СтруктураРезультата) Тогда
		
		НастройкаРеквизитов	= МодульОбъекта().ПолучитьНастройкуРеквизитов_КонтурEDI(Новый Структура("ИмяРеквизита", СтруктураРезультата.ИмяРеквизита)); 
		
		РезультатСохраненияРеквизитов = ПолучитьИзВременногоХранилища(СтруктураРезультата.АдресСохраненногоЗначения);
		
		МодульОбъекта().ОбработатьСохраненныйИзУниверсальнойФормыРедактированияРезультат(Сообщение, РезультатСохраненияРеквизитов,	НастройкаРеквизитов); 
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьСтруктуруРеквизитов_И_ВернутьАдресВХ(Сообщение, ИмяРеквизитов)
	
	АдресВХ_СтруктураРеквизитов = Неопределено;
	
	СтруктураРеквизита = Новый Структура;
	СтруктураРеквизита.Вставить("ИмяРеквизита",		ИмяРеквизитов); 
	СтруктураРеквизита.Вставить("ДеревоЗначения",	Неопределено);
	
	МодульОбъекта().ПолучитьДеревоДопРеквизитов_ДляРедактирования(СтруктураРеквизита, Сообщение);

	Если ЗначениеЗаполнено(СтруктураРеквизита.ДеревоЗначения) Тогда
		СтруктураРеквизита.Вставить("НастройкаФормы", ПолучитьНастройкиДляФормыРедактированияДопРеквизитов(СтруктураРеквизита.НастройкаРеквизитов));
		
        АдресВХ_СтруктураРеквизитов			 = ПоместитьВоВременноеХранилище(СтруктураРеквизита);
	КонецЕсли;
	
	Возврат АдресВХ_СтруктураРеквизитов;

КонецФункции // ПолучитьДерервоДопРеквизитовИВернутьАдресВХ()

&НаСервере
Функция ПолучитьПечатнуюФормуСообщения_КарточкаСообщения_Сервер()

	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();

	Результат = МодульОбъекта().ПолучитьПечатнуюФормуСообщения("ПечатнаяФорма_" + Сообщение.ТипСообщения, Сообщение);
	
    УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	Возврат Результат;

КонецФункции // ПолучитьПечатнуюФормуСообщения_КарточкаСообщения_Сервер()
 
&НаКлиенте
Процедура НапечататьСообщение(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Результат = ПолучитьПечатнуюФормуСообщения_КарточкаСообщения_Сервер();
	
	Если Результат.Успешно Тогда
		
		Результат.ТабДок.Показать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныеПозицииПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	Сообщение.Договор = Договор;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыМаркируемойПродукцииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокЗначенийВыбора = ПолныйСписокТиповМаркируемойПродукции();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокЗначенийВыбора", СписокЗначенийВыбора);
	ПараметрыФормы.Вставить("ВыборНесколькихЗначений", Истина);
	ПараметрыФормы.Вставить("МодальностьЗапрещена", Параметры.МодальностьЗапрещена);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("УниверсальнаяФормаВыбораУправляемая",
												 Неопределено,
												 ПараметрыФормы,
												 ЭтаФорма,
												 "ОбработкаВыбораТиповМаркируемойПродукции",
												 ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораТиповМаркируемойПродукции(РезультатВыбораТиповПродукции, ДополнительныеРеквизиты = Неопределено) Экспорт
	
	Если Не ТипЗнч(РезультатВыбораТиповПродукции) = Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ТипыМаркируемойПродукции.Очистить();
	
	Для каждого ТипПродукции Из РезультатВыбораТиповПродукции Цикл
		
		Если ТипПродукции.Пометка = Истина Тогда
			ТипыМаркируемойПродукции.Добавить(ТипПродукции.Значение, ТипПродукции.Представление, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщение.ТипыМаркируемойПродукции = ТипыМаркируемойПродукции.Скопировать();
	
КонецПроцедуры

&НаКлиенте
Функция ПолныйСписокТиповМаркируемойПродукции()
	                                                                        
	ПеречислениеТипыМаркированнойПродукции = КлассификаторПеречислений().Получить("ТипыМаркированнойПродукцииСписокЗначений");
	
	Если ПеречислениеТипыМаркированнойПродукции = Неопределено Тогда
		ПолныйСписокТипов = Новый СписокЗначений;
	Иначе
		ПолныйСписокТипов = ПеречислениеТипыМаркированнойПродукции.Скопировать()
	КонецЕсли;
		
	Для каждого ТипПродукции Из ТипыМаркируемойПродукции Цикл
		
		ТипПродукцииВПолномСписке = ПолныйСписокТипов.НайтиПоЗначению(ТипПродукции.Значение);
		
		Если ТипПродукцииВПолномСписке = Неопределено Тогда
			ПолныйСписокТипов.Добавить(ТипПродукции.Значение, ТипПродукции.Представление, Истина);
		Иначе
			ТипПродукцииВПолномСписке.Пометка = Истина;
		КонецЕсли;
				
	КонецЦикла;
	
	Возврат ПолныйСписокТипов;
	
КонецФункции

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	Если Сообщение.Направление = "Исходящее" Тогда
		
		Элементы.Комментарий.ЦветФона = WebЦвета.Белый;
		
		Сообщение.Вставить("Комментарий", Комментарий);
				
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтгрузку(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ПараметрыФормы = Новый Структура("СообщениеСсылка",			Сообщение.СообщениеСсылка); 
	ПараметрыФормы.Вставить("Документ1С",						Сообщение.Документ1С);
	ПараметрыФормы.Вставить("ТипСообщения",						Сообщение.ТипСообщения);
	ПараметрыФормы.Вставить("Направление",						Сообщение.Направление);
	ПараметрыФормы.Вставить("ТолькоПросмотр",					Ложь);
	ПараметрыФормы.Вставить("КодДействия",						"Отправить_");
	ПараметрыФормы.Вставить("РежимРаботы",						Параметры.РежимРаботы);
	ПараметрыФормы.Вставить("АдресХранилища",					Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект);
	ПараметрыФормы.Вставить("ПараметрыАвтотестирования",		Параметры.ПараметрыАвтотестирования);
	ПараметрыФормы.Вставить("ПереотправляемоеСообщениеСсылка",	Сообщение.СообщениеСсылка);
	
	Если Параметры.ПроизвольныеПараметры = Неопределено Тогда 
		ПроизвольныеПараметры = Новый Структура;
	Иначе
		ПроизвольныеПараметры = Параметры.ПроизвольныеПараметры;	
	КонецЕсли;
	
	ПроизвольныеПараметры.Вставить("Статус", "Отменить");
	
	ПараметрыФормы.Вставить("ПроизвольныеПараметры", ПроизвольныеПараметры);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("ФормаСообщенияУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослеЗакрытияКарточкиПереотправкиСообщения", ЭтаФорма);

КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуКодовМаркировкиВсехТоваровНаСервере(ВключатьТоварыБезКодов = Ложь, ИмяКолонкиКодов = "КодыМаркировки")
	
	Попытка
		
		ТаблицаТоваров = РеквизитФормыВЗначение("Товары");
		ДеревоУпаковок = РеквизитФормыВЗначение("ТранспортныеУпаковки");
		
		ТаблицаКодов = МодульОбъекта().РазвернутаяТаблицаКодовМаркировки_КонтурEDI(ТаблицаТоваров, 
																				   ДеревоУпаковок, 
																				   ВключатьТоварыБезКодов, 
																				   ИмяКолонкиКодов);
																				   
		АдресВоВХ = ПоместитьВоВременноеХранилище(ТаблицаКодов, ЭтаФорма.УникальныйИдентификатор);
		
	Исключение
		
		УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
		ТекстОшибки = "Не удалось поместить коды маркировки товаров сообщения - " + ОписаниеОшибки();
		МодульОбъекта().ЗаписьЖурналаРегистрации_КонтурEDI(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;				
		
	КонецПопытки;
	
	Возврат АдресВоВХ;
	
КонецФункции

&НаСервере
Функция ПоместитьТаблицуКодовМаркировкиТоваровУпаковкиНаСервере(ИдентификаторСтрокиУпаковки)
	
	Попытка
	
		ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
		
		ВыбраннаяУпаковка = ТранспортныеУпаковки.НайтиПоИдентификатору(ИдентификаторСтрокиУпаковки);
		КоллекцияТоваровУпаковки = ВыбраннаяУпаковка.ПолучитьЭлементы();
		ТранспортныеУпаковкиДерево = РеквизитФормыВЗначение("ТранспортныеУпаковки");
		
		АдресВоВХ = МодульОбъекта().ПоместитьТаблицуКодовМаркировкиТоваровУпаковки(
			Сообщение.Товары, ТранспортныеУпаковкиДерево, КоллекцияТоваровУпаковки, ЭтаФорма.УникальныйИдентификатор);
		
		УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	Исключение
		
		УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
		ТекстОшибки = "Не удалось поместить коды маркировки товаров упаковки - " + ОписаниеОшибки();
		МодульОбъекта().ЗаписьЖурналаРегистрации_КонтурEDI(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;				
		
	КонецПопытки;
	
	Возврат АдресВоВХ;
	
КонецФункции

&НаКлиенте
Процедура РазместитьКаждыйТоварВОтдельнойУпаковке(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если ТранспортныеУпаковки.ПолучитьЭлементы().Количество() > 0 Тогда
		
		ТекстВопроса = "Текущее распределение товаров по транспортным упаковкам будет очищено и перезаполнено. Продолжить?" ;
		ИмяОбработчика = "РазместитьКаждыйТоварВОтдельнойУпаковкеОбработкаВопроса";
		ПараметрыОбработчика = Неопределено;
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить("Да, перезаполнить");
		СписокКнопок.Добавить("Нет");
	
		МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI(ИмяОбработчика, ЭтаФорма, ПараметрыОбработчика, ТекстВопроса, СписокКнопок);

	Иначе
		
		РазместитьКаждыйТоварВОтдельнойУпаковкеЗавершение();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазместитьКаждыйТоварВОтдельнойУпаковкеОбработкаВопроса(РезультатВопроса, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВопроса = "Да, перезаполнить" Тогда
		
		РазместитьКаждыйТоварВОтдельнойУпаковкеЗавершение();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазместитьКаждыйТоварВОтдельнойУпаковкеЗавершение()
	
	ТранспортныеУпаковки.ПолучитьЭлементы().Очистить();
	ОбновитьДанныеРазмещения();
	
	МассовоеДействие = Истина;
	
	Для каждого СтрокаТовара Из ТоварныеПозиции Цикл
	
		СтрокаУпаковки = ДобавитьНовуюУпаковку(,,,МассовоеДействие);
		РазместитьТоварнуюПозицию(СтрокаТовара, СтрокаУпаковки, МассовоеДействие);
	
	КонецЦикла;
	
	ПронумероватьУпаковкиСквознымПорядковымНомером();
	ПроименоватьУпаковки(ТранспортныеУпаковки.ПолучитьЭлементы());
	
	ОбновитьДанныеРазмещения("РазместитьКаждыйТоварВОтдельнойУпаковкеЗавершение");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредставлениеКодовМаркировкиТранспортныхУпаковок(ДеревоТранспортныхУпаковок, ТолькоПросмотрСообщения)
	
	Для каждого Упаковка Из ДеревоТранспортныхУпаковок.ПолучитьЭлементы() Цикл
		
		КодыУпаковки = КодыМаркировкиУпаковкиТоваров(Упаковка);
		КоличествоКодовУпаковки = КодыУпаковки.Количество();
		
		Если ЗначениеЗаполнено(КоличествоКодовУпаковки)
			ИЛИ ТолькоПросмотрСообщения = Истина Тогда
			
			ПредставлениеКодов = "Выбрано: " + Строка(КоличествоКодовУпаковки);
			
		Иначе
			
			ПредставлениеКодов = "Коды не выбраны";
			
		КонецЕсли;
		
		Упаковка.КодыМаркировкиПредставление = ПредставлениеКодов;
	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Функция КодыМаркировкиУпаковкиТоваров(Упаковка)
	
	КодыМаркировкиУпаковки = Новый СписокЗначений;
	
	Для каждого Товар Из Упаковка.ПолучитьЭлементы() Цикл
		
		КодыМаркировкиТовара = Товар.КодыМаркировки;
		
		Если НЕ ЗначениеЗаполнено(КодыМаркировкиТовара) Тогда
			Продолжить;
		КонецЕсли;
		
		КодыМаркировкиУпаковки = МодульОбъектаКлиент().ОбъединитьСпискиЗначений(КодыМаркировкиУпаковки, КодыМаркировкиТовара);
		
	КонецЦикла;

	Возврат КодыМаркировкиУпаковки;
	
КонецФункции

&НаКлиенте
Процедура КодыМаркировкиУпаковок(Команда)               
	
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
	ОткрытьФормуРаспределенияКодовМаркировки();
												 
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРаспределенияКодовМаркировки()
	
	ПараметрыФормы = ПолучитьПараметрыФормыКодовМаркировки();
		
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сервис_КодыМаркировкиВУпаковкахУправляемая",
												 ,
												 ПараметрыФормы,
												 ЭтаФорма,
												 "ОбработчикЗакрытияФормыКодовМаркировки",
												 ЭтаФорма);

	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПросмотраДоверенностей() Экспорт
	
	ПараметрыФормы = ПараметрыФормыИнформацииОДоверенностях();
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сервис_ПодробнаяИнформация_Управляемая",, ПараметрыФормы, ЭтаФорма,, ЭтаФорма);	
    
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыИнформацииОДоверенностях()
	
	ПредставлениеДоверенностейТабличныйДокумент = МодульОбъекта().Представление_МашиночитаемыеДоверенностиСообщения_ТабличныйДокумент(ДоверенностиСообщения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",	"Данные МЧД");
	ПараметрыФормы.Вставить("ПодробнаяИнформацияТабличныйДокумент", ПредставлениеДоверенностейТабличныйДокумент);
	ПараметрыФормы.Вставить("УровеньГруппировокПриОткрытии", 1);
	
	Возврат ПараметрыФормы;
	
КонецФункции

//{ Центр поддержки

&НаКлиенте
Процедура ПомощьЦентрПоддержкиОшибкиСообщения(Команда)
	
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
	ОбращениеВЦентрПоддержкиПоОшибкам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбращениеВЦентрПоддержкиПоОшибкам() Экспорт
	
	ДопКонтекстДляЦентраПоддержки = Новый Структура;
	ДопКонтекстДляЦентраПоддержки.Вставить("МассивОшибок", МассивОшибокСообщения_КонтурEDI());
	ДопКонтекстДляЦентраПоддержки.Вставить("Сообщение", Сообщение);
			
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПараметрыСессии", МодульОбъектаКлиент().СформироватьПараметрыЦентраПоддержки(ДопКонтекстДляЦентраПоддержки));
	
	МодульОбъектаКлиент().ОткрытьЦентрПоддержки(ДопПараметры);
	
КонецПроцедуры 

&НаКлиенте
Функция МассивОшибокСообщения_КонтурEDI()
	
	МассивОшибок = Новый Массив;
	
	Для Каждого СтрокаОшибки Из ТаблицаОшибок Цикл
		
		Если МассивОшибок.Найти(СтрокаОшибки.ТекстОшибки) = Неопределено Тогда
			
			МассивОшибок.Добавить(СтрокаОшибки.ТекстОшибки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивОшибок;
	
КонецФункции 


//}   

&НаКлиенте
Процедура ОткрытьФормуДокументаУчетаМаркировка()
	
	ОбщийМодуль_ВзаимодействиеКонтурМаркировкаКлиент = МодульОбъектаКлиент().ОбщийМодуль1С_КонтурEDI("ВзаимодействиеКонтурМаркировкаКлиент");
	
	Если ОбщийМодуль_ВзаимодействиеКонтурМаркировкаКлиент <> Неопределено Тогда 
		ДокументСодержащийКоды = ОпределитьДокументСодержащийКодыМаркировки();	
		
		Попытка
		    МодульМаркировкиКлиент = ОбщийМодуль_ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент();
			ДокументУчета = МодульМаркировкиКлиент.НайтиИлиСоздатьДокументУчетаПоДокументу1С(ДокументСодержащийКоды, ЭтаФорма);
			
			ПослеЗакрытия = Новый Структура("Обработчик,Модуль,ДопПараметры");
			ПослеЗакрытия.Обработчик 	= "ОбработчикПослеИсправленияОшибки";
			ПослеЗакрытия.Модуль 		= ЭтаФорма;
			МодульМаркировкиКлиент.ОткрытьФормуДокументаУчета(ДокументУчета, ЭтаФорма, ПослеЗакрытия);
		Исключение
			Попытка
				ОбщийМодуль_ВзаимодействиеКонтурМаркировкаКлиент.ОткрытьФормуДокументаУчетаПоДокументу1С(ДокументСодержащийКоды, ЭтаФорма);
			Исключение
				ОбщийМодуль_ВзаимодействиеКонтурМаркировкаКлиент.ОткрытьФормуДокументаУчетаПоДокументу1С(ДокументСодержащийКоды);
			КонецПопытки;
		КонецПопытки;

	КонецЕсли;   			

КонецПроцедуры

&НаСервере
Функция ОпределитьДокументСодержащийКодыМаркировки()
	
	Возврат МодульОбъекта().ОпределитьДокументСодержащийКодыМаркировки(Сообщение);
	
КонецФункции

////////// Взаимодействие с Логистикой
///////////////////////////////

&НаКлиенте
Процедура ОбработчикОповеститьОВыполненииКоманды(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт

	КонтурЛогистика_ОбновитьСостояниеЭлементаФормы();
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтурЛогистика_ОткрытьПеревозочныеНажатие(Команда)

	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
	КонтурЛогистика_ОткрытьПеревозочные();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтурЛогистика_ОткрытьПеревозочные()
	
	ИсходныеДокументы = КонтурЛогистика_ИсходныеДокументы(Сообщение);
	КонтурЛогистика_ИнтеграцияКонтурКлиент().ПеревозочныеНажатие(ЭтаФорма, ИсходныеДокументы);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КонтурЛогистика_ИсходныеДокументы(Сообщение)
	
	ИсходныеДокументы = Новый Массив;
	ИсходныеДокументы.Добавить(Сообщение.Накладная1С);
	Возврат ИсходныеДокументы;

КонецФункции

&НаКлиенте
Функция КонтурЛогистика_ИнтеграцияКонтурКлиент()
	
	МодульКонтурЛогистика_ИнтеграцияКонтурКлиент = 
	МодульОбъектаКлиент().ОбщийМодуль1С_КонтурEDI("КонтурЛогистика_ИнтеграцияКонтурКлиент");
	Возврат МодульКонтурЛогистика_ИнтеграцияКонтурКлиент;

КонецФункции

&НаСервере
Функция КонтурЛогистика_ПользовательИмеетПравоКПодсистеме() 
	Возврат КонтурЛогистика_ИнтеграцияКонтурСервер().УТекПользователяЕстьПраваКПодсистеме();	
КонецФункции

&НаСервере
Функция КонтурЛогистика_ЕстьПрограммныйИнтерфейсСервер()
	
	МодульКонтурЛогистика_ИнтеграцияКонтурСервер = КонтурЛогистика_ИнтеграцияКонтурСервер();
	ЕстьПрограммныйИнтерфейс = МодульКонтурЛогистика_ИнтеграцияКонтурСервер <> Неопределено;
	
	Возврат ЕстьПрограммныйИнтерфейс;
	
КонецФункции

&НаСервере
Функция КонтурЛогистика_ИнтеграцияКонтурСервер()
	
	МодульКонтурЛогистика_ИнтеграцияКонтурСервер = 
	МодульОбъекта().ОбщийМодуль1С_КонтурEDI("КонтурЛогистика_ИнтеграцияКонтурСервер");
	Возврат МодульКонтурЛогистика_ИнтеграцияКонтурСервер;

КонецФункции

&НаСервере
Процедура КонтурЛогистика_ОбновитьСостояниеЭлементаФормы()
	
	Если КонтурЛогистика_ЕстьПрограммныйИнтерфейсСервер() Тогда
		
		РезультатСтруктура = КонтурЛогистика_СостояниеПоДокументамНаСервере();
		
		Элементы.КонтурЛогистика_ОткрытьПеревозочные.Заголовок = РезультатСтруктура.Заголовок;
		Элементы.КонтурЛогистика_ОткрытьПеревозочные.Картинка = РезультатСтруктура.Картинка;
		ЭтаФорма.Команды.КонтурЛогистика_ОткрытьПеревозочные.Подсказка = РезультатСтруктура.Подсказка;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция КонтурЛогистика_СостояниеПоДокументамНаСервере()
	
	ИсходныеДокументы = КонтурЛогистика_ИсходныеДокументы(Сообщение);
	СтруктураЗадач = КонтурЛогистика_ИнтеграцияКонтурСервер().СостояниеЭПД(ИсходныеДокументы);
	
	Возврат СтруктураЗадач;
	
КонецФункции

&НаСервере
Процедура КонтурЛогистика_НастроитьЭлементыФормы()
	
	Если Сообщение.ТипСообщения = "DESADV"
		ИЛИ Сообщение.ТипСообщения = "INVOIC" Тогда
		
		ЕстьДоступКПодсистеме = КонтурЛогистика_ЕстьПрограммныйИнтерфейсСервер()
									И КонтурЛогистика_ПользовательИмеетПравоКПодсистеме();
									
		Если ЕстьДоступКПодсистеме Тогда
			КонтурЛогистика_ОбновитьСостояниеЭлементаФормы();
			Элементы.КонтурЛогистика_ОткрытьПеревозочные.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

////////// Выгрузка данных для диагностики
///////////////////////////////

&НаКлиенте
Процедура СохранитьФайлаАрхиваВЛокальныйКаталогЗавершение(ВыбранныеФайлы, ДополнительныеПараметры)  Экспорт
	
	УдалитьИзВременногоХранилища(ДополнительныеПараметры.АдресВременногоХранилища);
	
	ИмяФайла = ДополнительныеПараметры.ДиалогВыбораФайла.ПолноеИмяФайла;
	
	Файл = Новый Файл(ИмяФайла);
	
	Если Файл.Существует() Тогда
		Сообщить(НСтр("ru = 'Файл архива сохранен в каталог: '") + ИмяФайла);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлаАрхиваВЛокальныйКаталог_КонтурEDI(ФайлАрхива)
	
	Если НЕ ЭтоАдресВременногоХранилища(ФайлАрхива.АдресВременногоХранилища) Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Не удалось получить файл с данными. Причина: Отсутствует адрес файла во временном хранилище.'");
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
				
		Возврат;
		
	КонецЕсли;
	
	ЗаголовокДиалога = "Укажите каталог, в который нужно сохранить файл архива.";
	Фильтр			 = "Файл архива (*.zip)|*.zip";
	
	ОписаниеФайлаАрхива = Новый ОписаниеПередаваемогоФайла(ФайлАрхива.Имя, 
												  		   ФайлАрхива.АдресВременногоХранилища);
	
	ПолучаемыеФайлы = Новый Массив; 		
	ПолучаемыеФайлы.Добавить(ОписаниеФайлаАрхива);
	
	МодульОбъектаКлиент().ОткрытьДиалогВыбораФайла_КонтурEDI("СохранитьФайлаАрхиваВЛокальныйКаталогЗавершение", 
															  ЭтаФорма,
															  ФайлАрхива,, 
															  Фильтр, 
															  ЗаголовокДиалога, 
															  РежимДиалогаВыбораФайла.Сохранение, 
															  ПолучаемыеФайлы);	
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеЦепочкиДокументаСообщенияНаСервере()
	
	ВосстановитьТаблицыЗначенийПроизвольныхРеквизитовИзХранилища();
	
	ДокументСсылка = ОпределитьДокументДляПоискаСвязанныхСообщений(Сообщение);
			
	РезультатПодготовки = МодульОбъекта().Диагностика_ПодготовитьДанныеЦепочкиДокументаСообщения(ДокументСсылка, Сообщение);
	
	УничтожитьТаблицыЗначенийПроизвольныхРеквизитов();
	
	Возврат РезультатПодготовки;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьДанныеДляДиагностики(Команда)
	
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	РезультатПодготовки = ПодготовитьДанныеЦепочкиДокументаСообщенияНаСервере();
	
	Если РезультатПодготовки.Успешно Тогда
		СохранитьФайлаАрхиваВЛокальныйКаталог_КонтурEDI(РезультатПодготовки.ФайлАрхива);
	Иначе
		МодульОбъектаКлиент().Предупреждение_КонтурEDI(РезультатПодготовки.ТекстОшибки);		
	КонецЕсли;
	
КонецПроцедуры


ВнешнееХранилище = Ложь;
