&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

&НаКлиенте
Перем МодульОбменКлиент;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

&НаКлиенте
Функция МодульОбменКлиент()
	
	Если ТипЗнч(МодульОбменКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбменКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбменКлиент = ОсновнаяФорма.МодульОбменКлиент();
		Возврат МодульОбменКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

// } СЛУЖЕБНЫЕ

//обработчики -------------------------------------------------------------------------------------

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда 
		ВыборДляОрганизации = Параметры.Организация;
		ЭтаФорма.Заголовок = "Выберите сертификат";
	КонецЕсли;                                       

	Если ЗначениеЗаполнено(Параметры.Сертификат) Тогда 
		ТекущийСертификат = Параметры.Сертификат;
	КонецЕсли;                                       
	
	Если Параметры.ПоказыватьФлагЗапомнитьВыбор = Истина Тогда
		//Элементы.ЗапомнитьВыбор.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

//заполнение данных о серверных сертификатах ------------------------------------------------------

&НаСервере
Функция МассивСертификатовНаСервере()
	
	Возврат МодульОбъекта().МассивСертификатов_КонтурEDI();
	
КонецФункции

//-------------------------------------------------------------------------------------------------

//обработчики

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Состояние("Получение списка клиентских сертификатов...",50);	
	
	ЗаполнитьСписокСертификатовКлиент();
	
	Состояние("");
	
	НоваяМетрика().Категория("Сертификаты_СписокУправляемая").ОткрытаФорма(ЭтаФорма)
					.Метка(СписокСертификатов.Количество()).ПоместитьВОчередь();
		
КонецПроцедуры

&НаКлиенте
Процедура СписокСертификатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	НоваяМетрика().Категория("Сертификаты_СписокУправляемая").Выбор("Сертификат").НаФорме(ЭтаФорма).ПоместитьВОчередь();
	
	РезультатВыбора = Новый Структура;
	РеквизитыСертификата = Новый Структура;
	
	ТекущиеДанные = Элементы.СписокСертификатов.ТекущиеДанные;
	
	РеквизитыСертификата.Вставить("Информация", ТекущиеДанные.Информация);
	РеквизитыСертификата.Вставить("НаименованиеОрганизацииСубъекта", ТекущиеДанные.НаименованиеОрганизацииСубъекта);
	РеквизитыСертификата.Вставить("НаименованиеСубъекта", ТекущиеДанные.НаименованиеСубъекта);
	РеквизитыСертификата.Вставить("НаименованиеУдостоверяющегоЦентра", ТекущиеДанные.НаименованиеУдостоверяющегоЦентра);
	РеквизитыСертификата.Вставить("НачалоПериодаДействия", ТекущиеДанные.НачалоПериодаДействия);
	РеквизитыСертификата.Вставить("ОкончаниеПериодаДействия", ТекущиеДанные.ОкончаниеПериодаДействия);
	РеквизитыСертификата.Вставить("Отпечаток", ТекущиеДанные.Отпечаток);
	РеквизитыСертификата.Вставить("Расположение", ТекущиеДанные.Расположение);
	РеквизитыСертификата.Вставить("РеквизитыСубъекта", ТекущиеДанные.РеквизитыСубъекта);
	РеквизитыСертификата.Вставить("СвойстваСертификата", ТекущиеДанные.СвойстваСертификата);
	
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("Действие",   					"ВыборСертификата");
	РезультатВыбора.Вставить("Организация",   				ВыборДляОрганизации);
	РезультатВыбора.Вставить("СертификатДействуетПо",   	РеквизитыСертификата.ОкончаниеПериодаДействия);
	РезультатВыбора.Вставить("РеквизитыСертификата",		РеквизитыСертификата);
	РезультатВыбора.Вставить("Отпечаток",   				ТекущиеДанные.Отпечаток);
	РезультатВыбора.Вставить("Расположение",   				ТекущиеДанные.Расположение);
	РезультатВыбора.Вставить("ЗапомнитьВыбор",				ИспользоватьПоУмолчанию);
	
	Этаформа.Закрыть(РезультатВыбора);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработчикПослеЗакрытияИнформацииСертификат(ДопПараметр, ДополнительныеПараметры = Неопределено) Экспорт
	
КонецПроцедуры

//заполнение данных о клиентских сертификатах ------------------------------------------------------

&НаКлиенте
Процедура ЗаполнитьСписокСертификатовКлиент()
			
	МассивСертификатов = МодульОбменКлиент().МассивСертификатовНаКлиенте();
	
	Для Каждого СертификатНаСервере Из МассивСертификатовНаСервере() Цикл
		МассивСертификатов.Добавить(СертификатНаСервере);
	КонецЦикла;	
	
	Для Каждого СвойстваСертификата Из МассивСертификатов Цикл
		СтрокаСертификата = СписокСертификатов.Добавить();
		
		ФИО = СокрЛП(Строка(СвойстваСертификата.Субъект.Фамилия) + " " + Строка(СвойстваСертификата.Субъект.Имя) + " " + Строка(СвойстваСертификата.Субъект.Отчество));
		ИНН = СокрЛП(?(ЗначениеЗаполнено(СвойстваСертификата.Субъект.ИННЮЛ), СвойстваСертификата.Субъект.ИННЮЛ, СвойстваСертификата.Субъект.ИНН));
		НаименованиеОрганизацииСубъекта = ?(ЗначениеЗаполнено(СвойстваСертификата.Субъект.Организация), СвойстваСертификата.Субъект.Организация, ФИО); 	
		
		СтрокаСертификата.НаименованиеОрганизацииСубъекта = ?(ЗначениеЗаполнено(НаименованиеОрганизацииСубъекта), НаименованиеОрганизацииСубъекта, "<Неизвестно>");
		
		ДанныеДляЗаполнения = Новый Массив;
		Если ЗначениеЗаполнено(ИНН) Тогда
			ДанныеДляЗаполнения.Добавить("ИНН: " + ИНН);
		Иначе
			ДанныеДляЗаполнения.Добавить("ИНН: <Неизвестно>");			
		КонецЕсли;
		Если ЗначениеЗаполнено(ФИО) Тогда
			ДанныеДляЗаполнения.Добавить(ФИО);
		КонецЕсли;
		Если ЗначениеЗаполнено(СвойстваСертификата.ДатаОкончания) И РассчитатьОсталосьДнейДействияСертификата(СвойстваСертификата.ДатаОкончания) <= 30 Тогда
			ДанныеДляЗаполнения.Добавить("Действует до " + Формат(СвойстваСертификата.ДатаОкончания, "ДЛФ=ДД"));
		КонецЕсли;
		
		Представление = "";
		Для Каждого Строка Из ДанныеДляЗаполнения Цикл
			Представление = Представление + Строка + Символы.ПС;			
		КонецЦикла;                                             
		
		СтрокаСертификата.Представление = Представление; 
		
		СтрокаСертификата.НаименованиеСубъекта = ФИО;
		СтрокаСертификата.НаименованиеУдостоверяющегоЦентра = СвойстваСертификата.Издатель.Организация;
		СтрокаСертификата.Отпечаток = СвойстваСертификата.Отпечаток;
		СтрокаСертификата.Расположение = СвойстваСертификата.Расположение;
		СтрокаСертификата.РасположениеПользовательское = ?(СвойстваСертификата.Расположение = "клиент", "локально", "на сервере");
		СтрокаСертификата.НачалоПериодаДействия = СвойстваСертификата.ДатаНачала;
		СтрокаСертификата.ОкончаниеПериодаДействия = СвойстваСертификата.ДатаОкончания;
		СтрокаСертификата.РеквизитыСубъекта = ?(ЗначениеЗаполнено(СвойстваСертификата.Субъект.ИННЮЛ), СвойстваСертификата.Субъект.ИННЮЛ, СвойстваСертификата.Субъект.ИНН);
		СтрокаСертификата.СвойстваСертификата = СвойстваСертификата;
		СтрокаСертификата.Картинка = Истина;
		СтрокаСертификата.Информация = Истина;
		СтрокаСертификата.КартинкаСервер = Ложь;

		Если ТекущийСертификат <> Неопределено Тогда // найдём текущий сертификат в списке
			Если СтрокаСертификата.Отпечаток = ТекущийСертификат.Отпечаток И СтрокаСертификата.Расположение = ТекущийСертификат.Расположение Тогда
				Элементы.СписокСертификатов.ТекущаяСтрока = СписокСертификатов.Индекс(СтрокаСертификата);
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Функция РассчитатьОсталосьДнейДействияСертификата(ОкончаниеПериодаДействия)

	Возврат Окр((НачалоДня(ОкончаниеПериодаДействия) - НачалоДня(ТекущаяДата())) / (60*60*24));	

КонецФункции

&НаКлиенте
Процедура Выбрать(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	СписокСертификатовВыбор(Команда, "", Элементы.Выбрать, "");

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
 	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "Сертификаты_СписокУправляемая");
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Информация(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	ТекущиеДанные = Элементы.СписокСертификатов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ПредставлениеСертификата = МодульОбменКлиент().ПолноеПредставлениеСертификатаПоОтпечатку(ТекущиеДанные.Отпечаток, ТекущиеДанные.Расположение); 
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("Заголовок",	"Данные сертификата");
	ПараметрыФормы.Вставить("ПодробнаяИнформация",	ПредставлениеСертификата);
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сервис_ПодробнаяИнформация_Управляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикПослеЗакрытияИнформацииСертификат", ЭтаФорма);		
КонецПроцедуры

&НаКлиенте
Процедура СписокСертификатовПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.СписокСертификатов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

