&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

// Служебные

&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули();
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	Партнер = Параметры.Сообщение.Партнер;
	
	Направление = Параметры.Сообщение.Направление;
		
	Если Направление = "Входящее" Тогда
		ИсходноеНаименованиеПартнера = Параметры.НаименованиеПартнера;
		ИсходныйGTIN = Параметры.ИдентификаторыТовара.GTIN;
		ИсходныйКодЕдиницыИзмеренияEDI = Параметры.ИдентификаторыТовара.КодЕдиницыИзмеренияEDI;
		ИсходныйКодТовараПартнера = Параметры.ИдентификаторыТовара.КодТовараПартнера;	
		КодТовараВнутренний = Параметры.ИдентификаторыТовара.КодТовараВнутренний;
	Иначе
		Документ1С = Параметры.Документ1С;
		Номенклатура = Параметры.Номенклатура;
		ХарактеристикаНоменклатуры = Параметры.ХарактеристикаНоменклатуры;
		ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
	КонецЕсли;
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФорму()
	
	ОбновитьНастройкиСоответствий();
	ОбновитьПараметрыФормыСоответствия();
	ОбновитьИнформациюОСоответствиях();
	ОбновитьНастройкиЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиЭлементов()
	
	Элементы.ДанныеСообщения.Видимость = (Направление = "Входящее");
	Элементы.ДанныеДокумента.Видимость = НЕ (Направление = "Входящее");	
	
	Элементы.ОткрытьСоответствие.Заголовок = ЗаголовокДействия;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиСоответствий()
	
	НастройкиСопоставления = МодульОбъекта().ПолучитьПредставлениеНастроекСопоставленияПартнера(Партнер);
	
	Элементы.ГиперссылкаНастройки.Заголовок = НастройкиСопоставления;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикИзмененияНастроекПартнера(Результат, Параметры) Экспорт
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаИзменитьНастройкиНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ОткрытьФормуПартнера("Настройки", "Особенности кодов товара");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОСоответствиях()
	
	Инфо = МодульОбъекта().ПолучитьПодсказкуДляФормыСоответствия(ЕстьПолноеСоответствие, Направление);
	Если ЕстьПолноеСоответствие Тогда
		АдресКартинкиИнфо = МодульОбъекта().ПолучитьКартинкуEDI("ЭлементФормы", "КартинкаГалочка2", Истина);
	Иначе
		АдресКартинкиИнфо = МодульОбъекта().ПолучитьКартинкуEDI("ЭлементФормы", "КартинкаСправка", Истина);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокСоответствийНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ОткрытьФормуПартнера("Номенклатура");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПартнера(НачальнаяСтраница = Неопределено, НачальныйРазделНастроек = Неопределено)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаПартнера", Партнер);
	Если ЗначениеЗаполнено(НачальнаяСтраница) Тогда
		ПараметрыФормы.Вставить("НачальнаяСтраница", НачальнаяСтраница);		
	КонецЕсли;
	Если ЗначениеЗаполнено(НачальныйРазделНастроек) Тогда
		ПараметрыФормы.Вставить("НачальныйРазделНастроек", НачальныйРазделНастроек);		
	КонецЕсли;
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Партнеры_ЭлементУправляемая", , ПараметрыФормы, ЭтаФорма, "ОбработчикИзмененияНастроекПартнера", ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция НовыйПараметрыФормыСоответствия()
			
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Партнер"				, Партнер);
	ПараметрыФормы.Вставить("Наименование"			, "");
	ПараметрыФормы.Вставить("GTIN"					, "");
	ПараметрыФормы.Вставить("КодТовараПартнера"		, "");
	ПараметрыФормы.Вставить("КодТовараВнутренний"	, КодТовараВнутренний);
	ПараметрыФормы.Вставить("ТипЕдиницы"			, "");
	
	ПараметрыФормы.Вставить("Номенклатура"					, Неопределено);
	ПараметрыФормы.Вставить("ХарактеристикаНоменклатуры"	, Неопределено);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения"				, Неопределено);
	ПараметрыФормы.Вставить("КодЕдиницыИзмеренияEDI"		, ИсходныйКодЕдиницыИзмеренияEDI);
	
	Возврат ПараметрыФормы;
		
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыФормыНовогоСоответствия()
	
	ПараметрыФормыСоответствия = НовыйПараметрыФормыСоответствия();
	
	ЗаголовокДействия = "Создать новое соответствие (товар покупателя встретился впервые)";
	
	ПараметрыФормыСоответствия.Наименование			= ИсходноеНаименованиеПартнера;
	ПараметрыФормыСоответствия.GTIN 				= ИсходныйGTIN;
	ПараметрыФормыСоответствия.КодТовараПартнера	= ИсходныйКодТовараПартнера;
		
	ПараметрыФормыСоответствия.Номенклатура 				= Номенклатура;
	ПараметрыФормыСоответствия.ХарактеристикаНоменклатуры 	= ХарактеристикаНоменклатуры;
	ПараметрыФормыСоответствия.ЕдиницаИзмерения 			= ЕдиницаИзмерения;
	
	Если ЗначениеЗаполнено(ИсходныйКодЕдиницыИзмеренияEDI) Тогда
		ПараметрыФормыСоответствия.ТипЕдиницы = ИсходныйКодЕдиницыИзмеренияEDI;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыФормыТекущегоСоответствия(ТаблицаСоответствий)
		
	ПараметрыФормыСоответствия = НовыйПараметрыФормыСоответствия();
	
	ЗаголовокДействия = "Открыть текущее соответствие";
	
	ОтборТекущегоСоответствия = Новый Структура;
	
	Если Направление = "Входящее" Тогда
		
		ОтборТекущегоСоответствия.Вставить("GTIN"				, ИсходныйGTIN);
		ОтборТекущегоСоответствия.Вставить("КодТовараПартнера"	, ИсходныйКодТовараПартнера);
		
	Иначе
		
		ОтборТекущегоСоответствия.Вставить("Номенклатура"		, Номенклатура);
		ОтборТекущегоСоответствия.Вставить("ЕдиницаИзмерения"	, ЕдиницаИзмерения);
		
		Если ЗначениеЗаполнено(ХарактеристикаНоменклатуры) Тогда
	    	ОтборТекущегоСоответствия.Вставить("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
		КонецЕсли;
				
	КонецЕсли;
	
	ТекущиеСоответствия = ТаблицаСоответствий.НайтиСтроки(ОтборТекущегоСоответствия);
	
	Если ТекущиеСоответствия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыФормыСоответствия.Наименование			= ТекущиеСоответствия[0].НаименованиеПартнера;
	ПараметрыФормыСоответствия.GTIN 				= ТекущиеСоответствия[0].GTIN;
	ПараметрыФормыСоответствия.КодТовараПартнера	= ТекущиеСоответствия[0].КодТовараПартнера;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыФормыВозможногоСоответствия(ТаблицаСоответствий, КоличествоСоответствий)
	
	Если Направление = "Входящее" Тогда
		
		ВозможноеСоответствие_GTIN 				= ИсходныйGTIN;
		ВозможноеСоответствие_Наименование 		= ИсходноеНаименованиеПартнера;
		ВозможноеСоответствие_КодТовараПартнера = ИсходныйКодТовараПартнера;
		
		Если КоличествоСоответствий = 1 Тогда
			
			ЕдиницаИзмеренияИзСоответствия = ТаблицаСоответствий[0].ЕдиницаEDI;
			
			ТекстЗаголовка		= "Для данной позиции уже есть соответствие с другой единицей измерения EDI - %1 (Открыть)";
			ЗаголовокДействия	= МодульОбъекта().КонтурСтандарт_СтрШаблон_(ТекстЗаголовка, ЕдиницаИзмеренияИзСоответствия);
			
		Иначе
			ЗаголовокДействия = "Для данной позиции уже есть соответствия с другими единицами измерения EDI (Открыть)";			
		КонецЕсли;
		
	Иначе
		
		СтрокаСоответствия = ТаблицаСоответствий[0];
		
		ВозможноеСоответствие_GTIN 				= СтрокаСоответствия.GTIN;
		ВозможноеСоответствие_Наименование 		= СтрокаСоответствия.НаименованиеПартнера;
		ВозможноеСоответствие_КодТовараПартнера = СтрокаСоответствия.КодТовараПартнера;
		
		Если КоличествоСоответствий = 1 Тогда
			
			Если СтрокаСоответствия.ПолеНесоответствия = "Характеристика" Тогда
				ПолеНесоответствия = "характеристикой"	
			ИначеЕсли СтрокаСоответствия.ПолеНесоответствия = "ЕдиницаИзмерения" Тогда
				ПолеНесоответствия = "единицей измерения"		
			КонецЕсли;
			
			ТекстЗаголовка		= "Для данной номенклатуры уже есть соответствие EDI с другой %1 - %2 (Открыть)";	
			ЗаголовокДействия	= МодульОбъекта().КонтурСтандарт_СтрШаблон_(ТекстЗаголовка, ПолеНесоответствия, СтрокаСоответствия.ЗначениеВСоответствии);
			
		Иначе
			
			ЗаголовокДействия = "Для данной номенклатуры уже есть соответствия EDI с другими ед. измерения или характеристиками (Открыть)";
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыФормыСоответствия = НовыйПараметрыФормыСоответствия();
		
	ПараметрыФормыСоответствия.GTIN					= ВозможноеСоответствие_GTIN;
	ПараметрыФормыСоответствия.Наименование			= ВозможноеСоответствие_Наименование;
	ПараметрыФормыСоответствия.КодТовараПартнера	= ВозможноеСоответствие_КодТовараПартнера;
		
КонецПроцедуры

&НаСервере
Функция НайтиСоответствияТовараПоНаправлениюСообщения()
	
	Если Направление = "Входящее" Тогда
		
		РезультатПоиска = МодульОбъекта().НайтиВозможныеСоответствияТовара_ВходящееСообщение(ИсходныйGTIN, 
																							ИсходныйКодТовараПартнера, 
																							ИсходныйКодЕдиницыИзмеренияEDI, 
																							Партнер);
	Иначе
																								
		РезультатПоиска = МодульОбъекта().НайтиВозможныеСоответствияТовара_ИсходящееСообщение(Номенклатура,
																							ХарактеристикаНоменклатуры,
																							ЕдиницаИзмерения,
																							Партнер);
	КонецЕсли;
	
	Возврат РезультатПоиска;
	
КонецФункции

&НаСервере
Процедура ОбновитьПараметрыФормыСоответствия()
	
	РезультатПоиска = НайтиСоответствияТовараПоНаправлениюСообщения();
		
	ЕстьПолноеСоответствие		= РезультатПоиска.ЕстьПолноеСоответствие;
	ТаблицаСоответствий         = РезультатПоиска.ТаблицаСоответствий;
	КоличествоСоответствий 		= ТаблицаСоответствий.Количество();
	
	Если ЕстьПолноеСоответствие Тогда
		ЗаполнитьПараметрыФормыТекущегоСоответствия(ТаблицаСоответствий);
	ИначеЕсли КоличествоСоответствий Тогда		
		ЗаполнитьПараметрыФормыВозможногоСоответствия(ТаблицаСоответствий, КоличествоСоответствий);		
	Иначе
		ЗаполнитьПараметрыФормыНовогоСоответствия();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоответствиеНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
		
	ИмяОбработчика = "ОбработчикИзмененияСоответствий";
	
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Номенклатура_ЭлементУправляемая", , ПараметрыФормыСоответствия, ЭтаФорма, ИмяОбработчика, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикИзмененияСоответствий(Результат, Параметры) Экспорт
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "СопоставлениеНоменклатурыИзКарточкиСообщенияУправляемая");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "СопоставлениеНоменклатурыИзКарточкиСообщенияУправляемая");
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнструкциюСопоставленияТоваров(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	АдресИнструкции = Объект.ПараметрыКлиентСервер.URLАдреса["ОшибкиПриСопоставленииТоваров"];
	
	МодульОбъектаКлиент().ОткрытьИнструкциюКлиент(Команда, ЭтаФорма, АдресИнструкции);
	
КонецПроцедуры
