&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		КэшироватьОбработкуОбъект = Ложь;
		Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
			КэшироватьОбработкуОбъект = Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект;
		КонецЕсли;
		
		Если КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); 
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции 

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "УчетныеЗаписи_СписокУправляемая");

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	Если Не Параметры.Свойство("ИзмененияПартнеров") ИЛИ Параметры.ИзмененияПартнеров.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ПолнаяПроверка", ПолнаяПроверка);
	НеНапоминать = 1;
	
	СформироватьСообщения();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "УчетныеЗаписи_СписокУправляемая");
		
	КонецЕсли
		
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	Если Не ПолнаяПроверка Тогда
		Пользователь = МодульОбъекта().ПолучитьТекущегопользователя1С();
		МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(Пользователь,"ПоказыватьИзмененияPARTIN", НеНапоминать > 0);
		МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(Пользователь,"ДатаОчереднойПроверкиДанныхPARTIN", ТекущаяДата() + НеНапоминать * 60 * 60 * 24);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.НеНапоминать.Видимость = Не ПолнаяПроверка;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСообщенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСообщения = Элементы.СписокСообщений.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КодСети", 						ДанныеСообщения.КодСети);
	ПараметрыФормы.Вставить("GUIDФормыВыводаУведомлений", 	ЭтаФорма.УникальныйИдентификатор);
	МодульОбъектаКлиент().ОткрытьФорму_КонтурEDI("Сервис_ОбновлениеДанныхПартнераУправляемая",,ПараметрыФормы,ЭтаФорма);
	
	ДанныеСообщения.Выполнено = Истина;
	УстановитьДатуОбновления(ДанныеСообщения.СсылкаНаСеть, ДанныеСообщения.ДатаПоследнегоОбновленияСети);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеКакПрочитанные(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ОтметитьВсеКакПрочитанныеНаСервере();	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьВсеКакПрочитанныеНаСервере()
	
	Для каждого Сообщение Из СписокСообщений Цикл
		УстановитьДатуОбновления(Сообщение.СсылкаНаСеть, Сообщение.ДатаПоследнегоОбновленияСети);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСообщения()
	
	Для каждого Изменение Из Параметры.ИзмененияПартнеров Цикл
		
		Сообщение = СписокСообщений.Добавить();
		ЗаполнитьЗначенияСвойств(Сообщение, Изменение);
		Сообщение.ТекстСообщения = ТекстСообщения(Изменение.ПоказателиСравнения, Изменение.НаименованиеСети);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстСообщения(Показатели, НаименованиеСети)
	
	ТекстСообщения = "Изменения точек доставки сети: " + НаименованиеСети;
	
	Если Показатели.Новые > 0 Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Новые точки: " + Показатели.Новые;
	КонецЕсли;
	
	Если Показатели.Измененные > 0 Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Изменившиеся точки: " + Показатели.Измененные;
	КонецЕсли;
	
	Если Показатели.Удаленные > 0 Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Удаленные точки: " + Показатели.Удаленные;
	КонецЕсли;
	
	ТекстСообщения = ТекстСообщения + "
					 | 
					 |Нажмите дважды для открытия";
	Возврат ТекстСообщения;
	
КонецФункции

&НаСервере
Процедура УстановитьДатуОбновления(СсылкаНаСеть, ДатаОбновления)
	
	МодульОбъекта().УстановитьЗначениеСвойстваОбъекта(СсылкаНаСеть,"ДатаОбновленияPARTIN", ДатаОбновления);
	
КонецПроцедуры