&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер"		, Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика"	, Объект.ПараметрыКлиентСерверМетрика);
	
	Если Не Параметры.Свойство("КолонкиВнешнейТаблицыАдресВХ") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ОписаниеВнешнейТаблицы", ОписаниеВнешнейТаблицы);
	
	ЗагрузитьКолонкиВнешнейТаблицыИзВХ(Параметры.КолонкиВнешнейТаблицыАдресВХ);
	ЗаполнитьОписаниеВнешнихДанных();
	МодульОбъекта().ЗаполнитьШапкуТаблицыВнешнихДанных(ТабличныйДокумент, КолонкиВнешнейТаблицы);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "УниверсальнаяФормаЗагрузкиИзТабличногоДокументаУправляемая");
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ОчиститьСообщения();
	
	СписокОшибок = ПроверитьОбязательныеПоля();
	Если СписокОшибок.Количество() > 0 Тогда
		
		Для каждого Ошибка Из СписокОшибок Цикл
			Сообщить(Ошибка);
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	Закрыть(СчитатьЗагруженныеДанные());

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеТабличногоДокументаПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	
	ПроверитьОбязательныеПоля();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКолонкиВнешнейТаблицыИзВХ(АдресВХ)
	
	КолонкиВнешнейТаблицыФормы = РеквизитФормыВЗначение("КолонкиВнешнейТаблицы");
	КолонкиВнешнейТаблицыИзВХ = ПолучитьИзВременногоХранилища(АдресВХ);
	
	Для каждого ОписаниеКолонкиВХ Из КолонкиВнешнейТаблицыИзВХ Цикл
		
		ОписаниеКолонкиФорма = КолонкиВнешнейТаблицыФормы.Добавить();
		ЗаполнитьЗначенияСвойств(ОписаниеКолонкиФорма,ОписаниеКолонкиВХ,,"ДоступныеЗначения");
		
		Если ЗначениеЗаполнено(ОписаниеКолонкиВХ.ДоступныеЗначения) Тогда
			Для каждого ДоступноеЗначение Из ОписаниеКолонкиВХ.ДоступныеЗначения Цикл
				ОписаниеКолонкиФорма.ДоступныеЗначения.Добавить(ДоступноеЗначение);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(КолонкиВнешнейТаблицыФормы,"КолонкиВнешнейТаблицы");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписаниеВнешнихДанных()
	
	Если ЗначениеЗаполнено(ОписаниеВнешнейТаблицы) Тогда
		ТекстОписания = ОписаниеВнешнейТаблицы;
	Иначе
		ТекстОписания = МодульОбъекта().СформироватьОписаниеВнешнейТаблицы(КолонкиВнешнейТаблицы);
	КонецЕсли;
	
	Элементы.ОписаниеДанныхВнешнегоИсточника.Заголовок = ТекстОписания;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьОбязательныеПоля()
	
	СписокОшибок = Новый Массив;

	Для СчетчикКолонок = 0 По КолонкиВнешнейТаблицы.Количество() - 1 Цикл
		
		НастройкаКолонки = КолонкиВнешнейТаблицы[СчетчикКолонок];
		Если Не НастройкаКолонки.ПроверкаНеЗаполненныхЗначений Тогда
			Продолжить;
		КонецЕсли;
		
		Для СчетчикСтрок = 0 По ТабличныйДокумент.ВысотаТаблицы - 1 Цикл
			
			НомерСтроки = СчетчикСтрок + 1;
			НомерКолонки = СчетчикКолонок + 1;
			
			Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Ячейка.АвтоОтметкаНезаполненного = Истина;
			
			Если Не ЗначениеЗаполнено(Ячейка.Текст) Тогда
				СписокОшибок.Добавить("Не заполнено значение столбца " + НастройкаКолонки.Заголовок 
										+ " в строке " + НомерСтроки);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СписокОшибок;
	
КонецФункции

&НаСервере
Функция СчитатьЗагруженныеДанные()
	
	ЗагруженныеДанные = Новый Массив;
	
	Для СчетчикСтрок = 1 По ТабличныйДокумент.ВысотаТаблицы - 1 Цикл
		
		ЗаписьДанных = Новый Структура;
		
		Для СчетчикКолонок = 0 По КолонкиВнешнейТаблицы.Количество() - 1 Цикл
			
			Идентификатор = КолонкиВнешнейТаблицы[СчетчикКолонок].Идентификатор;
			Данные = ТабличныйДокумент.Область(СчетчикСтрок + 1, СчетчикКолонок + 1).Текст;
			
			ЗаписьДанных.Вставить(Идентификатор,Данные);
			
		КонецЦикла;
		
		ЗагруженныеДанные.Добавить(ЗаписьДанных);
		
	КонецЦикла;

	Возврат ЗагруженныеДанные;
	
КонецФункции
