&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	Параметры.МодальностьЗапрещена=МодульОбъекта().МодальностьЗапрещена();
	ПутьКФормам = МодульОбъекта().Метаданные().ПолноеИмя() + ".Форма.";
	
	ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;	
	ЕдиницаEDI = Параметры.ЕдиницаEDI;
	
	Если НЕ ЗначениеЗаполнено(ЕдиницаEDI) Тогда
		ЕдиницаEDI = МодульОбъекта().ЕдиницаEDI_ПоУмолчанию(ЕдиницаИзмерения);
	КонецЕсли;
	
	КоэффициентEDIВ1С = Параметры.КоэффициентEDIВ1С;   
	
	УстановитФорматЭлементовФормы();
	
	СоотношениеКоличеств = МодульОбъекта().СоотношениеКоличеств_1С_EDI(КоэффициентEDIВ1С);
	
	КоличествоЕдиниц1С = СоотношениеКоличеств.КоличествоЕдиниц1С;
	КоличествоЕдиницEDI = СоотношениеКоличеств.КоличествоЕдиницEDI;
	
	Элементы.КоличествоЕдиниц1С.Заголовок = Строка(ЕдиницаИзмерения) + " (1С)";
	Элементы.КоличествоЕдиницEDI.Заголовок = ЕдиницаEDI + " (EDI)";
		
	ЭтаФорма.КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);
	 
КонецПроцедуры  

&НаКлиенте
Процедура ЗаписатьПересчеты(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Структура = КоэффициентИЕдиницаПересчета_Сервер();  
	
	ЭтаФорма.Закрыть(Структура);
	
КонецПроцедуры

&НаСервере
Процедура УстановитФорматЭлементовФормы()
	
	МодульОбъекта().УстановитьФорматЭлементаФормы_КонтурEDI(Элементы.КоличествоЕдиниц1С, "ФорматРедактирования");
	МодульОбъекта().УстановитьФорматЭлементаФормы_КонтурEDI(Элементы.КоличествоЕдиницEDI, "ФорматРедактирования");
		
КонецПроцедуры

&НаСервере
Функция КоэффициентИЕдиницаПересчета_Сервер()
	
	Структура = МодульОбъекта().КоэффициентИЕдиницаПересчета_КонтурEDI(КоличествоЕдиниц1С, КоличествоЕдиницEDI, ЕдиницаEDI);
	
	Возврат Структура;

КонецФункции 

&НаКлиенте
Процедура ЗакрытьФормуПересчетов(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЕдиницEDIПриИзменении(Элемент)
	
	Если КоличествоЕдиницEDI = 0 Тогда
		КоличествоЕдиницEDI = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЕдиниц1СПриИзменении(Элемент)
	
	Если КоличествоЕдиниц1С = 0 Тогда
		КоличествоЕдиниц1С = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "ФормаПересчетаЕдиницEDI_В_1С_Управляемая");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "ФормаПересчетаЕдиницEDI_В_1С_Управляемая");
		
	КонецЕсли

КонецПроцедуры
