&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	ЗакрыватьПриВыборе = Истина;
	
	Если Параметры.Свойство("ЗакрыватьПриВыборе") И Параметры.ЗакрыватьПриВыборе = Ложь Тогда 
		ЗакрыватьПриВыборе = Ложь;
	КонецЕсли;
	
	АдресТаблицыВХранилище 	= Параметры.АдресТаблицыВХранилище;
	СписокЗначенийВыбора 	= Параметры.СписокЗначенийВыбора;
	ВыборОбязателен 		= Параметры.ВыборОбязателен;
    ВыборНесколькихЗначений = Параметры.ВыборНесколькихЗначений;
	
	Элементы.ТаблицаВыбора.МножественныйВыбор = ВыборНесколькихЗначений;
	
	Если ВыборНесколькихЗначений Тогда
		Заголовок = "Выберите необходимые значения";
	КонецЕсли;
	
	ТаблицаЗначений = Неопределено;
	
	Если ЗначениеЗаполнено(АдресТаблицыВХранилище) Тогда
		ТаблицаЗначений = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыВХранилище);
	ИначеЕсли ЗначениеЗаполнено(СписокЗначенийВыбора) Тогда
		ТаблицаЗначений = СписокЗначенийВТаблицу(СписокЗначенийВыбора);
	КонецЕсли;
	
	ЗаполнитьПолеФормыДаннымиТаблицы(ТаблицаЗначений);
	
КонецПроцедуры

&НаКлиенте
Функция ФлажокВыбран()

	Для Каждого Строка Из ТаблицаВыбора Цикл
		Если Строка.Выбор=Истина Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
    Возврат Ложь;
	
КонецФункции // Флажок выбран()

&НаКлиенте
Процедура Выбрать(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ЗаписатьИЗакрыть();
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть()
	
	Если Элементы.ТаблицаВыбора.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыборНесколькихЗначений = Ложь И ФлажокВыбран() = Ложь Тогда
		Элементы.ТаблицаВыбора.ТекущиеДанные.Выбор = Истина;
	КонецЕсли;
	
	Если ВыборНесколькихЗначений = Истина И ВыборОбязателен = Истина И ФлажокВыбран() = Ложь Тогда 
		
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Выберите хотя бы одно значение");
		Возврат;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(СписокЗначенийВыбора) Тогда
		РезультатЗакрытия = ТаблицаВСписокЗначений(ТаблицаВыбора);
	Иначе
		ПоместитьРезультатВХранилище();	
		РезультатЗакрытия = АдресТаблицыВХранилище;
	КонецЕсли;
	
	Закрыть(РезультатЗакрытия);	
	
КонецПроцедуры

&НаСервере
Функция ПоместитьРезультатВХранилище()

	АдресТаблицыВХранилище = ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("ТаблицаВыбора"));
    Возврат АдресТаблицыВХранилище;
	
КонецФункции // ПоместитьРезультатВХранилище()

&НаСервере
Процедура ЗаполнитьПолеФормыДаннымиТаблицы(ТаблицаЗначений)
	
	Если Не ЗначениеЗаполнено(ТаблицаЗначений) Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьРеквизитыПоДаннымТаблицы(ТаблицаЗначений);
	СоздатьЭлементыФормыПоДаннымТаблицы(ТаблицаЗначений);
	
	Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		
		НоваяСтрокаНаФорме = ТаблицаВыбора.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНаФорме,СтрокаТаблицы);
		
	КонецЦикла;
	
	Если ВыборНесколькихЗначений <> Истина Тогда 
		Элементы.ТаблицаВыбораВыбор.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитыПоДаннымТаблицы(ТаблицаЗначений)
	
	ДобавляемыеРеквизиты = Новый Массив;
	ПроизвольныйТип = Новый ОписаниеТипов();
	
	Для каждого Колонка Из ТаблицаЗначений.Колонки  Цикл
		
		Если Колонка.Имя = "Выбор" Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйРеквизит = Новый РеквизитФормы(Колонка.Имя, ПроизвольныйТип, "ТаблицаВыбора", Колонка.Имя);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);  
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыФормыПоДаннымТаблицы(ТаблицаЗначений)
	
	Для каждого Колонка Из ТаблицаЗначений.Колонки  Цикл
	
		Если Колонка.Имя = "Выбор" Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяКолонка = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), Элементы.ТаблицаВыбора); 
		
		НоваяКолонка.Заголовок 		= Колонка.Имя; 
        НоваяКолонка.ПутьКДанным 	= "ТаблицаВыбора." + Колонка.Имя; 
        НоваяКолонка.Вид 			= ВидПоляФормы.ПолеВвода;
        НоваяКолонка.Ширина 		= 20;
		НоваяКолонка.ТолькоПросмотр	= Истина;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СписокЗначенийВыбора) Тогда
		Элементы.Значение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораВыборПриИзменении(Элемент)
	
	Если ВыборНесколькихЗначений = Ложь Тогда 
		
		Для Каждого Строка Из ТаблицаВыбора Цикл
			Строка.Выбор = Ложь;
		КонецЦикла;
		
		Элементы.ТаблицаВыбора.ТекущиеДанные.Выбор = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыборНесколькихЗначений = Ложь Тогда 
		ЗаписатьИЗакрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокЗначенийВТаблицу(СписокЗначений)
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Значение");
	ТаблицаЗначений.Колонки.Добавить("Представление");
	ТаблицаЗначений.Колонки.Добавить("Выбор");
	
	Для каждого ЭлементСписка Из СписокЗначений Цикл
		
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.Значение = ЭлементСписка.Значение;
		НоваяСтрока.Представление = ЭлементСписка.Представление;
		НоваяСтрока.Выбор = ЭлементСписка.Пометка;
		
	КонецЦикла;
	
	Возврат ТаблицаЗначений;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТаблицаВСписокЗначений(Таблица)
	
	СписокЗначений = Новый СписокЗначений;
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
		СписокЗначений.Добавить(СтрокаТаблицы.Значение, СтрокаТаблицы.Представление, СтрокаТаблицы.Выбор);
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции
