&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	СсылкаУчетнойЗаписи=Параметры.СсылкаУчетнойЗаписи;
	
	Если ЗначениеЗаполнено(СсылкаУчетнойЗаписи) Тогда
		
		СтруктураЭлемента = МодульОбъекта().ПолучитьЭлементСправочника("УчетныеЗаписи", СсылкаУчетнойЗаписи);
		
		Если НЕ СтруктураЭлемента = Неопределено Тогда
		
			ТипАвторизации							= СтруктураЭлемента.ТипАвторизации;
			ПортальныйИд							= СтруктураЭлемента.ПортальныйИд;
			Логин									= СтруктураЭлемента.Логин;
			Пароль									= СтруктураЭлемента.Пароль;
			GLN										= СтруктураЭлемента.GLN;
			Неактивная								= СтруктураЭлемента.Неактивная;
			
		КонецЕсли;
		
	КонецЕсли;

	ИспользоватьПортальнуюАвторизацию = МодульОбъекта().ПолучитьКонстантуEDI("ИспользоватьПортальнуюАвторизацию") = Истина;
	
	ТипыАвторизации = МодульОбъекта().КонтурEDIAPI_ТипыАвторизации();
	
	Если Не ЗначениеЗаполнено(ТипАвторизации) Тогда
		Если ИспользоватьПортальнуюАвторизацию Тогда
			ТипАвторизации = ТипыАвторизации.ТокенДоступа;
		Иначе
			ТипАвторизации = ТипыАвторизации.ЛогинПароль;
		КонецЕсли;
	КонецЕсли;

	УстановитьВидимостьПолей();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолей()
	
	ТипыАвторизации = МодульОбъекта().КонтурEDIAPI_ТипыАвторизации();
	
	Если ТипАвторизации = ТипыАвторизации.ЛогинПароль Тогда
		
		Элементы.Пароль.Видимость = Истина;
		Элементы.ПортальныйИд.Видимость = Ложь;
		Элементы.Логин.Доступность = Истина;
		
	ИначеЕсли ТипАвторизации = ТипыАвторизации.ТокенДоступа Тогда
		
		Элементы.Пароль.Видимость = Ложь;
		Элементы.ПортальныйИд.Видимость = Истина;
		Элементы.Логин.Доступность = Ложь;
		
	КонецЕсли;	

	// станут видимы после аутентификации
	Элементы.ГруппаСессия.Видимость = Ложь;
	Элементы.КнопкаАвторизоваться.Видимость = Ложь;									
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВыполнитьНажатие(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ЗаписатьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть()
	
	УспешноеСохранение = СохранитьУчетнуюЗаписьСервер();

	Если УспешноеСохранение=Истина Тогда 
		Оповестить("КонтурEDI_ОбновитьСписокУчетныхЗаписей");
		
		Соединение = Неопределено;
		
		ЭтаФорма.Закрыть(Истина);
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СохранитьУчетнуюЗаписьСервер()
	
	Если НЕ ПроверитьЗначенияФормы() Тогда
		Возврат ложь;
	КонецЕсли;
	
	СтруктураПолей = СоздатьСтруктуруУчетнойЗаписиДляСохранения();  

	МодульОбъекта().СохранитьЭлементСправочника("УчетныеЗаписи", СсылкаУчетнойЗаписи, СтруктураПолей);
	
    Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьЗначенияФормы()
	
	// 1. инициализируем таблицу вывода ошибок
	ТаблицаОшибок = МодульОбъекта().ИнициализироватьТаблицуОшибок();

	// 2. передать структуру для проверки
	МодульОбъекта().ПроверитьПолеФормы(ТаблицаОшибок, ТипАвторизации,	"Строка12", Истина, "ТипАвторизации");
	МодульОбъекта().ПроверитьПолеФормы(ТаблицаОшибок, GLN,	"Строка13", Истина, "GLN");

	ТипыАвторизации = МодульОбъекта().КонтурEDIAPI_ТипыАвторизации();
	
	Если ТипАвторизации = ТипыАвторизации.ЛогинПароль Тогда
		МодульОбъекта().ПроверитьПолеФормы(ТаблицаОшибок, Логин,	"Строка50", Истина, "Логин");
		МодульОбъекта().ПроверитьПолеФормы(ТаблицаОшибок, Пароль, 	"Строка50",	Истина, "Пароль");
	КонецЕсли;
	
	Если ТаблицаОшибок.Количество() > 0 Тогда
		
		Если ПустаяСтрока(Логин) Тогда
			
			ТекстЗаголовка = "При заполнении учетной записи найдены ошибки.";
			
		Иначе
			
			ТекстЗаголовка = "При заполнении учетной записи """+СокрЛП(Логин)+""" найдены ошибки.";
			
		КонецЕсли;
			
		//МодульПроверкиДанных.ОткрытьФормуВыводаОшибок(ТекстЗаголовка,ТаблицаОшибок,ЭтаФорма);
		
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция  СоздатьСтруктуруУчетнойЗаписиДляСохранения()
	
	СтруктураПолей = Новый Структура();
	СтруктураПолей.Вставить("ТипАвторизации",							ТипАвторизации);
	СтруктураПолей.Вставить("ПортальныйИд",								ПортальныйИд);
	СтруктураПолей.Вставить("Логин", 									СокрЛП(Логин));
	СтруктураПолей.Вставить("Пароль", 									Пароль);
	СтруктураПолей.Вставить("GLN", 										СокрЛП(GLN));
	СтруктураПолей.Вставить("Неактивная",								Неактивная);
	СтруктураПолей.Вставить("Токен",									"");
	Возврат СтруктураПолей;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(Параметры.ПараметрыАвтотестирования) Тогда
		ПодключитьОбработчикОжидания("ЗаписатьНастройкиАвтотестирования",0.1,Истина);
	КонецЕсли;
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "УчетныеЗаписи_ЭлементУправляемая");
	
	ТипыАвторизации = ТипыАвторизацииНаСервере();
	
	Если ТипАвторизации = ТипыАвторизации.ТокенДоступа И ИспользоватьПортальнуюАвторизацию Тогда
		ПолучитьСессиюАутентификации();			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСессиюАутентификации()
	
	Сессия = Неопределено;
	
	ОрганизацияУчетнойЗаписи = ОрганизацияУчетнойЗаписи();
	Если ЗначениеЗаполнено(ОрганизацияУчетнойЗаписи) Тогда
		
        Сессия = ПолучитьСессиюАутентификацииНаСервере(ОрганизацияУчетнойЗаписи);
		
	КонецЕсли;
	
	ПослеАутентификации(Сессия, Неопределено);

КонецПроцедуры

&НаСервере
Функция ОрганизацияУчетнойЗаписи()

	Если ЗначениеЗаполнено(GLN) Тогда
		Возврат МодульОбъекта().НайтиОбъектПоЗначениюСвойства("GLN_Организации", GLN);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПолучитьСессиюАутентификацииНаСервере(Организация)

	МодульОбъекта().АутентификаторEDI_Инициализировать(Организация);
			
	Сессия = МодульОбъекта().Аутентификатор_ПолучитьСессию();
	
	Возврат Сессия;
	
КонецФункции

&НаСервере
Процедура ЗавершитьСессиюАутентификацииНаСервере(Организация)

	МодульОбъекта().АутентификаторEDI_Инициализировать(Организация);

	МодульОбъекта().Аутентификатор_ЗавершитьСессию();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСессиюАутентификации(Команда)
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             

	ОрганизацияУчетнойЗаписи = ОрганизацияУчетнойЗаписи();
	Если ЗначениеЗаполнено(ОрганизацияУчетнойЗаписи) Тогда
		
		ЗавершитьСессиюАутентификацииНаСервере(ОрганизацияУчетнойЗаписи);
	
	КонецЕсли;

	ПослеАутентификации(Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройкиАвтотестирования()
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.ПараметрыАвтотестирования);
	СтруктураПараметров = СтруктураПараметров.Настройки.СтруктураКомпании;
	
	Если СтруктураПараметров.УчетныеЗаписи.Количество()>0 Тогда
		
		ТекДанные = СтруктураПараметров.УчетныеЗаписи[0];
		GLN = ТекДанные.GLN;
		Логин = ТекДанные.Логин;
		Пароль = ТекДанные.Пароль;
		
	КонецЕсли;
	
	ЗаписатьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "УчетныеЗаписи_ЭлементУправляемая");
		
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПарольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПарольПользователя = Элемент.ТекстРедактирования;
	
	СменитьРежимОтображенияПароля();
	
	Пароль = ПарольПользователя;
	
	Если Элемент.РежимПароля Тогда
		Элемент.КартинкаКнопкиВыбора = Элементы.КартинкаГлазОткрыт.Картинка;
	Иначе
		Элемент.КартинкаКнопкиВыбора = Элементы.КартинкаГлазЗакрыт.Картинка;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СменитьРежимОтображенияПароля()
	
	Элементы.Пароль.РежимПароля = Не Элементы.Пароль.РежимПароля;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипАвторизацииПриИзменении(Элемент)
	
	УстановитьВидимостьПолей();

	ТипыАвторизации = ТипыАвторизацииНаСервере();
	
	Если ТипАвторизации = ТипыАвторизации.ТокенДоступа И ИспользоватьПортальнуюАвторизацию Тогда
		ПолучитьСессиюАутентификации();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ТипыАвторизацииНаСервере()
	Возврат МодульОбъекта().КонтурEDIAPI_ТипыАвторизации();
КонецФункции

&НаКлиенте
Процедура Авторизоваться(Команда)
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ВыполнитьАутентификацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАутентификацию()
	
	ОрганизацияУчетнойЗаписи = ОрганизацияУчетнойЗаписи();
	Если Не ЗначениеЗаполнено(ОрганизацияУчетнойЗаписи) Тогда
		
		ТекстСообщения = "Не найдена организация учетной записи по 
						 |GLN: " + GLN;
		МодульОбъектаКлиент().СообщениеПользователю_КонтурEDI(ТекстСообщения);
		
		Возврат;
	КонецЕсли;

	МодульОбъектаКлиент().АутентификацияНаКлиенте(ЭтаФорма, ОрганизацияУчетнойЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПослеАутентификации(Результат, ДопПараметры) Экспорт
	
	МодульОбъектаКлиент().СформироватьМетрикиФормыАутентификации(ДопПараметры);
	
    Сессия = Результат;
	Если Сессия <> Неопределено Тогда
		
		ОрганизацияУчетнойЗаписи = ОрганизацияУчетнойЗаписи();
		
		УчетнаяЗапись = Новый Структура();
		УчетнаяЗапись.Вставить("GLN",			GLN);
		УчетнаяЗапись.Вставить("ТипАвторизации",ТипАвторизации);
		УчетнаяЗапись.Вставить("Организация",	ОрганизацияУчетнойЗаписи);
		УчетнаяЗапись.Вставить("ПортальныйИд",	Сессия.ПортальныйИд);
		
		Если Не ОрганизацияУчетнойЗаписиДоступнаНаСервере(УчетнаяЗапись) Тогда
			
			ТекстПредупреждения = "У пользователя: " + Сессия.ФИО + Символы.ПС 
								+ "портальный ID: " + Сессия.ПортальныйИд + Символы.ПС
								+ "нет доступа к организации: " + Строка(ОрганизацияУчетнойЗаписи) + Символы.ПС
								+ "GLN: " + GLN;
			
			МодульОбъектаКлиент().Предупреждение_КонтурEDI(ТекстПредупреждения);
			
			ЗавершитьСессиюАутентификацииНаСервере(ОрганизацияУчетнойЗаписи);
			
			Сессия = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если Сессия <> Неопределено Тогда
		
		Логин = Сессия.Почта;
		ПортальныйИд = Сессия.ПортальныйИд;
		
		Элементы.НадписьСессия.Заголовок = "Авторизация: " + Сессия.ФИО + Символы.ПС 
										 + "действует до: " + Формат(Сессия.УниверсальнаяДатаОкончания + СмещениеВремени());
		Элементы.ГруппаСессия.Видимость = Истина;
		Элементы.КнопкаАвторизоваться.Видимость = Ложь;									
		
	Иначе
		
		ПортальныйИд = "";
		Элементы.ГруппаСессия.Видимость = Ложь;
		Элементы.КнопкаАвторизоваться.Видимость = Истина;
									
	КонецЕсли;	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция СмещениеВремени()
	
	Возврат ТекущаяДатаСеанса() - ТекущаяУниверсальнаяДата();
	
КонецФункции

&НаСервере
Функция ОрганизацияУчетнойЗаписиДоступнаНаСервере(УчетнаяЗапись)
	
	Возврат МодульОбъекта().ОрганизацияУчетнойЗаписиДоступна(УчетнаяЗапись);
	
КонецФункции
			