&НаСервере
Перем МодульОбъекта;

&НаКлиенте
Перем МодульОбъектаКлиент;

// СЛУЖЕБНЫЕ {

// Инициализация модуля и его экспортных функций
&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		Если Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
			МодульОбъекта.ИнициализироватьПодключаемыеМодули(); // TODO Проверить что из этого используется на формах и перенести в ПараметрыКлиентСервер
			МодульОбъекта.ОбновитьКэшМодуляОбъекта();
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МодульОбъектаКлиент()
	
	Если ТипЗнч(МодульОбъектаКлиент) = Тип("УправляемаяФорма") Тогда
		Возврат МодульОбъектаКлиент;
	КонецЕсли;
	
	ОсновнаяФорма = ОсновнаяФорма();
	Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
		МодульОбъектаКлиент = ОсновнаяФорма.МодульОбъектаКлиент();
		Возврат МодульОбъектаКлиент;
	Иначе
		Сообщить("Ошибка! Не удалось получить контекст основной формы.");
	КонецЕсли;
	          	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭтаФорма.ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;
    	
КонецФункции

&НаКлиенте
Функция НоваяМетрика()
	
	Возврат ОсновнаяФорма().НоваяМетрика();
	
КонецФункции

// } СЛУЖЕБНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПараметрыКлиентСервер", 			Объект.ПараметрыКлиентСервер);
	Параметры.Свойство("ОбъектПараметрыКлиентСерверМетрика", 	Объект.ПараметрыКлиентСерверМетрика);
	
	РасширениеСсылка  = Параметры.РасширениеСсылка;
	
	ЗаполнитьДанныеРасширения();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСобытие(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ТекущаяСтрока = Элементы.События.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущаяСтрокаИндекс = События.Индекс(Элементы.События.ТекущиеДанные);
	
	//удаляем
	События.Удалить(Элементы.События.ТекущиеДанные);
	
	//позиционируем: остаемся в этой же строке или поднимаемся на строку выше
	Количество = События.Количество();
	Если Не Количество = 0 Тогда
		Если Количество > ТекущаяСтрокаИндекс Тогда
			ТекСтрока=События.Получить(ТекущаяСтрокаИндекс);
			Элементы.События.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
		Иначе
			ПредСтрока=События.Получить(ТекущаяСтрокаИндекс-1);
			Элементы.События.ТекущаяСтрока = ПредСтрока.ПолучитьИдентификатор();
		КонецЕсли;
	Иначе
		УстановитьТекстСобытия("");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСобытие(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	//получаем события и просим пользователя выбрать
	СписокВыбора = ПолучитьСписокЗначенийОписаниеСобытийПодключаемогоМодуляРасширенийВызовСервера();
	
	Если Объект.ПараметрыКлиентСервер.МодальностьЗапрещена Тогда 
		Выполнить("ПоказатьВыборИзСписка(Новый ОписаниеОповещения(""ОбработчикВыбораСобытияРасширения"",ЭтаФорма), СписокВыбора)"); 
	Иначе
		ВыбранноеЗначение=ВыбратьИзСписка(СписокВыбора,Элементы.ГруппаСобытий);
		ОбработчикВыбораСобытияРасширения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСобытияРасширения(ВыбранноеСобытие,ДопПараметр=Неопределено) Экспорт
	
	РезультатДобавления = Новый Структура("Успешно,ПовторноеДобавление,ОписаниеОшибки,ИмяСобытия",Ложь,Ложь,"","");

	//////////////////////////////////
	Если ВыбранноеСобытие = Неопределено Тогда
		РезультатДобавления.Успешно = Ложь;
		Возврат;
	КонецЕсли;  	
	
	ИмяСобытия = ВыбранноеСобытие.Значение;
	
	Если ИмяСобытия = "<<произвольное событие>>" Тогда
		
		ИмяСобытия = "";
		МодульОбъектаКлиент().ПоказатьВводСтроки_КонтурEDI("ОбработчикПослеВводаИмениСобытия", ЭтаФорма, РезультатДобавления, ИмяСобытия, "Введите имя произвольного события", 255, Ложь);
		
	Иначе
		
		ОбработчикПослеВводаИмениСобытия(ИмяСобытия, РезультатДобавления);
		
	КонецЕсли;		
	 		
КонецПроцедуры // ОбработчикВыбораСобытияРасширения()

&НаКлиенте
Процедура ОбработчикПослеВводаИмениСобытия(ИмяСобытия, РезультатДобавления) Экспорт

	Если НЕ ЗначениеЗаполнено(ИмяСобытия)
		ИЛИ ИмяСобытия = "Введите имя произвольного события"
		ИЛИ Найти(СокрЛП(ИмяСобытия), " ") <> 0 Тогда
		
		РезультатДобавления.Успешно = Ложь;
		Возврат;
		
	КонецЕсли;
	
	//проверяем на присутствие
	ПроверкаНаПрисутствие = Ложь;
	ДобавленноеРанееСобытиеМассив = События.НайтиСтроки( Новый Структура("Имя",ИмяСобытия));
	Если Не ДобавленноеРанееСобытиеМассив.Количество() = 0 Тогда
		
		РезультатДобавления.Успешно = Ложь;
		РезультатДобавления.ПовторноеДобавление = Истина;
		РезультатДобавления.ИмяСобытия = ИмяСобытия;
		//на него и прыгнем
		НовоеСобытиеМассив = События.НайтиСтроки(Новый Структура("Имя",РезультатДобавления.ИмяСобытия));
		Если НовоеСобытиеМассив.Количество()>0 Тогда 
			НовоеСобытие=НовоеСобытиеМассив[0];
			Если Не НовоеСобытие = Неопределено Тогда
				Элементы.События.ТекущаяСтрока = НовоеСобытие.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЕсли;
		
		ПроверкаНаПрисутствие = Истина;
		
	КонецЕсли;
	
	Если ПроверкаНаПрисутствие Тогда
		Возврат;
	КонецЕсли;
	
	//добавляем в список   - поход на сервер неизбежен!!!
	НовоеСобытие = События.Добавить();
	НовоеСобытие.Имя = ИмяСобытия;
	НовоеСобытие.Код = СформироватьКомментарийСобытия(ИмяСобытия);
	НовоеСобытие.ИсходныйКод = "//Исходный код отсутствует";
	
	РезультатДобавления.Успешно = Истина;
	РезультатДобавления.ИмяСобытия = НовоеСобытие.Имя;
	
	//обработка результата добавления
	
	НовоеСобытиеМассив = События.НайтиСтроки(Новый Структура("Имя",РезультатДобавления.ИмяСобытия));
	Если НовоеСобытиеМассив.Количество()>0 Тогда 
		НовоеСобытие=НовоеСобытиеМассив[0];
		Если Не НовоеСобытие = Неопределено Тогда
			Элементы.События.ТекущаяСтрока = НовоеСобытие.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры 

&НаСервере
Функция СформироватьКомментарийСобытия(ИмяСобытия)
	
	Комментарий = "";
	
	ТаблицаСобытий = МодульОбъекта().ПолучитьОписаниеСобытийПодключаемогоМодуляРасширений();
	СтрокаОписания = ТаблицаСобытий.Найти(ИмяСобытия,"Имя");
	
	Если СтрокаОписания <> Неопределено Тогда
		
		_ОписаниеСобытия = СтрокаОписания.Описание;
		_ОписаниеСобытия = СтрЗаменить(_ОписаниеСобытия,Символы.ПС,Символы.ПС + "// " + Символы.Таб);     	
		
		Комментарий = Комментарий + "// " + "Описание:" + Символы.ПС;
		Комментарий = Комментарий + "// " + Символы.Таб + _ОписаниеСобытия + "." + Символы.ПС;
		Комментарий = Комментарий + "// " + Символы.ПС;
		Комментарий = Комментарий + "// " + "Параметры:" + Символы.ПС;
		
		Для Каждого Параметр Из СтрокаОписания.Параметры Цикл
			
			_ОписаниеПараметра = Параметр.Значение.Описание;
			_ОписаниеПараметра = СтрЗаменить(_ОписаниеПараметра,Символы.ПС,Символы.ПС + "// " + Символы.Таб);
			
			Комментарий = Комментарий + "// " + Символы.Таб + Параметр.Значение.Представление + " - " + Параметр.Значение.Тип + " - " + _ОписаниеПараметра + "." + Символы.ПС;
			
		КонецЦикла;
		
		Если СтрокаОписания.НаличиеСтандартнойОбработкиEDI = Истина Тогда
			Комментарий = Комментарий + "// " + Символы.Таб + "СтандартнаяОбработкаEDI" + " - " + "Булево" + " - " + "флаг стандартной обработки" + "." + Символы.ПС;
		КонецЕсли;
		
		Если СтрокаОписания.НаличиеВозвращаемогоЗначения = Истина Тогда
			
			_ОписаниеВозврата = СтрокаОписания.ОписаниеВозвращаемогоЗначения;
			_ОписаниеВозврата = СтрЗаменить(_ОписаниеВозврата,Символы.ПС,Символы.ПС + "// " + Символы.Таб);
			
			Комментарий = Комментарий + "// " + Символы.ПС;
			Комментарий = Комментарий + "// " + "Возвращаемое значение:" + Символы.ПС;
			Комментарий = Комментарий + "// " + Символы.Таб + СтрокаОписания.ТипВозвращаемогоЗначения + Символы.ПС;
			Комментарий = Комментарий + "// " + Символы.Таб + _ОписаниеВозврата + Символы.ПС;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Комментарий;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокЗначенийОписаниеСобытийПодключаемогоМодуляРасширенийВызовСервера()

	ТаблицаСобытий = МодульОбъекта().ПолучитьОписаниеСобытийПодключаемогоМодуляРасширений();
	ТаблицаСобытий.Сортировать("Имя");
	//Вернем СписокЗначений
	СписокСобытий = Новый СписокЗначений;
	
	СписокСобытий.ЗагрузитьЗначения(ТаблицаСобытий.ВыгрузитьКолонку("Имя")); 
	
	Возврат СписокСобытий; 
	
КонецФункции // ПолучитьОписаниеСобытийПодключаемогоМодуляРасширенийВызовСервера()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если МодульОбъектаКлиент().ВерсияПрограмногоПродуктаРавнаИлиВыше(Объект.ПараметрыКлиентСервер.ВерсияПлатформы1С, "8.3.14.1565" ) Тогда
	
		ИзвлечьИсходникиРедактораКода1С();
		
	КонецЕсли;
		
	Элементы.СобытияПереключитьРедактор.Видимость = ИсходникиЗагружены;

	УстановитьДоступность();

	Элементы.БаннерПроВозврат.Видимость = Ложь;
	
	Если МодульОбъектаКлиент().ПеременнаяСодержитСвойство(Элементы.ОписаниеПолное, "АвтоМаксимальнаяШирина") Тогда	
		Элементы.ОписаниеПолное.АвтоМаксимальнаяШирина = Ложь;
	КонецЕсли;

	Если НЕ ИсходникиЗагружены Тогда
		Если Не События.Количество() = 0 Тогда
			ТекущееСобытие = События[0].Имя;
			УстановитьТекстСобытия(События[0].Код);
		КонецЕсли;
	КонецЕсли;
	
	ОсновнаяФорма().ПриОткрытииФормы(ЭтаФорма, "ФормаРасширения_ЭлементУправляемая");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	Если События.Количество() = 0 Тогда
		Элементы.СобытияУдалитьСобытие.Доступность = Ложь;
		Элементы.СобытияОткрытьИсходныйКод.Доступность = Ложь;
	Иначе
		Элементы.СобытияУдалитьСобытие.Доступность = Истина;
		Элементы.СобытияОткрытьИсходныйКод.Доступность = Истина;
	КонецЕсли;
		
	//доступность наименование
	Если Не РасширениеСсылка = Неопределено Тогда
		Элементы.Наименование.Доступность = Ложь;
	КонецЕсли;
	
	//доступность кнопки листинга исходного кода
	ТекущаяСтрока = Элементы.События.ТекущиеДанные;
	
	Если Не ТекущаяСтрока = Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.ИсходныйКод) Тогда
			Элементы.СобытияОткрытьИсходныйКод.Доступность = Истина;	
		Иначе
			Элементы.СобытияОткрытьИсходныйКод.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;

	Элементы.Код.Видимость = НЕ ИсходникиЗагружены;
	Элементы.КодHTML.Видимость = ИсходникиЗагружены;	
	Элементы.СобытияРежимСравнения.Видимость = ИсходникиЗагружены И ИспользуетсяРедакторКода;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеРасширения()
		
	Если Не РасширениеСсылка = Неопределено Тогда
		ЗначенияРеквизитовРасширения = МодульОбъекта().ПолучитьЗначенияРеквизитовРасширения(РасширениеСсылка);
		
		Наименование = ЗначенияРеквизитовРасширения.Наименование;

		Для Каждого РеквизитыСобытие Из ЗначенияРеквизитовРасширения.События Цикл
			НовоеСобытие = События.Добавить();
			НовоеСобытие.Имя = РеквизитыСобытие.ИмяСобытия;
			НовоеСобытие.Код = РеквизитыСобытие.ИсполняемыйКод;
			НовоеСобытие.ИсходныйКод = РеквизитыСобытие.ИсходныйИсполняемыйКод;
		КонецЦикла;
		
		ОписаниеПолное = СокрЛП(СтрЗаменить(ЗначенияРеквизитовРасширения.ОписаниеПолное,"¶",""));		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СобытияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СобытияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СобытияПриАктивизацииЯчейки(Элемент)

	ТекущаяСтрока = Элементы.События.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Или ТекущаяСтрока.Имя = ТекущееСобытие Тогда
		// все удалены или повторная активация текущей строки
		Возврат;
	КонецЕсли;
	
	Если Не КодТекущегоСобытияПрошелПроверку() Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьКодТекущегоСобытия();
	
	//показываем код активизированного события
	ТекущееСобытие = ТекущаяСтрока.Имя;
	УстановитьТекстСобытия(ТекущаяСтрока.Код);
	Если ВключенРежимСравнения() Тогда
		УстановитьТекстСравненияСобытия(ТекущаяСтрока.ИсходныйКод);
	КонецЕсли;
	
	УстановитьДоступность();
		
КонецПроцедуры

&НаКлиенте
Функция ПрограммныйКодСодержитВозвратЗначения(ПрограммныйКод, НомерСтрокиВозврата = Неопределено)
	
	СодержитВозврат = Ложь;
	ЕстьКодПослеВозврата = Ложь;
	
	ТекстКода = Новый ТекстовыйДокумент;
	ТекстКода.УстановитьТекст(ПрограммныйКод);
	
	Для НомерСтроки = 1 По ТекстКода.КоличествоСтрок() Цикл
		
		СтрокаКода = ТекстКода.ПолучитьСтроку(НомерСтроки);
		
		Если СодержитВозврат И Не ПустаяСтрока(СтрокаКода) И Не Найти(СокрЛ(СтрокаКода), "//") = 1 Тогда
			ЕстьКодПослеВозврата = Истина;
			Прервать;
		КонецЕсли;
		
		Если Найти(СокрЛ(ВРег(СтрокаКода)), "ВОЗВРАТ ") = 1 Тогда
			СодержитВозврат = Истина;
			НомерСтрокиВозврата = НомерСтроки;
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;

	Возврат СодержитВозврат И ЕстьКодПослеВозврата; 
	
КонецФункции

&НаКлиенте
Функция ПрограммныйКодСодержитВозвратИзПроцедуры(ПрограммныйКод, НомерСтрокиВозврата = Неопределено)
	
	СодержитВозврат = Ложь;
	
	ТекстКода = Новый ТекстовыйДокумент;
	ТекстКода.УстановитьТекст(ПрограммныйКод);
	
	Для НомерСтроки = 1 По ТекстКода.КоличествоСтрок() Цикл
		
		СтрокаКода = ТекстКода.ПолучитьСтроку(НомерСтроки);
		
		Если Найти(СокрЛ(ВРег(СтрокаКода)), "ВОЗВРАТ;") = 1 Тогда
			СодержитВозврат = Истина;
			НомерСтрокиВозврата = НомерСтроки;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

	Возврат СодержитВозврат; 
	
КонецФункции

&НаКлиенте
Функция КодТекущегоСобытияПрошелПроверку()
	
	ПрошелПроверку = Истина;
	
	ТекущийКод = ПолучитьТекстСобытия();
	
	НомерСтрокиВозврата = Неопределено;
		
	Если ПрограммныйКодСодержитВозвратИзПроцедуры(ТекущийКод, НомерСтрокиВозврата) Тогда
		
		ПрошелПроверку = Ложь;

		ЭтаФорма.ТекущийЭлемент = Элементы.Код;
		УстановитьГраницыВыделенияСобытия(НомерСтрокиВозврата, 1, НомерСтрокиВозврата+1, 1); 
		
 		ТекстПредупреждения = "Оператор ""Возврат"" без возвращаемого значения не может употребляться в программном коде события расширения!";
		Если Параметры.МодальностьЗапрещена Тогда 
			Выполнить("ПоказатьПредупреждение(,ТекстПредупреждения,,""Контур.EDI"")");
		Иначе
			Предупреждение(ТекстПредупреждения,,"Контур.EDI");
		КонецЕсли;
		
	ИначеЕсли ПрограммныйКодСодержитВозвратЗначения(ТекущийКод, НомерСтрокиВозврата) 
		И Не Элементы.БаннерПроВозврат.Видимость Тогда
			
		ПрошелПроверку = Ложь;
		
		ЭтаФорма.ТекущийЭлемент = Элементы.Код;
		УстановитьГраницыВыделенияСобытия(НомерСтрокиВозврата, 1, НомерСтрокиВозврата+1, 1); 

		Элементы.БаннерПроВозврат.Видимость = Истина;

	ИначеЕсли Элементы.БаннерПроВозврат.Видимость Тогда
		
		Элементы.БаннерПроВозврат.Видимость = Ложь;

	КонецЕсли;

	Если Не ПрошелПроверку Тогда
		
		СтрокиСобытия = События.НайтиСтроки(Новый Структура("Имя",ТекущееСобытие));
		Если СтрокиСобытия.Количество()=1 Тогда
			Элементы.События.ТекущаяСтрока = СтрокиСобытия[0].ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПрошелПроверку;
	
КонецФункции

&НаКлиенте
Процедура СохранитьКодТекущегоСобытия()
	
	//пытаемся сохранить код текущего события
	СтрокиСобытия = События.НайтиСтроки(Новый Структура("Имя",ТекущееСобытие));
	Если СтрокиСобытия.Количество()=1 Тогда
		СтрокиСобытия[0].Код = ПолучитьТекстСобытия();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьРасширение(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если Не КодТекущегоСобытияПрошелПроверку() Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьКодТекущегоСобытия();
	
	Успешно = СохранитьРасширениеВызовСервера();
	Если Успешно Тогда 
		ЭтаФорма.Закрыть(ИдентификаторНовогоРасширения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СохранитьРасширениеВызовСервера()
	
	Для Каждого ТекСобытие Из События Цикл
		ТекСобытие.Код = СтрЗаменить(ТекСобытие.Код, Символы.ВК+Символы.ПС, Символы.ПС);	
	КонецЦикла;
	
	РезультатСохранения = МодульОбъекта().СохранитьРасширение(ЭтаФорма,Истина); //Истина Управляемая
	
	Если Не РезультатСохранения.Успешно Тогда
		Если Не РезультатСохранения.ТаблицаОшибокПроверки.Количество() = 0 Тогда 		//не прошли проверку
			Для Каждого СтрокаОшибки Из РезультатСохранения.ТаблицаОшибокПроверки Цикл
				Сообщить(СтрокаОшибки.ОписаниеОшибки);
			КонецЦикла;
		Иначе	                                                                 		//не удалось записать в базу
			Сообщить(РезультатСохранения.ОписаниеОшибки);
		КонецЕсли;
		Возврат Ложь;
	Иначе                                                                        		//запись прошла успешно
		ИдентификаторНовогоРасширения = РезультатСохранения.Идентификатор;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // СохранитьРасширениеВызовСервера()

&НаКлиенте
Процедура ОткрытьИсходныйКод(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	ОткрытьЛистингИсходногоКода();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЛистингИсходногоКода()
	
	ТекущаяСтрокаДанные = Элементы.События.ТекущиеДанные;
	Если ТекущаяСтрокаДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Очистить();
	ТекстовыйДокумент.УстановитьТекст(ТекущаяСтрокаДанные.ИсходныйКод);
	ТекстовыйДокумент.ТолькоПросмотр = Истина;
	ТекстовыйДокумент.Показать("Исходный код обработчика события """ + ТекущаяСтрокаДанные.Имя + """");
	
КонецПроцедуры

&НаКлиенте
Процедура ОРасширенииНажатие(Элемент)               
              
	НоваяМетрика().НажатаКнопка(Элемент).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если РасширениеСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ПоказатьСвойства(ТабДокумент);
	
	ТабДокумент.ОтображатьСетку=Ложь;
	ТабДокумент.ТолькоПросмотр=Истина;
	ОбластьЗаголовка=ТабДокумент.Область("R2");
	ОбластьЗаголовка.Шрифт = Новый Шрифт(,14,);
	
	ТабДокумент.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСвойства(ТабДокумент)
	
	МодульОбъекта().ПоказатьСвойстваРасширения(ТабДокумент,РасширениеСсылка);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОсновнаяФорма = ОсновнаяФорма();
	
	Если ОсновнаяФорма <> Неопределено Тогда
		
		ОсновнаяФорма.ПриЗакрытииФормы(ЭтаФорма, "ФормаРасширения_ЭлементУправляемая");
		
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция АдресХранилищаИсходниковРедактораКода1С()
	
	Кэшировать 				= Истина;
	ИскатьНаСервере 		= Ложь; 
	ИскатьВОсновномМодуле 	= Истина;
	ИскатьВоВнешнемМодуле 	= Ложь;
	
	ДанныеМакета = МодульОбъекта().ПолучитьМакет_КонтурEDI("РедакторКода1С",
															"zip",
															Кэшировать,
															ИскатьНаСервере,
															ИскатьВОсновномМодуле,
															ИскатьВоВнешнемМодуле);
															
	Возврат ПоместитьВоВременноеХранилище(ДанныеМакета, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ИзвлечьИсходникиРедактораКода1С()
	
	ИмяКаталога = КаталогВременныхФайлов();	
	КаталогИсходников = ИмяКаталога + "bsl_console\";
	Файл = Новый Файл(КаталогИсходников);
	ИндексныйФайл = Новый Файл(КаталогИсходников + "index.html"); 
	Если НЕ Файл.Существует() ИЛИ НЕ ИндексныйФайл.Существует() Тогда
		УдалитьФайлы(КаталогИсходников, "*.*");
		ИмяФайла = КаталогИсходников + "bsl_console.zip";
		АдресМакета = АдресХранилищаИсходниковРедактораКода1С();
		ДанныеМакета = ПолучитьИзВременногоХранилища(АдресМакета);
		ДанныеМакета.Записать(ИмяФайла);
		Попытка
			Файл = Новый ЧтениеZipФайла(ИмяФайла);
			Файл.ИзвлечьВсе(КаталогИсходников);
			
		Исключение
			ИсходникиЗагружены = Ложь;
			Возврат;
		КонецПопытки;
	КонецЕсли;  
	
	ТочкаВхода = КаталогИсходников + "index.html";
	КодHTML = ТочкаВхода;
	ИсходникиЗагружены = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КонсольСформирована(Элемент)
	
	Если ИсходникиЗагружены Тогда
		
		Попытка
			ИнициализацияРедактора();
			
			Если Элементы.События.ТекущаяСтрока = Неопределено Тогда
				Элементы.События.ТекущаяСтрока = 0;		
			КонецЕсли;
			
			ТекущаяСтрока = Элементы.События.ТекущиеДанные;
			Если ТекущаяСтрока = Неопределено И Не События.Количество() = 0 Тогда
				ТекущаяСтрока = События[0];
				ТекущееСобытие = ТекущаяСтрока.Имя;
				ТекстСобытия   = ТекущаяСтрока.Код;
			Иначе 
				ТекстСобытия = ПолучитьТекстСобытия();	
			КонецЕсли;
			
            ИспользуетсяРедакторКода = Истина; 
            УстановитьТекстСобытия(ТекстСобытия);
			
		Исключение
			КодHTML = "";
			ИспользуетсяРедакторКода = Ложь;
			ИсходникиЗагружены = Ложь;
		КонецПопытки;
		УстановитьДоступность();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция РедакторКода1С()
	
	Возврат Элементы.КодHTML.Документ.defaultView;
	
КонецФункции

&НаКлиенте
Процедура ИнициализацияРедактора()
	
	РедакторКода1С().init(Объект.ПараметрыКлиентСервер.ВерсияПлатформы1С);
	РедакторКода1С().setOption("autoResizeEditorLayout", Истина);
	РедакторКода1С().setOption("renderQueryDelimiters", Истина);
	РедакторКода1С().setOption("generateModificationEvent", Истина);
	РедакторКода1С().hideScrollX();
	РедакторКода1С().hideScrollY();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстСобытия(ТекстСобытия)
	
	Если ИспользуетсяРедакторКода Тогда
		Если ВключенРежимСравнения() Тогда
			РедакторКода1С().editor.getModifiedEditor().setValue(ТекстСобытия);		
		Иначе
			РедакторКода1С().eraseText();
			РедакторКода1С().setText(ТекстСобытия, Неопределено, Ложь);	
		КонецЕсли;
	Иначе  
		Код.УстановитьТекст(ТекстСобытия);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекстСобытия()
	
	ТекстСобытия = "";
	
	Если ИспользуетсяРедакторКода Тогда
		Если ВключенРежимСравнения() Тогда
			ТекстСобытия = РедакторКода1С().editor.getModifiedEditor().getValue();
		Иначе
			ТекстСобытия = РедакторКода1С().getText();
		КонецЕсли;
	Иначе  
		ТекстСобытия = Код.ПолучитьТекст();
	КонецЕсли;
	
	Возврат ТекстСобытия;
	
КонецФункции

&НаКлиенте
Процедура УстановитьГраницыВыделенияСобытия(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки)
	
	Если ИспользуетсяРедакторКода Тогда
		РедакторКода1С().setSelection(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
	Иначе
		Элементы.Код.УстановитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРежимСравнения(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если ИспользуетсяРедакторКода Тогда
		
		Если НЕ ВключенРежимСравнения() Тогда
			ТекущаяСтрока = Элементы.События.ТекущиеДанные;
			Если ТекущаяСтрока <> Неопределено Тогда
				УстановитьТекстСравненияСобытия(ТекущаяСтрока.ИсходныйКод);	
			КонецЕсли;	
		Иначе
			УстановитьТекстСравненияСобытия("");	
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстСравненияСобытия(ИсходныйКод)
	
	Если ИспользуетсяРедакторКода Тогда
		Если ЗначениеЗаполнено(ИсходныйКод) Тогда
			КодСобытия = ПолучитьТекстСобытия();
			РедакторКода1С().originalText = ИсходныйКод;
			РедакторКода1С().compare(КодСобытия, Истина, Истина);
		Иначе
			КодСобытия = ПолучитьТекстСобытия();
			РедакторКода1С().originalText = КодСобытия;
			РедакторКода1С().compare();
			РедакторКода1С().setLanguageMode("bsl");
			РедакторКода1С().minimap(Истина);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ВключенРежимСравнения()
	
	РежимСравнения = Ложь;
	
	Если ИспользуетсяРедакторКода Тогда
		РежимСравнения = РедакторКода1С().editor.navi <> Неопределено;	
	КонецЕсли;
	
	Возврат РежимСравнения;
	
КонецФункции

&НаКлиенте
Процедура КодHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	ОбработатьСобытиеРедактора(ДанныеСобытия.Event.eventData1C);
КонецПроцедуры   

&НаКлиенте
Процедура ОбработатьСобытиеРедактора(Событие)
	
	Если Событие <> Неопределено Тогда
		
		ИмяСобытия = Событие.event;
		
		Если ИмяСобытия = "EVENT_QUERY_CONSTRUCT" Тогда
			ВызватьКонструкторЗапроса(Событие.params);
		КонецЕсли;
		
		Если ИмяСобытия = "EVENT_FORMAT_CONSTRUCT" Тогда
			ВызватьКонструкторФорматнойСтроки(Событие.params);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииКонструктораФорматнойСтроки(ФорматнаяСтрока, ДопПараметры) Экспорт
	
	Если ФорматнаяСтрока <> Неопределено Тогда	
		ФорматнаяСтрока = СтрЗаменить(ФорматнаяСтрока, "'", "");
		ФорматнаяСтрока = """" + ФорматнаяСтрока + """";
		РедакторКода1С().setText(ФорматнаяСтрока, ДопПараметры, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторФорматнойСтроки(ФорматнаяСтрока, ДопПараметры)
	
	Конструктор = Новый КонструкторФорматнойСтроки();
	Попытка			
		Конструктор.Текст = ФорматнаяСтрока;
	Исключение
		Инфо = ИнформацияОбОшибке();
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Ошибка в тексте форматной строки:" + Символы.ПС + Инфо.Причина.Описание);
		Возврат;
	КонецПопытки;
	
	Если Объект.ПараметрыКлиентСервер.МодальностьЗапрещена Тогда
		Оповещение = Вычислить("Новый ОписаниеОповещения(""ПриЗакрытииКонструктораФорматнойСтроки"", ЭтаФорма, ДопПараметры)");
		Конструктор.Показать(Оповещение);	
	Иначе  
		Конструктор.ОткрытьМодально();
		ПриЗакрытииКонструктораФорматнойСтроки(Конструктор.Текст, ДопПараметры); 	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВопросСоздатьНовуюФорматнуюСтроку(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОткрытьКонструкторФорматнойСтроки("", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьКонструкторФорматнойСтроки(ПараметрыСтроки)
	
	Если ПараметрыСтроки = Неопределено Тогда
		ТекстВопроса = "Форматная строка не найдена." + Символы.ПС + "Создать новую форматную строку?";
		МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI("ВопросСоздатьНовуюФорматнуюСтроку", ЭтаФорма, , ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ФорматнаяСтрока = СтрЗаменить(СтрЗаменить(ПараметрыСтроки.text, "|", ""), """", "");
		ОткрытьКонструкторФорматнойСтроки(ФорматнаяСтрока, ПараметрыСтроки.range);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииКонструктораЗапросов(Текст, ДопПараметры) Экспорт
	
	Если Текст <> Неопределено Тогда
		
		Если Не РедакторКода1С().queryMode Тогда
			Текст = СтрЗаменить(Текст, Символы.ПС, Символы.ПС + "|");
			Текст = СтрЗаменить(Текст, """", """""");
			Текст = """" + Текст + """";
		КонецЕсли;
		
		РедакторКода1С().setText(Текст, ДопПараметры, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапроса(Текст, ДопПараметры)
	
	Попытка
		Конструктор = Вычислить("Новый КонструкторЗапроса()");
	Исключение
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Открытие конструктора запроса не поддерживается");
		Возврат;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Текст) Тогда
		Попытка
			Конструктор.Текст = Текст;
		Исключение
			Инфо = ИнформацияОбОшибке();
			МодульОбъектаКлиент().Предупреждение_КонтурEDI("Ошибка в тексте запроса:" + Символы.ПС + Инфо.Причина.Описание);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		Оповещение = Вычислить("Новый ОписаниеОповещения(""ПриЗакрытииКонструктораЗапросов"", ЭтаФорма, ДопПараметры)");
		Конструктор.Показать(Оповещение);		
	Исключение
		МодульОбъектаКлиент().Предупреждение_КонтурEDI("Открытие конструктора запроса не поддерживается");	
	КонецПопытки;       
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСоздатьНовыйЗапрос(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОткрытьКонструкторЗапроса("", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьТекстЗапроса(Текст)
	
	ТекстЗапроса = СтрЗаменить(Текст, "|", "");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """""", "$");	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """", "");	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$", """");
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаКлиенте
Процедура ВызватьКонструкторЗапроса(ПараметрыЗапроса)
		
	Если ПараметрыЗапроса = Неопределено Тогда
		ТекстВопроса = "Не найден текст запроса." + Символы.ПС + "Создать новый запрос?";
		МодульОбъектаКлиент().ПоказатьВопрос_КонтурEDI("ВопросСоздатьНовыйЗапрос", ЭтаФорма, , ТекстВопроса, РежимДиалогаВопрос.ДаНет);  
	Иначе
		ТекстЗапроса = ПодготовитьТекстЗапроса(ПараметрыЗапроса.text);
		ОткрытьКонструкторЗапроса(ТекстЗапроса, ПараметрыЗапроса.range);
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПереключитьРедактор(Команда)               
              
	НоваяМетрика().НажатаКнопка(Команда).НаФорме(ЭтаФорма).ПоместитьВОчередь();             
	
	Если ИспользуетсяРедакторКода Тогда
		
		ТекстСобытия = ПолучитьТекстСобытия();
		
		ИсходникиЗагружены = Ложь;		
		ИспользуетсяРедакторКода = Ложь;	
		
		УстановитьТекстСобытия(ТекстСобытия);
		
	Иначе 
		
		ИсходникиЗагружены = Истина;	
		
	КонецЕсли;      
	
	УстановитьДоступность();
	
КонецПроцедуры 
