// Контур EDI - Криптография на сервере
//
// Используемые методы криптографии:
// Новый МенеджерКриптографии()
// МенеджерКриптографии.Подписать()
// МенеджерКриптографии.Расшифровать()
// МенеджерКриптографии.ПолучитьХранилищеСертификатов()
// ХранилищеСертификатов.ПолучитьВсе()
// ХранилищеСертификатов.НайтиПоОтпечатку()

Функция Версия() Экспорт
	
	Возврат "1.02";
	
КонецФункции

//-------------------------------------------------------------------------------------------------
// Экспортные методы
//-------------------------------------------------------------------------------------------------

Функция МассивСертификатов(ДанныеАвторизации, ТолькоДействующие = Истина) Экспорт
	
	МассивСертификатов = Новый Массив;

	Попытка 
				
		МенеджерКриптографии1С = МенеджерКриптографии1С(ДанныеАвторизации);
		ХранилищеСертификатов1С = ХранилищеСертификатов1С(МенеджерКриптографии1С);
		
		КоллекцияСертификатовХранилища = ХранилищеСертификатов1С.ПолучитьВсе(); 
		
		Для Каждого Сертификат Из КоллекцияСертификатовХранилища Цикл
			
			Если Сертификат.ИспользоватьДляПодписи = Ложь 
				ИЛИ Сертификат.ИспользоватьДляШифрования = Ложь Тогда
				Продолжить;	
			КонецЕсли;
			
			Если ТолькоДействующие
				И КонецДня(Сертификат.ДатаОкончания) < ТекущаяДата() Тогда
				Продолжить;
			КонецЕсли;
			
			РеквизитыСертификата = ПреобразоватьСертификатВСтруктуру(Сертификат, ДанныеАвторизации.СписокСвойствСертификата);
			МассивСертификатов.Добавить(РеквизитыСертификата);
			
		КонецЦикла;
			
	Исключение
		
		ТекстОшибки = "Не удалось получить сертификаты из серверного хранилища сертификатов по причине:
					  |" + ОписаниеОшибки();  
		
        ЗаписьЖурналаРегистрации("Контур.EDI", УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
		
	КонецПопытки;
	
	Возврат МассивСертификатов;
	
КонецФункции

Функция ПолучитьПодписьФайлаДокумента(АдресФайла, ДанныеАвторизации, Результат) Экспорт
	
	Попытка
		
		Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
			
			ПутьКФайлу = ПолучитьИмяВременногоФайла();
			Файл = ПолучитьИзВременногоХранилища(АдресФайла);
			Файл.Записать(ПутьКФайлу);
			
			Контент = ПутьКФайлу;
			
		Иначе     
			
			Контент = АдресФайла;				
			
		КонецЕсли;

		МенеджерКриптографии1С = МенеджерКриптографии1С(ДанныеАвторизации);
		Сертификат = ПолучитьСертификат1СПоОтпечатку(ДанныеАвторизации);
		Подпись = МенеджерКриптографии1С.Подписать(Контент, Сертификат); //Подписать()
		ШифрованнаяПодпись = Base64Строка(Подпись);
		
		Результат.Успешно = Истина;
		Результат.Вставить("ШифрованнаяПодпись", ШифрованнаяПодпись);
		
	Исключение
		
		Результат.ОписаниеОшибки = ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСертификат1СПоОтпечаткуСтруктура(ДанныеАвторизации) Экспорт
	
	Сертификат = ПолучитьСертификат1СПоОтпечатку(ДанныеАвторизации);
	
	Возврат ПреобразоватьСертификатВСтруктуру(Сертификат, ДанныеАвторизации.СписокСвойствСертификата);
	
КонецФункции

Функция ПолучитьСертификат1СПоОтпечаткуBase64(ДанныеАвторизации) Экспорт
	
	Сертификат = ПолучитьСертификат1СПоОтпечатку(ДанныеАвторизации);
	
	Возврат Base64Строка(Сертификат.Выгрузить());
	
КонецФункции

Функция РасшифроватьЗашифрованныйТокен(ЗашифрованныйТокен, ДанныеАвторизации) Экспорт
	
	Токен = "";
	
	Попытка

		МенеджерКриптографии1С = МенеджерКриптографии1С(ДанныеАвторизации);
		РасшифрованныеДанные = МенеджерКриптографии1С.Расшифровать(ЗашифрованныйТокен); //Расшифровать()
		ТокенВСтроках = Base64Строка(РасшифрованныеДанные);
		
		НомерСтроки = 1; //объединим все строки в одну
		ОчереднаяСтрока = СтрПолучитьСтроку(ТокенВСтроках,НомерСтроки);
		Пока ОчереднаяСтрока<>"" Цикл
			Токен = Токен + ОчереднаяСтрока;
			НомерСтроки = НомерСтроки + 1;
			ОчереднаяСтрока = СтрПолучитьСтроку(ТокенВСтроках,НомерСтроки);
		КонецЦикла;
		
	Исключение
		
		_ОписаниеОшибки = ОписаниеОшибки();
		ТекстСообщения = "Не удалось расшифровать токен авторизации в Диадок с помощью Менеджера криптографии 1С по причине:
							|	" + _ОписаниеОшибки;
		ВызватьИсключение ТекстСообщения;
		
	КонецПопытки;
	
	Возврат Токен;
	
КонецФункции

//-------------------------------------------------------------------------------------------------
// Работа с криптографией
//-------------------------------------------------------------------------------------------------

Функция МенеджерКриптографии1С(ДанныеАвторизации)
	
	Попытка
		
		МенеджерКриптографии1С = Новый МенеджерКриптографии(ДанныеАвторизации.ИмяМодуляКриптографии,
															ДанныеАвторизации.ПутьМодуляКриптографии,
															ДанныеАвторизации.ТипМодуляКриптографии);
		
	Исключение
		
		НастройкиКриптографии = ОпределитьНастройкиКриптографии(ДанныеАвторизации.ВариантыНастроекКриптографии);
		
		Если НастройкиКриптографии = Неопределено Тогда
			ВызватьИсключение "Не удалось определить настройки криптографии на сервере";
		КонецЕсли; 
		
		ДанныеАвторизации.Вставить("ИмяМодуляКриптографии",	НастройкиКриптографии.ИмяМодуляКриптографии);		
		ДанныеАвторизации.Вставить("ПутьМодуляКриптографии",НастройкиКриптографии.ПутьМодуляКриптографии);
		ДанныеАвторизации.Вставить("ТипМодуляКриптографии",	НастройкиКриптографии.ТипМодуляКриптографии);
		ДанныеАвторизации.Вставить("Расположение", 			"сервер");
		
		МенеджерКриптографии1С = Новый МенеджерКриптографии(ДанныеАвторизации.ИмяМодуляКриптографии,
															ДанныеАвторизации.ПутьМодуляКриптографии,
															ДанныеАвторизации.ТипМодуляКриптографии);
		
	КонецПопытки;														
	
	Если ДанныеАвторизации.Свойство("ПарольКонтейнера") Тогда
		МенеджерКриптографии1С.ПарольДоступаКЗакрытомуКлючу = ДанныеАвторизации.ПарольКонтейнера;
	КонецЕсли;
	
	Возврат МенеджерКриптографии1С;
	
КонецФункции

Функция ХранилищеСертификатов1С(МенеджерКриптографии1С)
	
	Попытка
		ХранилищеСертификатов1С = МенеджерКриптографии1С.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты); //ПолучитьХранилищеСертификатов()
	Исключение
		
		ТекстОшибки = "Не удалось инициализировать серверное хранилище сертификатов по причине:
							|" + ОписаниеОшибки();
		
		ЗаписьЖурналаРегистрации("Контур.EDI", УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);

		
	КонецПопытки;
		
	Возврат ХранилищеСертификатов1С;	
	
КонецФункции

Функция ПолучитьСертификат1СПоОтпечатку(ДанныеАвторизации)
	
	ДвоичныеДанныеОтпечатка = ПреобразоватьСтрокуДанныхВДвоичныеДанные(ДанныеАвторизации.Отпечаток);
	
	МенеджерКриптографии1С = МенеджерКриптографии1С(ДанныеАвторизации);
	ХранилищеСертификатов1С = ХранилищеСертификатов1С(МенеджерКриптографии1С);
		
	Возврат ХранилищеСертификатов1С.НайтиПоОтпечатку(ДвоичныеДанныеОтпечатка);
		
КонецФункции

Функция ОпределитьНастройкиКриптографии(ВариантыНастроекКриптографии)
	
	ИнформацияОСистеме = Новый СистемнаяИнформация;
	ПлатформаОС = ИнформацияОСистеме.ТипПлатформы;
	
	Для каждого ВариантНастроек Из ВариантыНастроекКриптографии Цикл
		
		СтруктураВарианта = ВариантНастроек.Значение; 
		
		Если Найти(НРег(ПлатформаОС), СтруктураВарианта.ПлатформаОС) > 0 Тогда
			
			Попытка
				
				МенеджерКриптографии1С = Новый МенеджерКриптографии(СтруктураВарианта.ИмяМодуляКриптографии, 
																	СтруктураВарианта.ПутьМодуляКриптографии, 
																	СтруктураВарианта.ТипМодуляКриптографии);
				Возврат СтруктураВарианта;
				
			Исключение
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат Неопределено;
	
КонецФункции

//-------------------------------------------------------------------------------------------------
// Вспомогательные методы
//-------------------------------------------------------------------------------------------------

Функция ПреобразоватьСтрокуДанныхВДвоичныеДанные(СтрокаДанных)

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку("<foo xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" 
	|xmlns:xsd=""http://www.w3.org/2001/XMLSchema"" xsi:type=""xsd:hexBinary"">" + СтрокаДанных + "</foo>");
	ДвоичныеДанныеДокумента = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
	Возврат ДвоичныеДанныеДокумента;

КонецФункции // ПреобразоватьСтрокуДанныхВДвоичныеДанные()

Функция ПреобразоватьСертификатВСтруктуру(Сертификат, СписокСвойствСертификата)
	
	ДанныеСертификата = Новый Структура(СписокСвойствСертификата);
	ЗаполнитьЗначенияСвойств(ДанныеСертификата, Сертификат);
	
	Возврат ДанныеСертификата;
	
КонецФункции

